{
  "image": "../../../assets/images/Department Banner/cse.jpg",
  "about": "Computer Science and Engineering (CSE) is a branch of engineering that focuses on the design, development, and implementation of computer systems and software. It encompasses various domains, including artificial intelligence, data science, cybersecurity, cloud computing, and software engineering. CSE engineers work on cutting-edge technologies such as machine learning, blockchain, IoT, and quantum computing, driving innovation across industries. With the rapid advancement of digital transformation, the field continues to evolve, enhancing automation, efficiency, and security in computing systems. As the demand for intelligent and scalable solutions grows, Computer Science and Engineering plays a vital role in shaping the future of technology, powering industries, and improving everyday life.",
  "dept-name": "Computer Science and Engineering",
  "hod_name": "Dr.S.Malliga",
  "intake": 360,
  "me": 12,
  "phd": "-",
  
  "vision": "To be a centre of excellence for nurturing competent computer professionals of high calibre and quality for catering to the ever-changing needs of the industry and society.",
  "mission": [
      "Develop innovative, competent and ethically strong computer engineers to meet global challenges.",
      "Foster consultancy and basic as well as applied research activities to solve real world problems.",
      "Endeavour for constant upgradation of technical expertise to cater to the needs of the industry and society."
  ],
  "objective": "To equip students with the necessary technical and managerial skills.",
  "peo": [
      "Utilize the fundamental knowledge of basic sciences and engineering to succeed in their professional career.",
      "Analyze, design, develop and verify computer-based solutions to real world problems.",
      "Exhibit soft skills, ethical code of conduct and ability for life-long learning."
  ],
  "po": [
      "Engineering knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems.",
      "Problem analysis: Identify, formulate, research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences.",
      "Design/development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations.",
      "Conduct investigations of complex problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions.",
      "Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.",
      "The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.",
      "Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.",
      "Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.",
      "Individual and team work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings.",
      "Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions.",
      "Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments.",
      "Life-long learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change."
  ],
  "pso": [
      "Foundations of Computer Science : Ability to use the mathematical and computing knowledge to propose viable ideas and solutions to solve real world problems.",
      "Software design and Development: Ability to develop computer based systems using engineering skills, knowledge of software design process, programming languages and tools."
  ],

    "highlights": {
      "Consistent improvement in Placement and Internship": true,
      "Funded Research Projects": [
        "Total: Rs. 93.51 lakh",
        "Completed: 6 projects worth Rs. 43.43 lakh",
        "Ongoing: 4 projects worth Rs. 50.08 lakh"
      ],
      "Student Projects": [
        "8 TNSCST Student projects completed worth Rs. 51,000"
      ],
      "Workshops & Seminars": [
        "Organized funded seminars and workshop programs worth Rs. 33.59 lakh"
      ],
      "Consultancy": [
        "Completed consultancy works worth Rs. 29.3 lakh",
        "Generated a revenue of Rs. 9.14 Lakh through consultancy (2024)"
      ],
      "MoUs": [
        "Signed MoUs with leading industries and universities like Infosys, Taylor's University Malaysia, UTP Malaysia, and Fortinet"
      ],
      "Conferences Organized": [
        "3 International Conferences",
        "12 National Conferences"
      ],
      "Research Centre": [
        "88 Research Scholars completed PhD",
        "28 pursuing PhD"
      ],
      "Awards & Recognitions": [
        "Best Single Point of Contact award from Infosys (2016)",
        "CSI – Longest Continuous Student Branch Coordinator award (2017, 2018, 2019)",
        "CSI - Best Accredited Student Branch award (2017, 2018, 2019)",
        "Best Performing Department in Implementation of MoU (2019-20)",
        "Shri P.K. Das Memorial Best Faculty Award (2015)",
        "Best Reviewer Award by IEEE (2015)",
        "Outstanding Women in Engineering by VIFA (2016)",
        "Inspire Faculty Excellence Award from Infosys (2016 & 2017)",
        "Silver Medal in International Eureka Innovation Exhibition (2021)"
      ],
      "Faculty Achievements": [
        "Summer Research Fellowships by faculty at IITG, SMIT, IDRBT"
      ],
      "Student Achievements": [
        "Received KPIT Sparkle fund for the project 'Noninvasive Glucose Level Monitoring System'",
        "Two teams won First Prize with Rs. 1 Lakh prize amount in Smart India Hackathon Software Edition (2024)"
      ],
      "Centres of Excellence": [
        "Established Centre of Excellence in Cyber Security with Fortinet (2022)"
      ],
      "Grants Received": [
        "AICTE ATAL FDP worth Rs. 6,00,000 on 'Advancing Healthcare and Med-Tech through Machine Learning' (2024)",
        "AICTE research grant of Rs. 1,50,000 for the project 'Tomatix: Revolutionizing Crop Planning and Market Intelligence' (2024)",
        "ICSSR research grant of Rs. 8,64,000 for the project 'Development of AI-Enabled Deep Learning Models for Cyberbullying Detection in Online Social Media' (2024)",
        "TNSDC research grant of Rs. 10,000 for the student project 'Legalease: Empowering Marginalized Communities with Multilingual Legal Assistance' (2024)"
      ],
      "NPTEL-SWAYAM Courses": [
        "Continuously offering NPTEL-SWAYAM course on 'Problem-Solving Aspects and Python Programming' since 2020"
      ]
    },  
    "milestones": [
      {
        "year": 2025,
        "event": "Signed MoU with Inker Robotic Solutions, VPS Codebuilders."
      },
      {
        "year": 2024,
        "event": [
          "Reaccredited by NBA.",
          "Increase in intake to 360.",
          "Signed MoU with Digiplus."
        ]
      },
      {
        "year": 2023,
        "event": "Establishment of Foundation Lab-6 (Web Technologies)."
      },
      {
        "year": 2022,
        "event": "Centre of Excellence in Cyber Security"
      },
      {
        "year": 2021,
        "event": "MoU with Taylor's University, Malaysia"
      },
      {
        "year": 2020,
        "event": "Reaccredited by NBA"
      },
      {
        "year": 2019,
        "event": "Established GPU Computing Facility under FIST Scheme"
      },
      {
        "year": 2018,
        "event": [
          "Established High Performance Computing Lab under MODROB Scheme.",
          "MoU with UTP, Malaysia."
          ]
      },
      {
        "year": 2017,
        "event": "Reaccredited by NBA."
      },
      {
        "year": 2016,
        "event": "Establishment of Virtual Computing Lab and Mobile Computing Lab with IoT specialization."
      },
      {
        "year": 2014,
        "event": "Establishment of Cloud Computing and Wireless Application Development Labs."
      },
      {
        "year": 2012,
        "event": "Reaccredited by NBA."
      },
      {
        "year": 2006,
        "event": "Reaccredited by NBA."
      },
      {
        "year": 2002,
        "event": "Accredited by NBA."
      },
      {
        "year": 2001,
        "event": "Recognized as research centre for PhD programme."
      },
      {
        "year": 1998,
        "event": "ME(CSE) programme commenced."
      }
      
         ],

    "labs": [
      {
        "topic": "Software Development Laboratory",
        "detail": "Software Development Lab,Equipped with 38 system running Windows 11 and Ubuntu 20 in a dual OS setup, offers a diverse learning environment for developers. This configuration enables hands-on experience with different operating systems, fostering versatile skill development. Developers can create cross-platform applications, practice coding and work on networking projects. With high-performance computers and pre-installeddevelopment tools, the lab supports seamless collaboration and efficient seamless collaboration and efficient code management, preparing developers for real-world software challenges.",
        "image": "/assets/images/Laboratories/Cse/sd_lab.jpg"
      },
      {
        "topic": "Free/Open Source Software Laboratory",
        "detail": "Free/Open Source Software (FOSS) Laboratory is equipped with 38 systems running Ubuntu 20 and Windows 11 in a dual OS setup. It promotes and supports the development and use of free and open-source softwares. It facilitates research and development activities related to FOSS. It provides a collaborative environment for developers, students, and researchers to work on various Open source software like Linux, Network Simulators, Mysql, Eclipse and Glomosim. They can understand the purpose of open source tools in real time application development. Support the principles of software freedom, which include the ability to use, modify, and distribute software without restrictive licenses.",
        "image": "/assets/images/Laboratories/Cse/foss_lab.jpg"
      },
      {
        "topic": "Internet Programming Laboratory",
        "detail": "Internet Programming Laboratory is mainly utilized by the students for developing dynamic web applications using the tools like adobe dreamweaver and adobe photoshop.The Students are also facilitated to use the freely available open source tools like XAMPP/WAMP Servers.",
        "image": "/assets/images/Laboratories/Cse/cc5.jpg"
      },
      {
        "topic": "Multimedia Lab & PG Laboratory",
        "detail": "The lab is equipped with state-of-art infrastructure and latest/popular software’s to build proficiency in students in Multimedia and Animation to cater to the needs of growing Animation and Multimedia Industry. Students are enabled to apply knowledge, techniques, skills of modern multimedia tools in different digital media disciplines like text, images, audio, video and animation (2D & 3D).",
        "image": "/assets/images/Laboratories/Cse/multimedia_lab.png"
      },
      {
        "topic": "Cloud Computing Laboratory",
        "detail": "Cloud computing lab is a dedicated environment or facility which is fully equipped with the necessary infrastructure, software, and resources to serve as a platform over hands-on learning, experimentation, and research in cloud computing technologies and services. Individuals, educational institutions, and organizations typically use these labs to gain practical experience in the field of cloud computing.",
        "image": "/assets/images/Laboratories/Cse/cloud_lab.jpg"
      },
      {
        "topic": "Wireless Application Development Lab",
        "detail": "Objective of Wireless Application Development Lab is to provide a controlled environment for the creation, testing, and optimization of wireless applications and services. These labs are typically used for research, development, and experimentation in the field of wireless technology. Lab is equipped with 36 wireless system with Ubuntu 22.0.4.",
        "image": "/assets/images/Laboratories/Cse/wireless_lab.jpg"
      },
      {
        "topic": "Mobile Communication Laboratory",
        "detail": "Mobile Communication lab is equipped with 36 system with internet facitlity, Raspberry Pis, Arduinos and corresponding shields and Modules. Lot many sensors in the lab to explore myriad of applications. In this lab students can gain hands on experience (through student projects) in the field of IoT based application development.",
        "image": "/assets/images/Laboratories/Cse/mad_lab.jpg"
      },
      {
        "topic": "Virtual Computing Laboratory",
        "detail": "Virtual Computing Lab, housing 72 high-performance systems, serves as a versatile space for various purposes. Primarily, it's used for educational activities, serving as a hub for students and faculty to conduct practical sessions, experiments, and demonstrations in computer science and IT courses. Additionally, it supports research and development, providing a platform for testing algorithms, running simulations, and exploring fields like artificial intelligence, cybersecurity, and data analysis. Equipped with the Ubuntu and Windows operating systems, specialized software, and a robust network infrastructure, it facilitates workshops, training sessions, and hands-on learning experiences. Technical support staff ensure smooth operations, while security measures maintain data and system integrity. Comfortable and accessible, the lab features ergonomic seating, proper lighting, and ample spacing between systems, creating an ideal environment for innovation, learning, and experimentation.",
        "image": "/assets/images/Laboratories/Cse/virtual_lab.jpg"
      },
      {
        "topic": "Foundation Laboratory - 6",
        "detail": "Foundation Lab – 6 (Web Technologies) is equipped with 72 computer systems along with good internet facility. This lab is set up with the main motive for providing skill training to the first year students of all streams in the area of web development. Students are trained to build a complete dynamic website using the technologies such as HTML, CSS, Java Script, PHP and MySQL.",
        "image": "/assets/images/Laboratories/Cse/foundation_lab.jpg"
      }
    ],
    
    "library": {
      "name": "Computer Science and Engineering Department Library((Common to CSE and IT)",
      "description": "The Computer Science and engineering department has a separate department library to cater to the specific needs of the Automobile Engineering students. The following is the consolidated data related to the department library.",
      "details": {
        "total_area": "232 sq.m",
        "number_of_volumes": 1801,
        "number_of_titles": 1391,
        "number_of_project_report_cd": 108,
        "value_of_books_in_rs": "11.11Lakh",
        "number_of_journals": "24",
        "value_of_journals_in_rs": "77925.00",
        "working_hours": "8:40 AM to 4:30 PM"
      }
    },
    "rnd": {
      "academic": "https://rnd.kongu.edu/academic/cse.php",
      "activities":"https://rnd.kongu.edu/activities/cse/index.php"
    },    
  "dept_images": [
      "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
  ]
}