{
  "image": "../../../assets/images/Department Banner/it.jpg",
  "about": "Information Technology (IT) is a branch of engineering that focuses on the development, management, and security of information systems and digital infrastructure. It encompasses various domains, including software development, cloud computing, cybersecurity, data analytics, networking, and artificial intelligence. IT engineers work on cutting-edge technologies such as blockchain, IoT, big data, and automation to enhance efficiency, security, and connectivity across industries. With the rapid evolution of digital transformation, the field continues to grow, driving innovation in business, healthcare, finance, and communication. As the demand for scalable, secure, and intelligent solutions increases, Information Technology plays a crucial role in shaping the digital future and improving technological advancements worldwide.",
  "dept-name": "Information Technology",
  "hod_name": "Dr.S.Anandamurugan",
  "intake": 180,
  "Ph.D": "-",
  
  "vision": "To be a centre of excellence for development and dissemination of knowledge in Information Technology for the nation and beyond.",
  "mission": [
      "To transform the students into innovative, competent and high quality IT professionals to meet the growing global challenges.",
      "To impart value-based IT education to the students and enrich their knowledge.",
      "To endeavour for continuous upgradation of technical expertise of students to cater to the needs of the society.",
      "To achieve an effective interaction with industry for mutual benefits."
  ],
  "objective": "To equip students with the necessary technical and managerial skills.",
  "peo": [
      "Excel in industry and higher education by applying fundamental knowledge in engineering principles.",
      "Analyze, design and implement Information Technology based solutions to meet the real world problems.",
      " Exhibit Soft skills, Professional and Ethical values and thrust for continuous learning for a successful professional career."
  ],
  "po": [
      "Engineering knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems..",
      "Problem analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences and engineering sciences.",
      "Design/development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal and environmental considerations..",
      "Conduct investigations of complex problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data and synthesis of the information to provide valid conclusions.",
      "Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.",
      "The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.",
      "Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.",
      "Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.",
      "Individual and team work: Function effectively as an individual, and as a member or leader in diverse teams and in multidisciplinary settings.",
      "Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions.",
      "Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments.",
      "Life-long learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change."
  ],
  "pso": [
      "Foundations of IT: Comprehend mathematical and computational methodologies to address the problems of various domains.",
      "Providing IT solutions: Analyze, design and implement IT enabled solutions to meet industrial needs using appropriate tools and techniques."
  ],

    "highlights": {
      "Accreditations": [
        "Accredited by NBA three times",
        "Anna University approved Research Centre"
      ],
      "Funded Research Projects": [
        "Completed 9 funded Research Projects"
      ],
      "Conferences Organized": [
        "National: 8",
        "International: 4"
      ],
      "MoUs": [
        "20 MoUs signed with leading industries and start-ups",
        "Overall Best Implementation of MoUs Award (2023)",
        "Overall Best Implementation of MoUs Award (2024)"
      ],
      "Awards & Recognitions": [
        "Bagged overall Best Department Award in cultural activities twice (2018 & 2019)",
        "Bagged overall Best Department Award (2019)",
        "Bagged overall Best Department Award in cultural activities twice (2022 & 2023)"
      ],
      "Centres of Excellence": [
        "Centre of Excellence in Data Science"
      ],
      "Research Centre": [
        "27 Research Scholars completed PhD",
        "43 pursuing PhD in the IT Research Centre"
      ],
      "Clubs & Activities": [
        "Android Application Development Club",
        "Coding Clubs for Competitive Programming skills"
      ],
      "Faculty Achievements": [
        "Well qualified and experienced faculty",
        "9 faculty members recognized as supervisors by Anna University, Chennai",
        "110 Books published; 6 books referred in leading universities",
        "INSA Summer Fellowship undertaken by 4 faculty members",
        "24 Patents obtained",
        "Faculty Flying Officer A. Jeevanatham secured First in Order of Merit Award in All India Pre-Commission Training Course for Associate NCC Officers conducted by Ministry of Defence, New Delhi"
      ],
      "Placement Record": [
        "Consistent placement track record of 90% with an average CTC of 4.7 LPA"
      ],
      "Student Achievements": [
        "Students won First Prize (Rs. 2 Lakhs) in ThinkAHack! @ KGiSL, Coimbatore",
        "Pranesh represented Tamil Nadu, Pondicherry, and Andaman Region in 70th Republic Day Parade @ New Delhi",
        "Final year student won Gold Medal in Tennis at Khelo India University Games (2022)",
        "Student won in silver category of Tamil Nadu Startup Mania Thiruvizha Contest"
      ],
      "Seminars & Workshops": [
        "Organized two national-level seminars sponsored by CSIR and DRDO (2022)"
      ],
      "Innovations & Competitions": [
        "Conversion of Projects into Papers",
        "Conducted Thoorigai, a competition for differently-abled children"
      ]
    },  
    "milestones": [
      {
        "year": 2025,
        "event": "K.Pavithra(II year), P.Varshini (II Year) & Varsha S (IV Year) won Silver Medal in Hand Ball (Women) of Anna University Inter Zone Handball Tournament held at PSNA College of Engineering and Technology, Dindigul on 27.01.2025 & 28.01.2025."
      },
      {
        "year": 2024,
        "events": [
         "Overall Best Implementation of MoUs Award’24.",
         "Our students won First Prize with a cash award of Rs. 50,000 in 'SIH 2024' at IIT Guwahati, Assam.",
         "Raghul P of II Year won First Prize in the KIMO Contest with a cash prize of Rs.25,000.",
         "Janishaa V of II Year won a prize in the Engineers Day Contest 2024.",
         "Our students won prize in Internal KEC SIH Hackathon 2024.",
         "Krisvanth P of IV year won overall best outgoing award 2024."
        ]
      },
      {
        "year": 2023,
        "event": [
          "Varsha S (21ITR115) of II year won Gold Medal in Table Tennis (Women) of Anna University Zone 12 held at Nandha College of Technology, Perundurai on 01.11.2022.",
          "Varsha S (21ITR115) of II year won Gold Medal in Basketball (Women) of Anna University Zone 12 held at Kongu Engineering College, Perundurai on 13.11.2022.",
          "Arjun A (21ITR007) of II year won Silver Medal in Basketball (Men) of Anna University Zone 12 held at Kongu Engineering College, Perundurai on 12 & 13.11.2022.",
          "MoU signed with M/s. Rural Child Development Trust, Salem.",
          "Overall Best Implementation of MoUs Award’23.",
          "Overall Best outgoing student(female) and non-teaching staff.",
          "Overall Best department Award in Intra college Cultural Festival Enthusia’23."
        ]
        },
      {
        "year": 2022,
        "events": [
          "Centre of excellence in Data Science established",
          "MoUs Signed with M/s.Codechef, Bangalore and M/s.IntersectIQ Bangalore.",
          "Nitin Pranav S M (18ITR065) of IV year won Gold Medal in Tennis, Khelo India University Games 2022 and bagged best outgoing sportsmen award.",
          "Overall Best department Award in Intra college cultural Festival Enthusia’22.",
          "Conducted a DRDO sponsored national level seminar on “Role of post quantum cryptography in defence and security of future India.”",
          "Conducted a CSIR sponsored national level seminar on “Tackling cyber crimes against women and children with latest cyber security techniques.”"
        ]
      },
      {
        "year": 2021,
        "events": [
          "Commencement of B.Tech. Artificial Intelligence and Data Science & B.Tech. Artificial Intelligence and Machine Learning with an intake of 60.",
          "Coding Club Started for encouraging Competitive Programming.",
          "MoUs Signed with M/s. Mallow Technologies Pvt Ltd Karur, M/s. Schnell Energy Equipments Pvt. Ltd CBE, M/s Terzo USA, M/s.Stepping EDGE & Commerce CBE and M/s.Cetas, Chennai."
        ]
      },
      {
        "year": 2019,
        "event": [
        "Organized an FDP on “Internet of Things: Vision, Architecture, Building Applications and Research Challenges” sponsored by AICTE.",
        "Students won first prize (Rs.2 Lac) in ThinkAHack ! organized by KGiSL, Coimbatore.",
        "Our student M.Pranesh represented Tamilnadu, Pondicherry and Andaman Region in 70th Republic day Parade @ New Delhi.",
        "Adjudged as Best department of the year.",
        "Overall Best department Award in Intra college cultural Festival Enthusia’19.",
        "Enterprise Resource Planning cell established.",
        "Reaccredited by NBA."
     ]
     },
      {
        "year": 2018,
        "events": [
         "Organized International Conference on Intelligent Computing and Communication for Smart World 2018.",
          "Overall Best department Award in Intra college cultural Festival Enthusia’18."
        ]
      },
      {
        "year": 2017,
        "events": [
          "Wireless Networks Laboratory and Computing Laboratory established.",
          "Organized an FDP on Introduction to R Programming sponsored by ICT Academy."
        ]
      },
      {
        "year": 2016,
        "events": [
          "Organized SERB Sponsored National-Level Seminar on “Climate Smart Agriculture: Multi-Disciplinary Approaches using IoT, Cloud and Big Data”.",
          "A minor research project on “Pattern Improvement in Rank based Association Rule Mining for Energy Conservation in Wireless Sensor Networks” sponsored by UGC, New Delhi.",
          "Conducted 9 self-supported workshops.",
          "Sri Meenakshi bagged overall Best student in Extra Curricular Activities.",
          "J.Nilafer bagged overall Best outgoing student (Female)."
        ]
      },
      {
        "year": 2015,
        "events": [
          "Organized DBT Sponsored National level seminar on “Data Science: Scope of Big Data in Genomic Sequencing and Diagnostic Imaging”.",
          "Organized DBT Sponsored National level conference on “Advanced Computational Intelligence Techniques for Big Data in Biomedicine and its Applications”.",
          "Organized NBHM sponsored seminar on “Stochastic Modelling and Probabilistic Calculation for Wireless Networks”"
        ]
      },
      {
        "year": 2014,
        "events": [
          "Conducted two IIT Bombay sponsored programmes on “Computer Networking” and “Cyber Security”.",
          "A project titled “Energy Efficient Pollution Monitoring system using Wireless Sensor Networks” sponsored by Computer Society of India.",
          "R.Jeya Sri Bagged overall Best Sports Woman Award."
        ]
      }
    ]  ,

    "labs": [
      {
        "topic": "System Software Laboratory",
        "detail": "The objective of system software lab is to make students familiarized with various operating systems (open source) particularly Linux and debian distributions like Fedora and Ubuntu. This lab is used for conducting a practical classes in courses like Data Structures & Analysis algorithms, C Programming, Java programming .Various software projects in languages like C, C++, and Java & Python are also done in this laboratory. Since high end projector is available, this lab is utilized for conducting project reviews ,Training programs ,One credit & value added courses in this laboratory .More over Mat lab software is available in this lab for learning & doing projects. This lab is equipped with 38 personal computers of high end configuration.",
        "image": "/assets/images/Laboratories/It/ssw_lab.jpg"
      },
      {
        "topic": "RDBMS Laboratory",
        "detail": "In this lab there are 38 personal computers with high end configuration & 3 printers. This lab is utilized for conducting practical classes in courses like DBMS, OS & Machine Learning. This lab is prominently used for enabling the students to gain hands on experience in App Development, SQL queries. This lab is also utilized for conducting project reviews, one credit courses and doing projects. More over presentations like Ph.D. Viva voce, project & Paper Presentation done by the students are conducted in this lab.",
        "image": "/assets/images/Laboratories/It/rdbms.jpg"
      },
      {
        "topic": "Network Laboratory",
        "detail": "Network laboratory provides hands-on experience to various concepts studied by the undergraduate and postgraduate students related to Computer and Communication Networks. This lab is also an emphasis on experimental research in communication networking, in recent years there have also been contributions to networks and network security. This lab helps to explain the importance of data communications and the Internet in supporting business communications and daily activities. Also explains how communication works in data networks and Internet. This lab helps to recognize the different internetworking devices and their functions and also explain the role of protocols in networking. It is equipped with with latest configuration PC's, well connected server and client structured systems to support the study of the concepts and protocols of networking and for the effective implementation of the routing protocols. The students are trained in the laboratory to enhance their practical knowledge and to provide solutions to real time issues. Open source tools like NS2, NS3 and Wireshark are used to simulate and study the performance of various network scenarios which impart latest practical skills to students.",
        "image": "/assets/images/Laboratories/It/nw_lab.jpg"
      },
      {
        "topic": "Enterprise Computing Laboratory",
        "detail": "This Enterprise Computing Laboratory is equipped with high end HP desktop machines for enterprise application development, data analytics and cloud projects. This Lab has 73 Intel i3 machines with 10 GB RAM, exclusively dedicated for faculty members and students to take up research and strengthen their knowledge in various application development and research.",
        "image": "/assets/images/Laboratories/It/ec_lab.jpg"
      },
      {
        "topic": "CYBER SECURITY LABORATORY",
        "detail": "A cyber security laboratory at Kongu engineering college provides students with a practical learning environment to enhance their understanding of cybersecurity concepts. Equipped with cutting-edge technology and software, these labs offer hands-on experiences in analyzing and securing computer systems. Students can simulate cyber attacks, practice ethical hacking, and develop skills in identifying and mitigating vulnerabilities. The lab fosters a dynamic learning atmosphere where students gain the practical expertise necessary for tackling real-world cyber threats, preparing them for careers in the rapidly evolving field of cybersecurity.",
        "image": "/assets/images/Laboratories/It/cyber_lab.jpg"
      },
      {
        "topic": "Project Laboratory",
        "detail": "The Information Technology (IT) project laboratory within the department is a specialized facility dedicated to fostering practical skills and innovation in the field. It is equipped with cutting-edge technology, including computers, servers, networking tools, and software development environments. This space serves as a hub for students to engage in hands-on projects, collaborate on software development, and explore emerging technologies. In the IT project laboratory, students have the opportunity to work on real-world projects that span various domains such as software engineering, IoT, data science, and network administration. The environment encourages teamwork, problem-solving, and creativity, providing a bridge between theoretical knowledge acquired in classrooms and its practical application in the dynamic IT industry. Guided by experienced faculty, students use the laboratory to gain practical experience in designing and implementing solutions to complex IT challenges. The lab's emphasis on experiential learning enhances students' readiness for the demands of the Information Technology sector, preparing them for successful careers in the rapidly evolving technological landscape.",
        "image": "/assets/images/Laboratories/It/project_lab.jpg"
        }
        ],
    
    "library": {
      "name": "Information Technology Department Library (Common to CSE and IT)",
      "description": "The Information Technology department has a separate department library to cater to the specific needs of the Information Technology students. The following is the consolidated data related to the department library.",
      "details": {
        "total_area": "232 sq.m",
        "number_of_volumes": 1801,
        "number_of_titles": 1391,
        "number_of_project_report_cd": 108,
        "value_of_books_in_rs": "11.11Lakh",
        "number_of_journals": "24",
        "value_of_journals_in_rs": "77925.00",
        "working_hours": "8:40 AM to 4:30 PM"
      }
    },
      "patents": {
        "details": [
          {
            "S.N": 1,
            "Name": "Pavithra",
            "Title": "Locker Control System Using Mobile Phone",
            "Patent No": "231152",
            "Status": "Granted on 03/03/2009"
          },
          {
            "S.N": 2,
            "Name": "Dr.K.Lalitha",
            "Title": "Smart Stick",
            "Patent No": "201941016422 A",
            "Status": "22.05.2019"
          },
          {
            "S.N": 3,
            "Name": "Dr.S. Anandamurugan",
            "Title": "IOT Health Care System for Indoor and Outdoor Patients using PDR",
            "Patent No": "201941043410",
            "Status": "Application filed on 20/10/2019 and published on 29/11/2019"
          },
          {
            "S.N": 4,
            "Name": "Dr.K.Lalitha",
            "Title": "Machine learning-based system for prediction of setup security-failure of artificial lift",
            "Patent No": "202011004965",
            "Status": "Application filed on 05/02/2020 and Published on 14/02/2020"
          },
          {
            "S.N": 5,
            "Name": "Dr.S. Anandamurugan",
            "Title": "Unmanned Aerial Vehicle (UAV) to autonomously and wirelessly monitor security",
            "Patent No": "202041010349",
            "Status": "Application filed on 11/03/2020 and Published on 13/03/2020"
          },
          {
            "S.N": 6,
            "Name": "Mr.D.Vijayanand",
            "Title": "Deep convolutional neural network-based computer-implemented method of walking assistance for visually impaired persons",
            "Patent No": "202011009400",
            "Status": "Application filed on 05/03/2020 and Published on 20/03/2020"
          },
          {
            "S.N": 7,
            "Name": "S.Anitha",
            "Title": "A novel multiple-access edge computing technique for ultra-reliable low-latency communication (URLLC) and massive IoT in 5G networks",
            "Patent No": "202041014796",
            "Status": "Application filed on 02/04/2020 and Published on 15/05/2020"
          },
          {
            "S.N": 8,
            "Name": "Dr.S. Anandamurugan",
            "Title": "Methane gas measuring device in food waste using Raspberry Pi, MQ-4 sensor",
            "Patent No": "202041036326",
            "Status": "Application filed on 24/08/2020 and Published on 04/09/2020"
          },
          {
            "S.N": 9,
            "Name": "Dr. M. Thangamani",
            "Title": "Method, Utility, and Device based on IoT for pandemic disease surveillance and Prediction",
            "Patent No": "202041050703",
            "Status": "Application filed on 12/11/2020 and Published on 01/01/2021"
          },
          {
            "S.N": 10,
            "Name": "Dr.K.Lalitha",
            "Title": "Soil Quality Monitoring and Enhancing the Soil Nutrients to bring good quality crops using CPS and ML Techniques",
            "Patent No": "2020103446",
            "Status": "Published on 13.01.2021"
          },
          {
            "S.N": 11,
            "Name": "Dr.T.Abirami",
            "Title": "ICMN - Object Detection System: Object Detection System with Image Classification and Machine/Deep Neural Networks",
            "Patent No": "202021053081",
            "Status": "Published on 15/01/2021"
          },
          {
            "S.N": 12,
            "Name": "Dr.T.Abirami",
            "Title": "Design and development of an automated runtime vehicle tyre monitoring unit",
            "Patent No": "202141001520",
            "Status": "Published on 22/01/2021"
          },
          {
            "S.N": 13,
            "Name": "Dr.T.Abirami",
            "Title": "CWCP - Multi-Branched Blockchain Rules: Creating A Multi-Branched Blockchain with Configurable Protocol Rules",
            "Patent No": "2021100212",
            "Status": "Published on 22/01/2021"
          },
          {
            "S.N": 14,
            "Name": "Dr.E.M.Roopadevi",
            "Title": "Hybrid Phase Change Material Embedded Over Glove For Better Comfort With AI Assistance",
            "Patent No": "202141003350",
            "Status": "Published on 05/02/2021"
          },
          {
            "S.N": 15,
            "Name": "Dr.R.Rajadevi",
            "Title": "A Smart energy metering system using the Internet of Things",
            "Patent No": "202041056467",
            "Status": "Published on 26/02/2021"
          },
          {
            "S.N": 17,
            "Name": "Dr.R.Devi Priya",
            "Title": "Adaptable Sized Water Bottle",
            "Patent No": "338774-001",
            "Status": "FER Report received on 03/04/2021"
          },
          {
            "S.N": 18,
            "Name": "Dr.K.Lalitha, D.Vijay Anand, Dr.G.K.Kamalam",
            "Title": "Automated Wearable Dietary Monitoring Device and Methods of Recommending Diet Thereof",
            "Patent No": "202141017316 A",
            "Status": "Published on 23/04/2021"
          },
          {
            "S.N": 19,
            "Name": "Dr.M.Thangamani, Dr.C.Nalini",
            "Title": "Machine Learning based lifestyle coaching system to monitor Health Risk of Lifestyle diseases",
            "Patent No": "202141020704 A",
            "Status": "Published on 14/05/2021"
          },
          {
            "S.N": 20,
            "Name": "Dr.M.Thangamani, Dr.C.Nalini, Dr.P.Malarkodi",
            "Title": "Deep Learning method based Natural Disaster Prediction system",
            "Patent No": "202141027540 A",
            "Status": "Published on 02/07/2021"
          },
          {
            "S.N": 21,
            "Name": "Dr.M.Thangamani",
            "Title": "A portable apparatus for Breathing Assistance to Monitor the patient suffer from respiratory disease",
            "Patent No": "202141028644 A",
            "Status": "Published on 09/07/2021"
          },
          {
            "S.N": 22,
            "Name": "Dr.M.Thangamani",
            "Title": "Artificial intelligence based automated Material management system",
            "Patent No": "202141024010 A",
            "Status": "Published on 18/06/2021"
          },
          {
            "S.N": 23,
            "Name": "Dr.M.Thangamani",
            "Title": "Intelligent wearable sweat sensor based device for monitoring and Recommending personal physical fitness",
            "Patent No": "202111032293",
            "Status": "Published on 18/07/2021"
          },
          {
            "S.N": 24,
            "Name": "Mrs.N.Anitha",
            "Title": "Permanent Form Work Panel for Reinforced Concrete Beams",
            "Patent No": "373852-001",
            "Status": "09/11/2022"
          },
          {
            "S.N": 25,
            "Name": "R.Sandhiya",
            "Title": "Skin Disease Detection Using Deep Learning",
            "Patent No": "202441029329 A",
            "Status": "19/04/2024"
          },
          {
            "S.N": 26,
            "Name": "K.Suruthi",
            "Title": "Stress Detection Based On Emotion Using A Convolutional Neural Network In Deep Learning",
            "Patent No": "202441029330 A",
            "Status": "19/04/2024"
          },
          {
            "S.N": 27,
            "Name": "Fg.Offr A.Jeevanantham",
            "Title": "IoT Based Temperature And Relative Humidity Detector For Concrete",
            "Patent No": "SW-19042/2024",
            "Status": "Registered of Copyrights on 20/06/2024"
          }
        ]
    },    
    "rnd": {
      "academic": "https://rnd.kongu.edu/academic/it.php",
      "activities":"https://rnd.kongu.edu/activities/it/index.php"
    },    
  "dept_images": [
      "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
  ]
}