{
  "image": "https://img.freepik.com/free-photo/person-using-ar-technology-their-daily-occupation_23-2151137517.jpg?t=st=1742316233~exp=1742319833~hmac=0445d7af0510bf642933e543fa19a030a8de1172c6bf050f78913509b2c64ce4&w=2000",
  "about": "The Department as a Research Centre provides facility leading to the degree of Doctor of Philosophy in the fields of English Language Teaching (ELT), Indian Writing in English, Postcolonial Literature, Comparative Literature, Gender Studies, Literary Theory and Criticism, Eco-Criticism, Cultural Studies, Diaspora Studies, Translation Studies, and Digital Humanities.",
  "dept-name": "English",
  "hod_name": "Dr.J.Rajini",
  "progoffr": "Ph.D",
  "vision": "To become an excellent centre in terms of teaching and research for enhancing the language and communication skills of students from engineering, technology and management fields and for transforming them into responsible professionals for meeting national and global requirements.",
  "mission": [
      "The department is committed to producing world-class graduates by enhancing their listening, speaking, reading and writing skills along with employability and life skills required for higher education, career enhancement and entrepreneurship using innovative teaching and learning methodologies."
  ],
  "objective": [
    "To train students to master the art of communication, develop their language skills and make them “Industry ready”, employing Outcome Based Education parameters.",
    "To provide students with a curriculum that will help them to develop their language skills."
  ],

  "highlights": {
    "Department has 20 faculty members (Ph.D – 12 and Pursuing Ph.D – 7) and 3 Hindi Teachers.": true,
    "Recognized as a research centre by Anna University, Chennai for Ph.D Full time and Part time.": true,
    "R & D project completed: 1 (worth of Rs. 10.00 Lakhs from ICSSR).": true,
    "The Department of English has organized 5 International conferences, 3 National conferences, 4 FDPs, 41 Workshops, 3 Training programmes and 3 Non-formal courses.": true,
    "Journal Publications by Faculty: International - 145, National - 4, Scopus - 27.": true,
    "English Proficiency and Readers Club is conducting programme for the students of all years to bring out latent and creative talents.": true,
    "IELTS Training is provided for the students who aspire to do their higher studies abroad. KEC is a node centre for IELTS Examination Registration Process.": true,
    "IELTS Club is organizing programmes for the students to create awareness about IELTS & TOEFL Examinations.": true,
    "For I B.E/B.Tech programmers, books (Interchange 2 & 3) by Prof. Jack C. Richards, an internationally renowned ELT expert had been prescribed. These books were used for teaching and accessing language proficiency at B1/B2 levels of the Common European Framework of Reference (CEFR) in 2020 regulations.": true,
    "Career and job oriented activities are imparted in the Communication Skills Laboratory for the II and III year students.": true,
    "The department has been closely associated with the placement cell since 2011 providing training in verbal aptitude and other placement related areas.": true,
    "The faculty have undergone training programme in Infosys, ELCOT, Cognizant, British Council and they in turn, train the students in communication skills, soft skills and personality development.": true,
    "A National Conference was organized on “English Language Teaching and Learning–Industry Institute Perspective” in February 2009.": true,
    "The Department of English conducted the Sixth International Congress on English Grammar (ICEG-2010) from 09.01.2010 - 13.01.2010. Prof. Christian Matthiessen, Hong Kong Polytechnic University was the chief guest.": true,
    "A workshop on Skill Based Training through Technology and Human Interface - An Industry Institute Initiative was conducted on 25.07.2012 & 26.07.2012 for the benefit of English Language teachers.": true,
    "A two day international conference on “Emerging Approaches and Methods in English Language Teaching (EAMELT)” was conducted on 09.12.2015 & 10.12.2015.": true,
    "A one week workshop on Technical Communication, under the National Mission on Education through ICT (MHRD, Govt. of India) was conducted by IIT Bombay at Kongu Engineering College from 30.11.2015 to 05.12.2015.": true,
    "A two day Training-cum-workshop on “Research in ELT & Applied Linguistics” was organized by the Department of English on 04.03.2016 & 05.03.2016.": true,
    "A one day workshop on “Functional Grammar and Grammar Teaching” was held on 26.04.2016.": true,
    "Business English Certificate (BEC) training programme was conducted by the British Council trainers for our faculty on 02.05.2016 & 03.05.2016.An Internal FDP on New Teaching Methods was conducted for members of faculty in various phases from July 2018 to August 2018.": true,
    "A workshop was conducted for B. Arch students on Effective Design Presentation on 07.08.2018 at Kongu School of Architecture.": true,
    "A one day workshop on “English for Career Advancement” was organized on 18.08.2018.": true,
    "A one day workshop on “Employability Skills and Communicative Competence” was conducted on 11.09.2018.": true,
    "A One day national workshop on \"How to Write Effective Research Papers for Conferences and Journals & Project Proposals for Funding Agencies\" conducted on 28.09.2018.": true,
    "Orientation to the members of Department of English on Interchange Level II - Student Book 3 was conducted in the months of January and February 2019.": true,
    "A two day international conference on “Emerging Trends in English language Teaching” was conducted on 08.03.2019 & 09.03.2019.": true,
    "A two day international conference on \"Emerging Trends in English Language Teaching (ICETELT)” was conducted on 08.03.2019 & 09.03.2019. Prof. Jack C. Richards, Honorary Professor, University of Sydney, Australia was the chief resource person.": true,
    "Department of English successfully conducted a demo learning project for I Year B.E. / B.Tech students using New Interactions e-book on McGraw-Hill’s Connect platform from 29.01.2021 to 11.02.2021.": true,
    "A 30-hour non-formal course on \"Civil Service Prelims Examination Coaching Classes\" was conducted from 23.09.2021 to 11.11.2021 in association with the Continuing and Higher Education Cell.": true,
    "A one day international online workshop on “Research Articles – Editing and Proof Reading” was organised on 25.09.2021 by the Department of English in association with IIPC.": true,
    "A two day national online workshop on “Research Writing and Research Methodology in Humanities and Social Science” was organized on 30.10.2021 by the Department of English in association with IIPC.": true,
    "A one day international webinar on “Paradigm Shift in Changing Perspectives on English Language Teaching and Learning” was conducted on 12.11.2021 in association with IIPC.": true,
    "A one day international workshop on “Intricacies of Scopus Publication in ELT, English Literature and Social Science” was organized on 13.10.2021 in association with IIPC.": true,
    "A one day virtual workshop on “How to write Literature Review in Research Methodology” was organized on 25.06.2023 with association with IIPC.": true,
    "A one day National online workshop on “Art of Writing and Publishing Research Papers in Scopus Indexed Journals for Social Sciences” was organized on 02.09.2023 in association with IIPC.": true,
    "A one day National Online workshop on “Professional English- a key to success” was organized on 18.11.2023 with association with IIPC.": true,
    "A one day National Online workshop on “ Mastering the Art of writing Research Thesis in Social Sciences was organized on 24.11.2023 with association with IIPC.": true,
    "A one day National online workshop on “Identifying, Writing and Publishing Research articles in Scopus, SCI & WOS journals” was organized on 16.12.2023 with association with IIPC.": true,
    "A one day online workshop on “Career Guidance – Challenges and Opportunities” was organized on 26.12.2023 with association with IIPC.": true,
    "A one day online workshop on “Streamline your Communication: Tools for Productivity” was organized on 27.12.2023 with association with IIPC.": true,
    "A one day online workshop on “Beyond words: Power of Body Language” was organized on 28.12.2023 with association with IIPC.": true,
    "A one day National online workshop on “Mastering statistical tools in social science research” was organized on 3.2.2024 with association with IIPC.": true,
    "A one day National online workshop on “Art of writing & publishing research papers in Scopus indexed journals for Social Science Research- Version 2” was organized on 23.3.2024 with association with IIPC.": true,
    "A one day National online workshop on “Statistical Tools for Effective Data Analysis in Social Science Research” was organized on 18.5.2024 with association with IIPC.": true,
    "A one day National online workshop on “Art of writing and publishing research papers in Scopus Indexed Journals for Social Science Research” was organized on 17.8.2024 with association with IIPC.": true,
    "A 30-hour non-formal course on \"Verbal Aptitude\" was conducted from 19.08.2024 to 20.09.2024.": true,
    "A Five day National Online Faculty Development programme on “Reimagining English Literature and Language Teaching with Artificial Intelligence: Preparing for the Future was conducted from 2.9.24 to 6.9.24.": true,
    "A one day National online workshop on “Research writing: Social Science Realm” was organized on 26.10.2024 with association with IIPC.": true,
    "A one day National online workshop on “English in Business: Speaking your way to success” was organized on 29.10.2024 with association with IIPC.": true,
    "A one day National online workshop on “Mastering the Art of Writing Research thesis in Social Science” was organized on 30.11.2024 with association with IIPC.": true
  }  ,


    "labs": [
      {
        "topic": "English Laboratory",
        "detail": [
            "The department has a CALL lab with 66 computers and three Audio—Visual Labs which provide state-of-the-art facilities for students to hone their language and soft skills through activity based learning.",
            "* Software / Learning Materials available:",
            "- ORELL Talk Corporate Laboratory software",
            "- Internally developed Digital Learning and Testing materials",
            "- Three audio visual laboratories for activity based learning equipped with three projectors, SONY home theatres and voice recorders."
        ],
        "image": "/assets/images/Laboratories/English/englab4.jpg"
      }
    ],
    
    "library": {
      "name": "English Department Library",
      "description": "The department has a library which has Journals, audio video CDs and cassettes, software packages for English language teaching and learning. In addition to this, there are also a large number of grammar books, dictionaries and reference books on general knowledge."
    },
    "rnd": {
      "academic": "https://rnd.kongu.edu/academic/english.php",
      "activities":"https://rnd.kongu.edu/activities/snh/index.php"
    },    
  "dept_images": [
      "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
  ]
}