{
  "image": "../../../assets/images/Department Banner/foodtech.jpg",
  "about": "Food Technology is a branch of engineering that focuses on the processing, preservation, and quality enhancement of food products to ensure safety, nutrition, and sustainability. It integrates principles of microbiology, chemistry, biotechnology, and engineering to develop innovative techniques for food production, packaging, and distribution. Food technologists work on advanced technologies such as food fortification, smart packaging, automation, and sustainable food processing to improve shelf life, taste, and nutritional value. With the growing demand for safe, healthy, and eco-friendly food solutions, the field continues to evolve, addressing challenges like food security, waste reduction, and alternative protein sources. As the global food industry advances, Food Technology plays a vital role in enhancing food quality, safety, and sustainability for a healthier future.",
  "dept-name": "Food Technology",
  "hod_name": "Dr.R.Baskar (w.e.f 1.8.2022)",
  "intake": 60,
  "me": 18,
  
  "vision": "To be a centre of excellence for development and dissemination of knowledge in the field of Food Technology for the nation and beyond.",
  "mission": [
      "Develop vibrant, competent and ethical food engineers who can promote technical advancements in the field of Food Technology.",
      "Foster the research activities of faculty and students to explore the state-of-the-art techniques to meet the industrial and societal needs.",
      "Endeavour for constant upgradation of technical expertise to support continuous learning."
  ],
  "objective": "To equip students with the necessary technical and managerial skills.",
  "peo": [
      "PEO1 - Apply principles of basic sciences, and engineering to succeed in their professional career.",
      "PEO2 - Analyze, design and develop food processes/products that are technically feasible, economically viable and socially relevant.",
      "PEO3 - Exhibit professional and ethical codes of conduct and an aptitude for continuous learning for catering to the ever changing needs of the society."
  ],
  "po": [
    "Engineering Knowledge: To apply knowledge of mathematics, natural science, computing, engineering fundamentals and an engineering specialization as specified in WK1 to WK4 respectively to develop to the solution of complex engineering problems.",
    "Problem Analysis: To identify, formulate, review research literature and analyze complex engineering problems reaching substantiated conclusions with consideration for sustainable development. (WK1 to WK4).",
    "Design/Development of Solutions: To design creative solutions for complex engineering problems and design/develop systems/components/processes to meet identified needs with consideration for public health and safety, whole-life cost, net zero carbon, culture, society, and environment as required. (WK5)",
    "Conduct Investigations of Complex Problems: To conduct investigations of complex engineering problems using research-based knowledge including design of experiments, modeling, analysis & interpretation of data to provide valid conclusions. (WK8)",
    "Engineering Tool Usage: To create, select and apply appropriate techniques, resources, and modern engineering & IT tools, including prediction and modeling recognizing their limitations to solve complex engineering problems. (WK2 and WK6)",
    "The Engineer and The World: To analyze and evaluate societal and environmental aspects while solving complex engineering problems for its impact on sustainability with reference to economy, health, safety, legal framework, culture, and environment. (WK1, WK5, and WK7)",
    "Ethics: To apply ethical principles and commit to professional ethics, human values, diversity and inclusion; adhere to national & international laws. (WK9)",
    "Individual and Collaborative Team Work: To function effectively as an individual, and as a member or leader in diverse/multi-disciplinary teams.",
    "Communication: To communicate effectively and inclusively within the engineering community and society at large, such as being able to comprehend and write effective reports and design documentation, make effective presentations considering cultural, language, and learning differences.",
    "Project Management and Finance: To apply knowledge and understanding of engineering management principles and economic decision-making and apply these to one’s own work, as a member and leader in a team, and to manage projects and in multidisciplinary environments.",
    "Life-Long Learning: To recognize the need for, and have the preparation and ability for i)independent and life-long learning ii)adaptability to new and emerging technologies iii) critical thinking in the broadest context of technological change. (WK8)"
  ],
  "pso": [
      "Explore the ideas and methodologies in developing innovative food processing techniques and food products.",
      "Adapt multidisciplinary approach to solve food industry problems and ensure food quality and safety.,"
  ],
  "highlights": {
    "Laboratory & Research Facilities": [
      "Department has high-end instruments/equipment like HPLC, Texture Analyser, Colour Analyser, Water-activity meter, Crude fibre analyser, Spray drier, Infrared & Microwave Drier to provide hands-on experience and support research."
    ],
    "Research Scholars": [
      "20 research scholars have completed their PhD.",
      "12 research scholars are currently pursuing their PhD in the research centre."
    ],
    "Funded Research Projects": [
      "Received Rs. 69 lakh worth of funding from UGC, DST, and AICTE to conduct research.",
      "2 ongoing research projects worth Rs. 117.21 lakh."
    ],
    "Major Research Projects": [
      "TDT-WMT research project on 'Design and development of continuous high-pressure screw reactor for Alkali catalyzed hydrothermal co-liquefaction of plastic wastes with lignocellulosic biomass' funded by DST in 2021."
    ],
    "Funded Events": [
      "Conducted funded seminars, workshops, and conferences sponsored by ICMR, DST, DBT, MoES, NSTEDB, and AICTE worth Rs. 9.55 lakh.",
      "STTP Programme on 'Advances in bio and food products manufacturing and shelf life extension' funded by AICTE in 2019."
    ],
    "Placements": [
      "Consistently maintains good placement in leading food industries like ITC, Parle Agro, Hatsun Agro Pvt Ltd, Cavinkare Pvt Ltd, Milky Mist Dairy Food Pvt. Ltd., Dairy Day."
    ],
    "Industry Collaborations": [
      "Signed MoUs with industries and institutions including SKM Egg Private Limited, Vinu Foods, Angel Starch, Ivory Gull Candy, Milky Mist Dairy Food Pvt. Ltd., and Haddington Wines and Whiskies."
    ],
    "Certifications & Training": [
      "Department holds the esteemed status of being an FSSAI Empanelled Training Partner in the southern region with an approved trainer.",
      "Conducted 6 FosTac trainings for industries as well as students."
    ],
    "Entrepreneurship & Innovation": [
      "Agri Summit 2017 was conducted in coordination with TIE.",
      "Conducted 36-day Technological Entrepreneurship training programs (TEDP) twice during 2018 and 2019 funded by NSTEDB."
    ],
    "Consultancy Services": [
      "Offering testing and consultancy services in areas such as New Product Development, Shelf-life studies, Implementation of Quality Assurance, Process Know-hows, Quality & Safety training, and Water Analysis."
    ],
    "Student Achievements": [
      "Students received numerous prizes and awards for poster, paper, and project presentations at reputed institutions and professional bodies across India like IIT, NIT, TNAU, and AFSTI."
    ]
  },  

    "milestones": [
        {
            "year": 2023,
            "event": "Reaccredited by NBA for 6 years."
          },
      {
        "year": 2022,
        "event": [
            "AICTE MODROBS fund sanctioned.",
            "Establishment of Computing Lab."
        ]
      },
      {
        "year": 2021,
        "event": "DST TDT-WMT funded project sanctioned."
      },
      {
        "year": 2020,
        "event": [
            "Reaccredited by NBA.",
            "AICTE RPS funded project sanctionedb."
        ]
      },
      {
        "year": 2017,
        "event": "First time Accredited by NBA."
      },
      {
        "year": 2016,
        "event": "DST-TSD Research Project Completed."
      },
      {
        "year": 2013,
        "event": "M.tech (Food Technology) Programme started."
      },
      {
        "year": 2012,
        "event": "DST-MOFPI research project sanctioned."
      },
      {
        "year": 2011,
        "events": [
          "Research Centre for Pursuing PhD approved by Anna University.",
          "UGC Major Research project Sanctioned."
        ]
      },
      {
        "year": 2010,
        "event": [
            "ZELOS- Annual Technical Symposium Started.",
            " First batch Graduated in Food Technology."
          ]
      },
      {
        "year": 2009,
        "event": "Food Technology Student Association Started."
      },
      {
        "year": 2008,
        "event": "Innaguration of new building for Food technology Department."
      },
      {
        "year": 2006,
        "event": "B.Tech (Food Technology) Programme started."
      }
    ],

    "labs": [
      {
        "topic": "Microbiology Laboratory",
        "detail": "It is necessary for Food Technologist to familiarize with diversity of microorganisms and their similarities and differences to one another. Students will practice various methodologies to isolate, culture, observe and identify microorganisms and to become familiar with procedures utilized for specimen collection and the necessary precautions for preservation of food.",
        "image": "/assets/images/Laboratories/Foodtech/microbiology.jpg"
      },
      {
        "topic": "Biochemistry Laboratory",
        "detail": "The study of Biochemistry is an important component in the Food Technology curriculum. Food Technologist needs to have an in-depth knowledge about the biomolecules. Emphasis will be placed on the isolation, identification, and analysis of carbohydrates, proteins and lipids from various sources.",
        "image": "/assets/images/Laboratories/Foodtech/biochemistry.jpg"
      },
      {
        "topic": "Dairy Engineering laboratory",
        "detail": "Dairy Engineering laboratory aims to provide necessary technical input in the areas of milk preservation, product/ process awareness and improvement, technologies for development of Indian dairy products, product quality assessment and design and development of dairy equipment.",
        "image": "/assets/images/Laboratories/Foodtech/dairy.jpg"
      },
      {
        "topic": "Food Processing Engineering Laboratory",
        "detail": "This lab is equiped with design and unit operation systems for processing of biological materials to develop products for the food industries and prepare for future challenges and opportunities in the area of food sector.",
        "image": "/assets/images/Laboratories/Foodtech/foodprocessing.jpg"
      },
      {
        "topic": "Fruit And Vegetable Processing Laboratory",
        "detail": "The main objective of lab is to provide a basic knowledge on extraction, pulping, dehydration and prepare value added fruits and vegetable based products. The lab is equipped with freeze dryer, vacuum oven and vacuum packaging machines which enhance the research practices.",
        "image": "/assets/images/Laboratories/Foodtech/fruitandvegitable.jpg"
      },
      {
        "topic": " Food Packaging Laboratory ",
        "detail": "The Food Packaging Laboratory aims to indentify and use appropriate packaging technologies for retaining the quality of cereal grains, fruits/vegetables, and processed foods, and investigates the methods to evaluate the properties of the packaging materials. It enhances the knowledge of students about various packaging materials, tests used to identify and evaluate these packaging materials.",
        "image": "/assets/images/Laboratories/Foodtech/packaging.jpg"
      },
      {
        "topic": "Food Analysis and Quality control Laboratory",
        "detail": "The main objective of the Food Analysis and Quality control Laboratory is to conduct analysis of different agricultural commodity, food products and contaminants. The analysis is conducted to ensure the safety and quality of the different food materials using sophisticated analytical equipments like HPLC, Double beam UV- visible Spectrophotometer etc.",
        "image": "/assets/images/Laboratories/Foodtech/quality.jpg"
      },
      {
        "topic": "Baking and Confectionery Laboratory",
        "detail": "The main objective of the baking and confectionery laboratory is to provide the basic principles involved in diverse mechanisms of processing, preservation and quality control techniques in bakery and confectionery products. This lab is equipped with dough mixer, dough sheeter, electrical oven etc.",
        "image": "/assets/images/Laboratories/Foodtech/baking.jpg"
      },
      {
        "topic": "Research Laboratory",
        "detail": "Research lab is established with a wide range of specialized equipments Funded by agencies like UGC, MOFPI and MODROBS satisfying the specific needs in Food Technology research field.",
        "image": "/assets/images/Laboratories/Foodtech/research_lab.jpg"
      },
      {
        "topic": "Project Laboratory",
        "detail": "A hub of creativity, innovation, and hands-on learning! Our state-of-the-art facility showcases a remarkable collection of student-fabricated equipment and prototypes, demonstrating engineering excellence and technological advancements.",
        "image": "/assets/images/Laboratories/Foodtech/projectlab.jpg"
      }
    ],
    
    "library": {
      "name": "Food Technology Department Library",
      "description": "The Food technology department has a separate department library to cater to the specific needs of the Food Technology students. The following is the consolidated data related to the department library.",
      "details": {
        "total_area": "31.07 sq.m",
        "number_of_volumes": "128",
        "number_of_titles": "124",
        "number_of_journals": "9",
        "number_of_jmagazines": "3",
        "working_hours": "8:40 AM to 4.30 PM"
      }
    },
    "rnd": {
      "academic": "https://rnd.kongu.edu/academic/ft.php",
      "activities":"https://rnd.kongu.edu/activities/ft/index.php"
    },    
  "dept_images": [
      "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
  ]
}