{
  "image": "https://img.freepik.com/free-photo/person-using-ar-technology-their-daily-occupation_23-2151137517.jpg?t=st=1742316233~exp=1742319833~hmac=0445d7af0510bf642933e543fa19a030a8de1172c6bf050f78913509b2c64ce4&w=2000",
  "about": "The Department as a Research Centre provides facility driving to the degree of Doctor of Philosophy in the fields of Functional Analysis, Lattice Theory, Fuzzy delayed differential Equations, Intuitionistic Fuzzy Topology, Fuzzy Linear Programming, Graph Theory, Intuitionistic Fuzzy Optimization, Fuzzy Image Processing, Stochastic Process and Stability Theory and Computational Fluid Dynamics.",
  "dept-name": "Mathematics",
  "hod_name": "Dr.M.Dhavamani",
  "intake": 60,
  "staffs": 50,
  "lab_count": 10,
  "classrooms": 8,
  "workshops": 5,
  "research_centers": 2,
  "patents_filed": 12,
  "industry_mous": 15,
  "vision": "The Department of Mathematics is committed to empowering students to understand and learn the required concepts of Mathematics and apply them effectively in the fields of Engineering and Technology.",
  "mission": [
      "To expand knowledge in Mathematics, establish the department as a research centre and cater to the needs of the student community to become qualified professionals. To create and develop necessary infrastructure and a learning environment using the services of a highly qualified and dedicated team of faculty members."
  ],
  "objective": "To equip students with the necessary technical and managerial skills.",
  "highlights": {
      "Department has 24 highly qualified faculty members (Ph.D – 20 and Pursuing Ph.D - 4).":true,
"Recognized as a research centre by Anna university, Chennai for doing Ph. D in Full time / Part time.":true,
"10 Faculty members are approved by Anna University, Chennai to guide Ph.D scholars.":true,
"30 (internal and external) faculty members were completed Ph.D and 14 (internal and external) faculty members were pursuing their Ph.D in this centre.":true,
"Separate Mathematics Laboratory with numerous mathematical models, Puzzles for the students.":true,
"Journal Publications by Faculty : International – 204, National – 14.":true,
"Books Published : 6" : true,
"R&D project completed : 1 (worth of Rs. 3 Lakhs from UGC)":true,
"Ongoing R&D project: 1 (worth of Rs. 2.54 Lakhs from DRDO)":true,
"35 sponsored and 3 self supporting seminars/ workshops/ STTP/ conference/ RCC/ POP-SCI and FDP’s were organized with a grant of more than Rs.27.26 Lakhs from the government agencies like AICTE, DST, CSIR, DRDO, ICMR, DBT, NCM and IAS.":true,
"Organized  two international conference sponsored by SERB, INSA,TNSCST and CSIR.":true,
"Conducting State Level Symposium through Mathematics club every year.":true,
"Conducting  District Level Quiz Programme for school students at Kongu Matriculation School, Uthukuli every year.":true,
"Computing Facilities : 128 personal computers with LAN, 30 LCD projectors, 16 digital Boards.":true
  },

    "labs": [
      {
        "topic": "Mathematics Laboratory",
        "detail": [
            "Models from different fields of Mathematics like Geometry, Calculus of variations, Graph theory, Integration, Astronomy etc., are exhibited in the Mathematics Laboratory. Formula illustrative models exhibited in our laboratory help the students to understand the concepts in different dimensions. The models for abstract concepts sharpen the analytical thoughts of students and help them to solve brain teasing problems.",
            "Some of the photos of the great mathematicians are kept in the Laboratory to introduce their works among the student community. Different types of puzzle books, files of collection of aptitude questions are available in the laboratory library for the usage of first year B.E/B.Tech students, to prepare for quiz programmes and competitive examinations."
        ],
        "image": "/assets/images/Laboratories/Maths/maths.jpg"
      }
    ],
    
    "library": {
      "name": "Mathematics Department Library",
      "description": "The Mathematics department has a separate department library to cater to the specific needs of the students. The following is the consolidated data related to the department library.",
      "details": {
        "Total No of books": "531",
        "working_hours": "8:40 AM to 4.30 PM"
      }
    },
    "rnd": {
      "academic": "https://rnd.kongu.edu/academic/mathematics.php",
      "activities":"https://rnd.kongu.edu/activities/snh/index.php"
    },    
  "dept_images": [
      "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
  ]
}