{
  "image": "../../../assets/images/Department Banner/mech.jfif",
  "about" : "Mechanical Engineering is one of the broadest and most versatile branches of engineering, focusing on the design, analysis, manufacturing, and maintenance of mechanical systems. It integrates principles of physics, material science, thermodynamics, fluid mechanics, and automation to develop innovative solutions for industries such as automotive, aerospace, energy, robotics, and manufacturing.Mechanical engineers work on various aspects, including machine design, thermal systems, structural analysis, and advanced manufacturing technologies like 3D printing and automation. With the rise of smart manufacturing and Industry 4.0, the field is evolving towards integrating artificial intelligence, IoT, and sustainable energy solutions. As industries move towards greater efficiency and environmental responsibility, mechanical engineering continues to play a crucial role in shaping modern technology and infrastructure.",
  "dept-name": "Mechanical Engineering",
  "hod_name": "Dr.P.Selvakumar",
  "intake": 60,
  "Ph.D": "-",
  "vision": "To be a Centre of excellence for development and dissemination of knowledge in Mechanical Engineering for the nation and beyond.",
  "mission": [
      "Establish itself as an excellent academic center through expert pedagogical methods and modern laboratories to produce world class mechanical engineers.",
      "Disseminate knowledge through seminars, conferences and continuing education programs.",
      "Make tie-ups with industries, research centers and renowned institutions to synergize the benefit.",
      "Contribute towards the upliftment of the society."
  ],
  "objective": "To equip students with the necessary technical and managerial skills.",
  "peo": [
      "Practice Mechanical Engineering in the general stems of design, manufacture, service and allied engineering sectors.",
      "Habituate continuous learning and carry out research and development in science, engineering and technology that supports career growth.",
      "Exhibit ethical code of conduct in a professional manner to solve real – time multi-disciplinary engineering projects.",
      "Demonstrate managerial and leadership capabilities that supports economic development of firms as well as society"
  ],
  "po": [
    "Engineering knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems.",
    "Problem analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences.",
    "Design/development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations.",
    "Conduct investigations of complex problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions.",
    "Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.",
    "The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.",
    "Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.",
    "Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.",
    "Individual and team work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings.",
    "Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions.",
    "Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments.",
    "Life-long learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change."
  ],
  "pso": [
      "Modern tool usage: use the techniques, skills and modern engineering tools necessary for engineering practice.",
      "Domain Knowledge: work professionally in thermal, manufacturing and mechanical systems areas including the design and realization of such systems with the use of computational tools."
  ],
  "highlights": {
    "Research Projects and MODROBS": "36 Research Projects and 3 MODROBS funded by AICTE, DST, SERB, MNRE, UGC, ICMR, TNSCST & IE(I) with Rs.3.08 Crores",
    "Funded Seminars Organized": "30 (Sponsored by AICTE, DST, SERB, CSIR, BRNS, MNRE & UGC)",
    "Faculty Development Programmes (FDPs) Organized": "12 (Sponsored by Anna University, Chennai)",
    "Short Term Training Programmes (STTPs) Organized": "6 (Sponsored by AICTE-ISTE, New Delhi)",
    "Conferences Organized": [
      "International - 5",
      "National - 4"
    ],
    "Faculty with PhD": [
      "Completed - 11",
      "Pursuing - 5"
    ],
    "PhD Scholars": [
      "Completed - 45",
      "Pursuing - 16"
    ],
    "Patents Obtained": 12,
    "Certified Energy Auditor": "Dr. P. Selvakumar (EA34987) - Approved by BEE, Government of India",
    "Centers of Excellence": [
      "FLUKE, USA - Energy Studies",
      "Macbro Technology India Pvt Ltd - Product Design"
    ],
    "Top 2% Scientists Recognition by Elsevier": [
      "Dr. T. P. Sathishkumar - 2022, 2023, 2024 (3 consecutive years)",
      "Dr. R. Rajasekar - 2024"
    ],
    "Post Doctorate Fellowships": [
      "Dr. M. Bhuvaneshkumar - NIT Trichy (2021-2023)"
    ],
    "R&D Funding Received": [
      "SERB TARE - Dr. A. Mohankumar, Dr. A. Santhoshkumar, Dr. A. Tamilvanan",
      "ICMR - Dr. R. Naveenkumar",
      "DST TDT-AMT - Dr. S. M. Senthil"
    ],
    "Solar Radiation Weather Monitoring Station": "Funded by MNRE",
    "Books Published": [
      "Wiley - 1 book",
      "Springer - 1 book"
    ],
    "SEED Grant": "Rs.15.79 lakhs (Received by Faculty)",
    "NIDHI PRAYAS Grant": "Rs.4.5 lakhs (Received by Student for Start-up Creation)",
    "Student Achievements": [
      "1st Prize (Rs.1 Lakh) - AICTE Bicycle Design Challenge 2023",
      "1st Prize - Smart India Hackathon 2023",
      "Spark Fund from TBI@KEC - Received by Students"
    ]
  },

    "milestones": [
        {
            "year": 2024,
            "event": "Research centre recognition for 3 years by AU."
          },
          {
            "year": 2023,
            "event": "Extension of Autonomous status."
          },
      {
        "year": 2022,
        "event": [
            "Reaccredited by NAAC.",
            "Reaccredited for 3 years by NBA (TIER I Format)."
        ]
      },
      {
        "year": 2021,
        "event": "Creation of 2 Centres of Excellence."
      },
      {
        "year": 2018,
        "event": [
            "Reaccredited for 2 years by NBA (TIER I Format).",
            "Best IIPC Department Award."
        ]
      },
      {
        "year": 2016,
        "event": "Accredited by NAAC."
      },
      {
        "year": 2015,
        "event": "Best Department Award."
      },
      {
        "year": 2014,
        "event": "Reaccredited for 2 years by NBA (TIER I Format)."
      },
      {
        "year": 2010,
        "event": "Best Department Award."
      },
      {
        "year": 2008,
        "event": "Reaccredited for 5 years by NBA."
      },
      {
        "year": 2005,
        "event": [
            "Increase in student intake to 120.",
            "Best Department Award."
        ]
      },
      {
        "year": 2003,
        "event": "ME (CAD/CAM) Programme started."
      },
      {
        "year": 2001,
        "event": "Accredited for 5 years by NBA."
      },
      {
        "year": 2000,
        "event": "Recognized research centre for PhD Programme."
      },
      {
        "year": 1996,
        "event": "ME (ED) Programme started."
      },
      {
        "year": 1984,
        "event": "BE(Mech) Programme started with intake of 60."
      }
    ],

    "labs": [
      {
          "topic": "CAD Centre (UG CAD Centre, PG Engineering Design Centre)",
          "detail": [
            "CAD Centre was established during 1996-97. At present, the centre has 80 terminals, networked with three servers.",
            "Latest software in the CAD area have been purchased and continuously upgraded.",
            "The centre is kept open for students up to 9 PM to facilitate learning and research.",
            "The Management has granted the entire funds for establishing the CAD Laboratory."
          ],
          "image": "/assets/images/Laboratories/Mech/cadcentre.jpg",
          "table": [
            {
              "s_no": 1,
              "name": "Altair Hypermesh",
              "version": "2024",
              "users": 30
            },
            {
              "s_no": 2,
              "name": "CREO",
              "version": "11.0",
              "users": 50
            },
            {
              "s_no": 3,
              "name": "ANSYS",
              "version": "2025 R1",
              "users": 50
            },
            {
              "s_no": 4,
              "name": "MINITAB",
              "version": "17",
              "users": 10
            },
            {
              "s_no": 5,
              "name": "ABAQUS",
              "version": "V6.12",
              "users": 40
            },
            {
              "s_no": 6,
              "name": "CATIA",
              "version": "V5-6R2015",
              "users": 30
            },
            {
              "s_no": 7,
              "name": "ANSYS",
              "version": "14.0",
              "users": 50
            },
            {
              "s_no": 8,
              "name": "AUTO CAD",
              "version": "R2010",
              "users": 30
            },
            {
              "s_no": 9,
              "name": "NX NASTRAN",
              "version": "V5",
              "users": 5
            },
            {
              "s_no": 10,
              "name": "PRO/ENGINEER",
              "version": "Wildfire 4.0",
              "users": 400
            },
            {
              "s_no": 11,
              "name": "NX (IDEAS & UNIGRAPHICS)",
              "version": "NX4",
              "users": 10
            },
            {
              "s_no": 12,
              "name": "SOLIDWORKS",
              "version": "2022-23",
              "users": 500
            },
            {
              "s_no": 13,
              "name": "MATLAB",
              "version": "R2024b",
              "users": "Campus wide suite"
            }
          ]
        },      
      {
        "topic": " Thermal Engineering Related Laboratory",
        "detail": ["The Thermal Engineering Laboratory is well-equipped with various internal combustion (IC) engines, including high-speed and low-speed diesel and petrol engines with mechanical, electrical, hydraulic, and eddy current loading systems. It also features an air compressor, flash point, fire point testing apparatus, Saybolt and Redwood viscometers, and cut-section models of two- and four-stroke engines. Additionally, the laboratory boasts state-of-the-art facilities such as advanced research dual-fuel CRDI engine integrated with combustion analyzers, along with an AVL 444 exhaust emission analyzer and an AVL 437 smoke meter."],
        "image": "/assets/images/Laboratories/Mech/thermaleng.jpg"
      },
      {
        "topic": "Steam Laboratory",
        "detail": ["The Steam Laboratory is equipped with Revomax (Thermal) boiler, turbine Test rig (1KW) 4TR cooling Tower. This ensures to perform load & efficiency tests. Varieties of boiler models are kept available with details for students."],
        "image": "/assets/images/Laboratories/Mech/steamlab.jpg"
      },
      {
        "topic": "Refrigeration and Air conditioning Laboratory",
        "detail": ["Refrigeration and Air conditioning laboratory is equipped with Computerised Refrigeration test rig, Computerised Air Conditioning test rig, LPG Refrigeration test rig and Hybrid Refrigeration test rig."],
        "image": "/assets/images/Laboratories/Mech/refridge.png"
      },
      {
        "topic": "Instrumentation and Metrology Laboratory",
        "detail": ["Instrumentation and Metrology Laboratory exposes the students to instruments, which form part of the modern measuring techniques for industry. Surface roughness tester is other key equipment in the lab. Many students are using that to find the surface topology for their finished products. Co-ordinate Measuring Machine (CMM) has been established in the year 2007 to enhance the research facility in the field of metrology. CMM is a device for measuring the physical geometrical characteristics of an object. Profile projector is used to find the measurements of micro components."],
        "image": "/assets/images/Laboratories/Mech/imlab.jpg"
      },
      {
        "topic": "Dynamics Laboratory",
        "detail": [
            "The dynamics Laboratory is equipped with modern equipments such as universal tensile testing machine (UTM – Electronic Tensometer), Creep load analysis machine, all rotary, static and dynamics vibration analysis equipments. The vibration setup is equipped with vibration Exciter, vibration pickup, accelerometer pickup, power amplifier, function generator and vibrations meters along with charge to voltage converter to read frequency, displacement and acceleration. The laboratory is also equipped with dynamic balancing machine for the rotating masses, journal bearing apparatus, static&dynamic balancing apparatus, determine the natural and actual frequency of various spring using spring mass apparatus, characterization of worm gear box using speed reducer, measurement of frequency (Damped and Undamped, Free and Forced), determination of moment of Inertia of connecting rod and fly wheel by Oscillation method, the frequency of rotor with shaft using single and two rotor system, determine the deflection and frequency of simple support beam setup and determine the critical speed of the shaft using whirling speed apparatus.",
            "The laboratory is also equipped with Vibration Analyzer, Impulse Hammer, Velocity Transducer, Vibration Table/Shaker Table-Vibration Exciter, Function Generator, Accelerometer Pick up, NI – DAQ, Integrated Electronic Piezo-electric (IEPE) andNon-IEPE sensors, Miniature Tri-axial Accelerometer, General purpose array microphone with BNC Connector and Thermocouple J type."
        ],
        "image": "/assets/images/Laboratories/Mech/dvlab.jpg"
      },
      {
        "topic": "Workshop Complex",
        "detail": ["The Central Work shop complex with 1,000 Sq.m area has Fitting, Carpentry, Welding, Smithy, Sheet Metal and machining sections apart from Fabrication Section, wherein all in-house fabrications are made. Separate Foundry process and smithy sections enable the students to get 'hands on' experience about Foundry Process and different forging methods. The workshop facilities and experiments promote parallel growth in theoretical and practical skills."],
        "image": "/assets/images/Laboratories/Mech/centralworkshop.jpg"
      },
      {
        "topic": "Lathe Section",
        "detail": ["The Lathe Shop has several KIRLOSHAR, HMT, PSG and MMM Lathes. The Lathe Lab is a well-equipped facility that provides hands-on training in machining operations such as step turning, eccentric turning, external - internal threading cutting, knurling and taper cutting. Students gain practical experience in operating various lathes, learning precision machining techniques essential for manufacturing and engineering applications. The lab fosters skill development in metalworking and enhances students' understanding of machine tool operations, ensuring they meet industry standards."],
        "image": "/assets/images/Laboratories/Mech/lathe.jpg"
      },
      {
        "topic": "Special Machines Laboratory",
        "detail": ["The Special Machines Lab is equipped with advanced machinery, including Gear Hobbing, Cylindrical and Surface Grinding Machines, along with conventional Milling, Drilling, Planning, Shaping, Slotting, Capstan Lathe, and Tool & Cutter Grinder Machines. This facility provides students with hands-on training in precision machining, gear cutting and grinding operations, enhancing their skills in advanced manufacturing techniques."],
        "image": "/assets/images/Laboratories/Mech/special_machine.jpg"
      },
      {
        "topic": "Metallurgy Laboratory",
        "detail": ["The metallurgy laboratory is fully equipped to cater to the academic requirements of both undergraduate and postgraduate mechanical engineering students. It houses advanced instruments essential for microscopic analysis and hardness testing. The Sorby Metallurgy Laboratory conducts material inspections through macro and micro examinations, along with testing. Hardness tests are performed to evaluate specimen hardness, using standard reference specimens of various metals for comparison, which helps in understanding their properties. High-quality emery papers with different grits are used to achieve polished surfaces, and a range of etchants are applied for surface cleaning."],
        "image": "/assets/images/Laboratories/Mech/metallurgy_lab.jpg"
      },
      {
        "topic": "Heat Transfer Laboratory",
        "detail": ["Heat transfer laboratory have conduction, convection and radiation equipments, refrigerators and air conditioners and emissivity measurement instruments. Computerised air-conditioning system and computerised refrigeration system sponsored by AICTE MODROBS is available. The heat transfer laboratory has energy auditing equipments like flue gas analyser, moisture meter, hotwire anemometer,pH meter and Thermal Imager to conduct energy audit in various industries."],
        "image": "/assets/images/Laboratories/Mech/heat_transfer.jpg"
      },
      {
        "topic": " Renewable Energy Laboratory",
        "detail": [
          "The Renewable Energy Laboratory offers practical exposure to key renewable energy systems. It is equipped with a Solar Photovoltaic Training System, Solar Thermal Training System, Solar Concentrator Training System, and Wind Energy Training System, enabling students to explore solar power, energy conservation, and wind turbine technology. The lab provides hands-on experience that helps students apply theoretical knowledge in energy conversion, system design, and optimization, preparing them to contribute to sustainable energy solutions."
        ],
        "image": "/assets/images/Laboratories/Mech/renewable_energy.jpg"
      },
      {
        "topic": "Materials Research Laboratory ",
        "detail": [
          "The Materials Research laboratory is equipped with compression moulding machine, Impact testing machine, universal testing machine, creep testing machine, spin coater, micro-Vickers hardness tester, inverted metallurgical microscope, auto polishing machine, abrasive cutting machine, specimen mounting machine, ultra-sonicator, muffle furnace and mechanical hydraulic press for research activities."
        ],
        "image": "/assets/images/Laboratories/Mech/research.png"
      },
      {
        "topic": "Project Laboratory",
        "detail": [
          "The Project Lab is a dedicated space for students to design and develop innovative projects. Equipped with essential tools such as a Portable Welding Machine, Portable Drilling Machine, Dremel 3-in-1 Workstation, Universal Wrenches, Spanner Sets, Metal Cutters and various power tools, the lab facilitates hands-on learning and prototype development. It provides an ideal environment for students to apply their technical knowledge and enhance their practical skills."
        ],
        "image": "/assets/images/Laboratories/Mech/project.png"
      },
      {
        "topic": "Product Design and Development Laboratory",
        "detail": [
          "Product Design and Development Laboratory provides students with hands-on experience in additive manufacturing technology. It allows them to design and create three-dimensional objects by layering thermoplastic materials. The lab offers an opportunity to understand the mechanics of 3D printing and its applications in engineering, art, and product design. Students can experiment with various materials, such as PLA / ABS etc., to build prototypes or models. It’s a valuable space for learning about innovation, prototyping, and the practical implementation of design concepts.",
          "* Hardware/Equipements",
          "- Fabex Pro 3D Printer – 03 Nos.",
          "- Fabex XL 3D Printer – 02 Nos.",
          "* Software",
          "- Prusa Slicer"

        ],
        "image": "/assets/images/Laboratories/Mech/Product_Design.png"
      }
    ],
    
    "library": {
      "name": "Mechanical Engineering Department Library",
      "description": "The Mechanical Engineering department has a separate department library to cater to the specific needs of the Mechanical Engineering students. The following is the consolidated data related to the department library.",
      "details": {
        "total_area": "10x7.9 sq.m",
        "number_of_titles": "689",
        "number_of_international_journals/magazines_subscribed": "ASME -25, ELSVIER-275",
        "number_of_national_journals/magazines_subscribed": "10",
        "number_of_newspapers_subscribed": "3",
        "project_report": "All the BE and ME degree project work reports since 2014",
        "others": "Copy of laboratory manuals, special materials / articles prepared by faculty",
        "audio/Video_Cassettes": "6",
        "television/Video_cassette_player(TV & VCR)": "1",
        "photocopy": "Photocopying facility is available for the benefit of staff and students"
      }
    },

      "patents": {
        "details": [
          {
            "title": "Foldable Shoe",
            "students_involved": [
              "Dr.P.Sathiamurthi",
              "Mr.Pattabiraman",
              "Mr.Balamurugan"
            ],
            "faculty": "",
            "status": "229355"
          },
          {
            "title": "Smart Fish Tank",
            "students_involved": [
              "Mr.A.Somasundaram",
              "Mr.Sekar Srikaanth",
              "Mr.Gunasekaran",
              "Mr.Vijayasekaran",
              "Mr.Nedunchelian Akilan",
              "Mr.Sakthivel Ganapathy"
            ],
            "faculty": "",
            "status": "210082"
          },
          {
            "title": "Mecha-Duster",
            "students_involved": [
              "Mr.P.Thangavel",
              "Mr.Easwaramoothy Meyyappan",
              "Mr.Selvaraj Gobinath",
              "Mr.Chennakrishnan Jegatheesh"
            ],
            "faculty": "",
            "status": "219747"
          },
          {
            "title": "Multi Harvester and Land Preparator",
            "students_involved": ["Dr. T. P. Sathishkumar"],
            "faculty": "",
            "status": "376133"
          },
          {
            "title": "Multi-Functional Device",
            "students_involved": [
              "Kongu Engineering College",
              "Dr.Dinesh Kumar Karupannasamy",
              "Madhavan P"
            ],
            "faculty": "",
            "status": "121803"
          },
          {
            "title": "Detachable Multi-Storage Container",
            "students_involved": [
              "Kongu Engineering College",
              "Dr.C.Baskar",
              "Mr.N.Prasanna",
              "S.Venkatachalam",
              "N.Anitha",
              "Dr.A.Santhosh Kumar"
            ],
            "faculty": "",
            "status": "365824-001"
          },
          {
            "title": "Mechanical Cardiopulmonary Resuscitation Device And Method Of Providing Optimum Depth And Compression Thereof",
            "students_involved": [
              "Mr.A.Ragavendran",
              "Dr.R. Rajasekar",
              "Mr.A.T.Praveen",
              "Dr.C.Moganapriya"
            ],
            "faculty": "",
            "status": "202341039257"
          },
          {
            "title": "An Electronics Machine for Vibration Measurement",
            "students_involved": ["Dr.V.Hariharan"],
            "faculty": "",
            "status": "396612-001"
          },
          {
            "title": "Solar Garbage Tricycle",
            "students_involved": [
              "Mr.Naresh S",
              "Mr.Devapraksh S",
              "Mr.Santhosh C",
              "Mr.Nagalingeshwaran S",
              "Dr.Selvakumar P",
              "Mr.Mohamed Azeem",
              "Mr.Ajay E"
            ],
            "faculty": "",
            "status": "427222-001"
          },
          {
            "title": "Dabbawala Cycle",
            "students_involved": [
              "Dilip Vijay Ram A",
              "Jayastephen S",
              "Sudarsan K",
              "Mr.Mohammed Hisham F",
              "Rinshadul Nisham S"
            ],
            "faculty": "",
            "status": "395797-001"
          }
        ]
      },
        "patent_journals": {
        "details":[
          {
            "title": "Trio Bowling Machine",
            "students_involved": [
              "Mr. S.Satheeshkumar",
              "Mr.S.Velsaravanan",
              "Mr.K.Akilan",
              "Mr.S.Prabhukumar",
              "Mr.S.Ramesh"
            ],
            "faculty": "Dr.V.Hariharan",
            "status": "11681"
          },
          {
            "title": "Multiphase Kids Carrier",
            "students_involved": [
              "Mr.M.Rajan",
              "Mr.S.Janakiraman",
              "Mr.R.Boopathi",
              "Mr.M.Rajesh",
              "Mr.J.Dhanavel",
              "Mr.M.Vijayan"
            ],
            "faculty": "Dr.V.Hariharan",
            "status": "27924"
          },
          {
            "title": "Agro Rope Car",
            "students_involved": [
              "Mr.N.Tiruvenkadam",
              "Mr.P.Mohankumar"
            ],
            "faculty": "Dr.V.Hariharan",
            "status": "29150"
          },
          {
            "title": "Paddy Shuffler",
            "students_involved": [
              "Mr.B.Selvin Jose",
              "Mr.K.Suresh",
              "Mr.R.Ragupathiraja",
              "Mr.K.Ramachandran"
            ],
            "faculty": "Dr.P.Selvakumar",
            "status": "81/CHE/2009"
          }
        ]

    },    
    "testing":{
      "category": "Testing",
      "description": "The Testing and consultancy facilities available in the department are ",
      "fields": [
        "IC Engine computerized test rig with Eddy current dynamometer",
        "Exhaust gas analyzer",
        "Flue gas analyzer",
        "Thermal Imager",
        "Hot wire anemometer",
        "Indoor air quality meter",
        "Grain moisture and pH meter",
        "Vibration Analyzer",
        "Electronic Tensometer",
        "Coordinate Measuring Machine",
        "Force plate",
        "Ultra Sonicator",
        "Surface roughness tester",
        "Solar PV testing kit",
        "Solar thermal testing kit",
        "Wind electric demo kit",
        "Solar parabolic tough collector testing kit",
        "Computerized Air Conditioning test rig",
        "Computerized Refrigeration test rig",
        "Inverted metallurgical microscope",
        "Hydraulic press",
        "Micro vickers hardness tester",
        "Muffle furnace",
        "Auto polishing machine",
        "Abrasive cutting machine",
        "Hydraulic mounting machine",
        "Acoustic imager",
        "Work station",
        "3D printer"
      ]
     
    },
    
    "rnd": {
      "academic": "https://rnd.kongu.edu/academic/mech.php",
      "activities":"https://rnd.kongu.edu/activities/mech/index.php"
    },    
  "dept_images": [
      "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
  ]
}