{
  "image": "../../../assets/images/Department Banner/mts.jpg",
  "about": "Mechatronics Engineering is an interdisciplinary field that combines mechanical, electrical, electronics, and computer engineering to design and develop intelligent systems and automation solutions. It focuses on creating smart machines, robotics, and advanced control systems that enhance efficiency and precision in various industries. Mechatronics engineers work on automation, robotics, embedded systems, sensors, and artificial intelligence to develop cutting-edge technologies used in manufacturing, healthcare, automotive, and aerospace sectors. With the increasing integration of IoT and AI-driven automation, Mechatronics Engineering plays a crucial role in modern industry, driving innovation in smart systems, autonomous machines, and intelligent manufacturing processes.",
  "dept-name": "Mechatronics Engineering",
  "hod_name": "Dr.B.Meenakshipriya",
  "intake": 120,
  "Ph.D": "-",
  
  "vision": "To be a centre of excellence for development and dissemination of knowledge in Mechatronics Engineering for the Nation and beyond.",
  "mission": [
      "Disseminate knowledge through effective teaching-learning process to develop technically competent and ethically strong Mechatronics professionals.",
      "Foster continuous interdisciplinary learning and research to meet real-world challenges by nurturing innovation through state-of-the-art facilities.",
      "Promote societal based consultancy and training services in collaboration with Industries and R&D organizations."
  ],
  "objective": "To equip students with the necessary technical and managerial skills.",
  "peo": [
      "Utilize the fundamental knowledge of basic sciences and engineering to succeed in their profession.",
      "Design and develop Mechatronics products and processes for real world applications.",
      "Exhibit professional and managerial capabilities with ethical conduct and have an aptitude for continuous learning."
  ],
  "po": [
    "Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems.",
    "Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences.",
    "Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations.",
    "Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions.",
    "Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.",
    "Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.",
    "Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.",
    "Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.",
    "Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings.",
    "Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions.",
    "Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments.",
    "Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change."
  ],
  "pso": [
      "Design and develop Mechatronic systems by synergistic combination of mechanical engineering, electronic controls and systems.",
      "Adapt multidisciplinary approach to solve real world industrial problems."
  ],
  
    "highlights": {
      "Total built-up area": "66213 sq.ft.",
      "Best Department Award": [
        "2006-07", "2011-12", "2015-16", "2019-20", "2020-21", "2021-22"
      ],
      "Best performing Department in Industry-Linked Activities Award": "2016-17",
      "Best performing Department in Research and Development Activities": "2022-23",
      "Research Centre": [
        "Approved Supervisors: 15 ",
        "Scholars Pursuing PhD : 31",
        "Scholars Completed PhD: 32 "
      ],
      "Conferences organized": [
        "National : 8 ",
        "International : 5"
      ],
      "R&D projects sanctioned": "45 (worth Rs. 353.69 Lakhs from AICTE, UGC, DST, IEI, CSIR, ICMR, TNSCST, SERB-TARE, and EDII)",
      "Sponsored Seminars / Workshops / FDP organized": "51 (funded by AICTE, DRDO, TNSCST, MNRE, DIT, IIT, DST, DST-SERB, CSIR, DBT, and MoEF)",
      "Publications by faculty": [
        "Journals: 458 ",
        "Conferences: 559 "
      ],
      "Consultancy / training activities carried out": 146,
      "Consistent improvement in Placement and Internship": true,
      "Sponsored student’s projects": "20 (funded by IEI and TNSCST)",
      "MoU": [
        "MooG Controls", "ROOTS", "Sakthi Auto Component", "V-Guard", "Fanuc",
        "System Controls", "ARKtech", "Enthu Technology Solutions", "Milky Mist",
        "Siemens Centre of Excellence with NIT Trichy"
      ],
      "State of art laboratory facilities": true,
      "Papers presented by students": "2860 and won 599 prizes, 368 prizes from IITs, NITs & other premier institutions"
     
    },  
    "milestones": [
      {
        "year": 2023,
        "event": "Received Best performing department in Research award."
      },
      {
        "year": 2022,
        "event": [
            "Received Best Department Award.",
            "Established Centre of Excellence (Robotics and Automation).",
            "Established Certified FANUC Training Centre.",
            "Established MOOG Supported Control Engineering Laboratory."
        ]
      },
      {
        "year": 2021,
        "event": "Established The Robotic Society (Professional Society)."
      },
      {
        "year": 2020,
        "event": "Reaccredited by NBA for three years."
      },
      {
        "year": 2017,
        "event": "Received Best performing Department in industry linked activities award."
      },
      {
        "year": 2016,
        "events": [
          "Established IEEE Robotics and Automation Chapter.",
          "Received Best Department award."
        ]
      },
      {
        "year": 2015,
        "event": " Certified NI LabVIEW Academy School."
      },
      {
        "year": 2014,
        "events": [
          "Established KEC student’s productivity forum in association with Coimbatore Productivity Council.",
          "Established e-Yantra laboratory in association with IIT-Bombay."
        ]
      },
      {
        "year": 2012,
        "event": "Received Best Department award."
      },
      {
        "year": 2010,
        "event": "Established Robotics club."
      },
      {
        "year": 2009,
        "event": [
          "Reaccredited by NBA for five years.",
          "Recognized research centre for Ph.D. programme under Anna University.",
          "Increase in UG intake to 120."
        ]
      },
      {
        "year": 2007,
        "event": "Received Best Department Award."
      },
      {
        "year": 2006,
        "event":[
          "Increase in UG intake to 60.",
          "Accredited by NBA for three years."
        ]
      },
      {
        "year": 2004,
        "event": "M.E. Mechatronics Engineering with an intake of 18."
      },
      {
        "year": 1999,
        "event": "B.E.Mechatronics Engineering with an intake of 40."
      }
    ],

    "labs": [
      {
        "topic": "Centre of Excellence (Robotics and Automation)",
        "detail": [
          "Centre of Excellence in Robotics and Automation (COE-R&A) is a cutting-edge state of art platform to learn, build, explore and realize Robot technologies.",
          "COE-R&A holds Fanuc ER-4iA Robot, Fanuc CNC Simulator, ABB IRB 1410 Robot, Humanoid Robot: NAO 6th Gen, Dobot Magician Kit with Accessories, QBot 2e and various software tools to equip the users.",
          "It enables the user to experience the Robotic and Automation world to meet the growing demands for trained engineers in the industrial automation.",
          "It also offers multifold benefits for promoting research, participation in national and international competitions, availing grants and tailor-made as expected by users.",
          "* HARDWAREs/EQUIPMENTS:",
          "- Aristo Robot (MTAB)",
          "- Lab VIEW Robotics SbRIO Starter Kit",
          "- 6 Axis Industrial Robot Arm (ABB IRB 1410)",
          "- Firebird E-Yantra Equipment",
          "- High Performance Real Time Camera",
          "- Qbot-2 (Quanser)",
          "- NAO V6 Robot",
          "- Dobot Magician Educational kit",
          "- Fanuc Robot ER-4iA",
          "- Fanuc CNC Simulator (Lathe and Mill)",
          "- PRR Robot Manipulator",
          "* SOFTWARE VERSION:",
          "- Robot Virtual Software (Denford)",
          "- Upgrade, NI Academic site License, Department Fall 2010",
          "- Robot Studio 5.15 School Package",
          "- MATLAB Tool Boxes",
          "- MATLAB coder",
          "- Simulink coder",
          "- Control system toolbox",
          "- Image processing toolbox",
          "- Computer vision system toolbox",
          "- Deep Learning toolbox",
          "- Fanuc CNC system Package –NC guide",
          "- Fanuc CNC system Package –MT link",
          "No of computers: 38"
        ],
        "image": "/assets/images/Laboratories/Mts/coe_robotics_lab.jpg"

      },      
      {
        "topic": "PATRICK J. HANRETTY CAM CENTRE",
        "detail": [
          "Computer Aided Manufacturing (CAM) centre affords space for students to work on diverse aspects of design and manufacturing related activities.",
          "Students have access to advanced tools in Design, Analysis, Simulation and Manufacturing platforms to explore and gain knowledge.",
          "This centre also focuses on providing hands-on experience in the additive manufacturing technique (Fused Deposition Modelling) to realize product development.",
          "* HARDWARE:",
          "- 3D Printer – Cube Pro Trio",
          "* SOFTWARE:",
          "- SOLIDWORKS 2022-23",
          "- SOLIDWORKS 2019 - 3D CAD Premium Research Edition",
          "- Creo 6.0",
          "- ANSYS 19.0",
          "- AutoCAD 2019",
          "- Pro/Engineer wildfire 4.0",
          "- Minitab 17",
          "- Mastercam X5 and X9 (Add on Multi-Axis)",
          "- Mastercam X9",
          "No of computers: 40"
        ],
        "image": "/assets/images/Laboratories/Mts/patrick_lab.jpg"

      },
      {
        "topic": "THOMAS ALVA EDISON INDUSTRIAL AUTOMATION CONTROLLER LABORATORY",
        "detail": [
          "This laboratory focuses on providing hands-on experience on Relay logic controllers, microcontroller programming, PLC programming, HMI, and SCADA.",
          "* HARDWARE:",
          "- Workstation with discrete and analog I/O’s for temperature, flow, and speed control",
          "- BOLT IoT module",
          "- Siemens PLC’s, HMIs, and Servo Drive Interface module",
          "- Beckhoff soft PLC’s with interfacing I/O’s modules",
          "- Workstations with I/O’s & interfacing terminals",
          "- 2-Axis servo system with HMI interface",
          "* SOFTWARE:",
          "- Rockwell Software Bundles",
          "- Rs logix 500",
          "- Rs Emulate 500",
          "- Rs linx classic",
          "- Factory Talk View Studio",
          "- TWIN CAT 3.0",
          "- SIEMENS Softwares: TIA PORTAL V15, TIA PORTAL V16",
          "No of computers: 40"
        ],
        "image": "/assets/images/Laboratories/Mts/thomasAlva_lab.jpg"
      },
      {
        "topic": "KAREL CHEPAK CNC LABORATORY",
        "detail": [
          "CNC machines play an important role in the manufacturing industry, providing efficiency, accuracy, and consistency.",
          "* HARDWARE:",
          "- Ace - Jobber XL Production version CNC Turning Center",
          "- LMW - LMill 55 Vertical Machining Center (VMC)",
          "- Hydraulic Power Hacksaw machine",
          "- CNC Wire-cut EDM",
          "- HMT - T70 CNC Trainmaster Lathe",
          "- HMT - VMC 200 CNC Trainmaster Machine Center",
          "- System with Mastercam software - 2 nos for interfacing with CNC machines"
        ],
        "image": "/assets/images/Laboratories/Mts/karel_lab.jpg"

      },
      {
        "topic": "ROBERT E NEWNHAM SENSORS AND INTERNET OF THINGS LABORATORY",
        "detail": [
          "This lab helps students develop knowledge about sensor technology and IoT applications.",
          "* SENSORS / TRANSDUCER EXPERIMENTAL KIT:",
          "- RTD, Thermocouple and Thermistor Module",
          "- Speed Control & Closed Loop Control of DC Motor",
          "- Strain and Torque Measurement Kits",
          "- Piezo-Electric Vibration, Acceleration Transducer Kit",
          "* SOFTWARE:",
          "- LabVIEW 2018",
          "- SCXI-1000-National Instruments signal conditioning unit",
          "* IoT Device and Equipments:",
          "- M2M Gateway device (Viola, Finland)",
          "- TREK 668 Embedded IoT computer (Sponsored by Advantech Co Ltd, India)",
          "No of computers: 3"
        ],
        "image": "/assets/images/Laboratories/Mts/newman_lab.jpg"

      },
      {
        "topic": "BLAISE PASCAL FLUID POWER LABORATORY",
        "detail": [
          "The Fluid Power Lab is equipped with various pneumatic and hydraulic trainer kits.",
          "* SOFTWARE:",
          "- Automation Studio V5.6",
          "- Fluidsim - P",
          "* HARDWARE:",
          "- Magnetic Flow symbols Trainer kit – JANATICS",
          "- Transparent Pneumatic Trainer kit – JANATICS",
          "- Electro Pneumatic Trainer Kit with Profile Plate – FESTO & JANATICS",
          "- Basic Hydraulic Trainer kit with linear and rotary actuators - MANSCO",
          "No. of Computers: 7"
        ],
        "image": "/assets/images/Laboratories/Mts/blaise_lab.jpg"

      },
      {
        "topic": "Jeff Kodosky Virtual Instrumentation Laboratory",
        "detail": [
          "Jeff Kodosky Virtual Instrumentation Laboratory accommodates KEC - NI LabVIEW Academy School. The laboratory focuses on educating the students with in-depth knowledge about virtual instrumentation and its real time applications. LabVIEW provides a graphical programming approach that helps to visualize every aspect of our application, including hardware configuration, measurement data, and debugging.",
          "* Application Software:",
          "- LabVIEW 2016",
          "- MATLAB 2019a",
          "- MultiSIM/ MultiMCU",
          "* Modular Hardware:",
          "- DAQ - NI USB 6221",
          "- NI My RIO",
          "- NI My DAQ",
          "- NI Tetrix Prime",
          "- PSOC 4.0 Embedded Kit",
          "- Crazy file 2.0- Minidrone",
          "- UAV multi-rotor drone kit",
          "- No of computers: 40"
        ],
        "image": "/assets/images/Laboratories/Mts/virtual_lab.jpg"

      },
      {
        "topic": "Research Laboratory",
        "detail": [
          "The Research Laboratory is equipped with various facilities for the benefit of students and research scholars of the department.",
          "* Equipments:",
          "- Mechanical Seal Test Rig",
          "- Pin on Disc – Friction and Wear test rig",
          "- DataLOG (Miniature Wireless Bluetooth) surface EMG system",
          "- Metal Powder Spray Coating Machine",
          "- Precision weighing scale",
          "- Remote monitoring & control of pressure & flow in pipeline system",
          "- Electro-hydraulic servo system with fuzzy logic controller for Hydraulic Presses",
          "- High Temperature Chamber Furnace",
          "- sEMG (electromyography sensor)",
          "- Tool condition monitoring system",
          "- Air Quality Monitoring Solution",
          "- CNC wire cut EDM machine",
          "- Emotiv EPOCX IN CHANNEL Mobile brain wear"
        ],
        "image": "/assets/images/Laboratories/Mts/research_lab.jpg"

      },
      {
        "topic": "Control Engineering Laboratory",
        "detail": [
          "The Control Engineering Laboratory facilitates students in enhancing their learning of control systems in time and frequency domain. It imparts knowledge on developing mathematical models of physical systems and analyzing their behavior.",
          "* Software:",
          "- MATLAB 2016",
          "* Hardware:",
          "- Electromechanical Actuation System",
          "- Translational Motion System",
          "- Rotational system",
          "- Position Control System",
          "- Magnetic levitation system",
          "- Servo Hydraulic System with Feedback Amplifier",
          "- No. of Computers: 08"
        ],
        "image": "/assets/images/Laboratories/Mts/control_lab.jpg"

      },
      {
        "topic": "Electron Devices and Digital Circuits Laboratory",
        "detail": [
          "This laboratory is intended for teaching and project development in electric circuits, electronic devices, and digital electronics.",
          "* Software:",
          "- CADENCE ORCAD PCB SUITE Version 16.6",
          "* Hardware:",
          "- Digital & Analog IC Tester",
          "- Function Generator",
          "- Dual Trace Oscilloscope",
          "- Pulse Generator",
          "- DC Regulated Power Supply",
          "- Digital IC Trainer",
          "- PCB Prototype Modeling Machine",
          "- Digital Storage Oscilloscope",
          "- No. of Computers: 02"
        ],
        "image": "/assets/images/Laboratories/Mts/electronDevices_lab.jpg"

      },
      {
        "topic": "Project Laboratory",
        "detail": [
          "The Project Laboratory is a place for creative learning and innovation. Here, students get valuable hands-on experience with a state-of-the-art environment in the field of Mechatronics Engineering.",
          "* Mechanical Workbench:",
          "- Fractal works Julia- 3D printer",
          "- Bosch Multipurpose tool GOP 30-28",
          "- Bosch Chordless Drill",
          "- CNC Laser Engraver",
          "- Welding Kit",
          "- Sewing Machine",
          "- Modular 3 in 1 3D printer",
          "* Electrical Workbench:",
          "- Glue Gun",
          "- Soldering Kit",
          "- Controllers and Power source",
          "- Sensors (ultrasonic, IR, etc.)",
          "- Electrical Work Bench with RPS",
          "- Interfacing Facilities"
        ],
        "image": "/assets/images/Laboratories/Mts/project_lab.jpg"

      }
    ],
    
    "library": {
      "name": "Mechatronics Engineering Department Library",
      "description": "Mechatronics Engineering Department has a separate department library to cater the specific needs of the students with a collection of text books, reference books and journals, for their quick reference and easy accessibility. The following is the consolidated data related to the department library.",
      "details": {
        "total_area": "79 sq.m",
        "number_of_volumes": "689",
        "number_of_titles": "518",
        "number_of_project_report_cd": "44",
        "number_of_online_journals": "81",
        "number_of_journals/magazines_subscribed": "8/3",
        "working_hours": "8:40 AM to 7 PM"
      }
    },
    "rnd": {
      "academic": "https://rnd.kongu.edu/academic/mts.php",
      "activities":"https://rnd.kongu.edu/activities/mts/index.php"
    },    
  "dept_images": [
      "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
  ]
}