{
  "image": "../../../assets/images/Department Banner/ece.jpg",
  "about": "Electronics and Communication Engineering (ECE) is a branch of engineering that focuses on the design, development, and application of electronic devices and communication systems. It encompasses various fields, including embedded systems, VLSI design, signal processing, wireless communication, and the Internet of Things (IoT). ECE engineers work on cutting-edge technologies such as 5G, satellite communication, artificial intelligence, and semiconductor technology, shaping the future of global connectivity. With rapid advancements in communication networks and smart devices, the field continues to evolve, enhancing speed, efficiency, and security in data transmission. As the world moves towards a more connected and digital era, Electronics and Communication Engineering plays a crucial role in driving innovation across industries, improving communication, automation, and intelligent systems.",
  "dept-name": "Electronics and Communication Engineering",
  "hod_name": "Dr.N.Kasthuri",
  "intake": 240,
  "me": 6,
  "phd": "-",
  "vision": "To be a centre of excellence for development and dissemination of knowledge in Electronics and Communication Engineering for the Nation and beyond.",
  "mission": [
      "To impart industry and research based quality education for developing value based Electronics and Communication engineers.",
      "To enrich the academic activities by continual improvement in the teaching learning process.",
      "To infuse confidence in the minds of students to develop as entrepreneurs.",
      "To develop expertise for consultancy activities by providing thrust for Industry Institute Interaction.",
      "To endeavor for constant up gradation of technical expertise for producing competent professionals to cater to the needs of the society and to meet the global challenges."
  ],
  "objective": "To equip students with the necessary technical and managerial skills.",
  "peo": [
      "Succeed in industry and higher education by applying knowledge of mathematics, science and engineering principles.",
      "Analyze, design and implement electronics based solutions to meet the real-world problems, with constant update of domain knowledge.",
      "Demonstrate Soft skills, Professional and Ethical values and an aptitude for lifelong learning needed for a successful professional career."
  ],
  "po": [
    "Engineering knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems.",
    "Problem analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences.",
    "Design/development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal and environmental considerations.",
    "Conduct investigations of complex problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions.",
    "Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.",
    "The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.",
    "Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.",
    "Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.",
    "Individual and team work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings.",
    "Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions.",
    "Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments.",
    "Life-long learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change."
  ],
  "pso": [
      "Products Development: Apply intradisciplinary knowledge and skills to develop products for providing solutions for the real world problems in Industry, Agriculture, Healthcare and Communication etc.",
      "Development of Entrepreneurship: An aptitude to take up applied research useful to become Entrepreneurs in Electronics and Communication Engineering by combining the skills of project management and finance."
  ],
    "highlights": {
      "Publications": [
        "1031 papers published in international journals and conferences with SCI/Scopus/WOS",
        "655 publications have been done by our faculty members"
      ],
      "Centres of Excellence": [
        "COE-Intel Unnati Labs - 2024",
        "COE in Edge AI with Digitoad Technologies, Bengaluru - 2022",
        "Centre of Excellence in VLSI Domain - 2021"
      ],
      "Startups Initiated": ["Gluco Track", "Likan", "Agaram Agro Tech"],
      "Awards": [
        "Shri P P Malhotra Memorial Award for IETE - 2023",
        "Dr.Kalam Young Achiever Awards from World Youth Federation - 2020, 2016, 2017",
        "Uzhavar Award from Uzhavan Foundation - 2020",
        "Teaching Excellency Awards - 2017",
        "All India National Award from Thal Sainik Camp, New Delhi - 2017",
        "Best Innovation Award with cash prize of Rs.25,000 from CII and YI - 2017",
        "Chennai Science Fest-2017 Award from Science City, Government of Tamil Nadu - 2017",
        "Young Scientists Conclave Award in Indian International Science Festival from GoI - 2016",
        "Best NSS Volunteer Award from Anna University - 2016",
        "Gandhian Young Technological Innovation Award from IIM, Ahmedabad - 2013-2014",
        "Best IETE Student Forum (ISF) Award - 2010-12 and 2014-16",
        "ISTE National Award for Best B.E Project"
      ],
      "Grants Received": [
        "NCW (National Commission for Woman- Government of India) grant of Rs.4.75 Lakhs - 2019",
        "DST grant of Rs.35 Lakhs - 2019",
        "AICTE grant of Rs.14 Lakhs - 2019",
        "FIST grant of Rs.13.6 Lakhs - 2018",
        "AICTE grant of Rs.9.44 Lakhs under MODROBS-VLSI Lab",
        "UGC minor research projects - Rs.1.3 Lakhs and Rs.1 Lakh",
        "AICTE grant of Rs.5 Lakhs under MODROBS - Communication Lab"
      ],
      "Patents": ["4 obtained", "27 published"],
      "Consultancy Works": "Rs.14 Lakhs for various industries",
      "MoU Signed": "12 Industries",
      "Accreditations": [
        "Extension of NBA accreditation for one year under Tier-1 Washington Accord - 2016",
        "Reaccredited by NBA for 2 years under Tier-I Washington Accord - 2014",
        "Department accredited by NBA for five years - 2001 and 2008"
      ],
      "Infrastructure and Labs": [
        "Texas Instruments sponsored Analog System Design lab - 2014",
        "Established Free scale Embedded system laboratory Sponsored by Free scale Semiconductors Inc, USA",
        "Rs.4 Crore Technological Business Incubator with DST funding"
      ],
      "Student Achievements": [
        "Best presentation award for a student at NASA, USA",
        "IEEE Enterprise Award for students",
        "5538 students presented technical papers/projects with 864 prize winners",
        "304 project models exhibited in science exhibitions"
      ],
      "Research Projects": [
        "Research project undertaken for BPL Telecom, Palakkad",
        "Approved Research Centre by Anna University of Technology, Coimbatore"
      ],
      "Academic Milestones": [
        "M.E Embedded Systems started - 2012",
        "B.E Electronics and Communication Engineering intake increased from 180 to 240 - 2012",
        "M.E Communication Systems started - 2011",
        "B.E Electronics and Communication Engineering intake increased from 120 to 180 - 2011",
        "M.E VLSI Design started - 2003",
        "M.E Applied Electronics started - 2002",
        "B.E Electronics and Communication Engineering intake increased from 60 to 90 - 2000",
        "B.E Electronics and Communication Engineering started with 60 students - 1984"
      ],
      "Events and Workshops": [
        "126 self-supported national level workshop/seminar/FDP from 2010-11 till date",
        "41 sponsored national level workshop/seminar/FDP from 2010-11 till date",
        "First National Level Students Technical Symposium \"ACUMEN\" held - 1996"
      ],
      "Radio and Media": "Kongu Community Radio (90.4MHz) established - 2005"
    },  
    "milestones": [
      {
        "year": 2022,
        "event": [
            "Established Centre of Excellence on Industrial IoT.",
            "NBA awarded Accreditation for 3 years."
        ]
      },
      {
        "year": 2020,
        "event": "Reaccredited by NBA for 1 year."
      }
    ],

    "labs": [
      {
        "topic": "Research Lab",
        "detail": [
          "Research laboratory was established using various funding agencies like DST, TNSCST, FIST, AICTE MODROB etc for the purpose of research and development."
        ],
        "image": "/assets/images/Laboratories/Ece/research.jpg"
      },
      {
        "topic": "Foundation Lab 4 (Internet of Things)",
        "detail": [
          "Foundation Laboratory - 4 (IoT), a cutting-edge facility dedicated to nurturing essential skills among students, empowering them to excel in the intricate realms of PCB design and Internet of Things (IoT) project development. Our state-of-the-art lab is fully equipped with advanced tools, including the PCB Milling machine, industrial-grade soldering machines, IoT development boards, and an extensive array of sensors and actuators. Designed to accommodate a cohort of 60 students, this dynamic learning environment fosters hands-on experiences with the latest technology. Within the lab, students have access to a comprehensive suite of software, meticulously installed to facilitate the seamless development of innovative projects. Here, creativity meets technical expertise as students harness their potential to control and monitor IoT devices in real time.",
          "Foundation Laboratory is equipped with the following equipment.",
          "* HARDWARE:",
          "- Desktop Computers",
          "- PCB Mate - PCB Milling machine",
          "- ESP32 Modules (IoT Development Board)",
          "- Soldering Machines",
          "- Arduino UNO",
          "- Arduino Nano",
          "- Sensors and actuators",
          "- Basic electronic components",
          "* SOFTWARE:",
          "- EasyEDA",
          "- CopperCAM",
          "- Autoleveller",
          "- MACH3Mill",
          "- Arduino IoT Cloud"
      
        ],
        "image": "/assets/images/Laboratories/Ece/foundationlab.jpg"
      },
      {
        "topic": "Marconi Communication Laboratory",
        "detail": [
          "Communication Engineering laboratory facilitates the students to learn the techniques used in analog and digital transmission and reception of signal. The students are upskilled for constructing the circuits for analog and digital communication. Along with, they are also trained to measure and analyze the parameters of antennas working at RF frequencies.",
          "- Dual Trace Oscilloscope",
          "- Digital Storage Oscilloscope",
          "- Spectrum Analyzer",
          "- AM/FM Transmitter Demonstration kit",
          "- AM/FM Receiver Demonstration kit",
          "- Data Communication kit for TDM, PCM, line coding and decoding",
          "- PN sequence generator",
          "- ASK, FSK, PSK, QPSK Modulation/Demodulation Trainer Kits",
          "- Digital Communication Teaching Bundle with USRP 2900",
          "- Antenna Trainer kit",
          "- LAN Trainer kit",
          "- LVDT Trainer kit"      
        ],
        "image": "/assets/images/Laboratories/Ece/morse_communication_lab.jpg"
      },
      {
        "topic": "Marconi Radio Frequency Lab",
        "detail": [
          "Marconi RF lab is well equipped with antenna kits (Yagi Uda, Halfwave Dipole, Square Loop) to enhance the study of various types of antenna and its radiation patterns.",
          "The major facilities include:",
          "- Antenna Trainer System",
          "- Spectrum Analyzer",
          "- Digital Storage Oscilloscope",
          "- RF Transmitter/ Receiver"
        ],
        "image": "/assets/images/Laboratories/Ece/marconi_rf_lab.jpg"
      },
      {
        "topic": "Thomson Electronics and Integrated Circuits Laboratory",
        "detail": [
          "Electronics Lab helps the students to acquire basic knowledge about the electronic devices like diode, transistor and thyristor families. It comprises basic electron devices lab, Electronic Circuits Lab and Linear IC Lab. In devices lab, all the device characteristics are studied. In Electronic Circuits Lab, the basic circuits for power supplies, regulators, amplifiers and oscillator are designed, constructed, tested and studied. In LIC lab, applications using op-amps are designed, constructed and verified."
        ],
        "image": "/assets/images/Laboratories/Ece/thomsan.jpg"
      },
      {
        "topic": "Von Neumann Microprocessor and Controller Laboratory",
        "detail": [
          "Microprocessor lab helps the students to enhance their knowledge on architecture, programming and interfacing of various processors and microcontrollers. Students from other branch of engineering and sciences also utilize this lab and develop their skills in the field of microprocessor and its applications. The features and facilities available in this lab will help the students to do their projects and enhance their knowledge on the latest trends and technologies",
          "Microprocessor Laboratory is equipped with the following equipment.",
          "- 8086 Microprocessor Trainer (Micro 86/88 LCD)",
          "- 8051 Microcontroller Trainer",
          "- Stepper Motor Controller Study Module (VCET 06)",
          "- LVDT Position Trainer (VLPCT 01)",
          "- Microprocessor Based AC motor controller (IIB PEC00A1)",
          "- Microprocessor Based DC motor Controller (IIB PEC 00S1)",
          "- ARM 7MP CORE Processor",
          "- Cathode Ray Oscilloscope",
          "- Microcontroller / EEPROM Programmer",
          "- PIC Microcontroller Interface",
          "- Programmer for various Microcontrollers"      
        ],
        "image": "/assets/images/Laboratories/Ece/MPMC_lab.jpg"
      },
      {
        "topic": "Fourier Digital Signal Processing Laboratory",
        "detail": [
          "This lab is to impart knowledge on various DSP processors like TMS320C5X series and ADSP 21XX series. The students understand various concepts in signal processing through simulation using MATLab and implementation using processor kits. An exposure on real time applications is also given.",
          "DSP Laboratory is equipped with the following equipment.",
          "Microprocessor Laboratory is equipped with the following equipment.",
          "- MATLAB 2023b Campus Wide license",
          "- TMS 320 C5416- 6 Kits",
          "- TMS 320 C6713- 2 Kits",
          "- TMS 320C6748 – 12 Kits",
          "- ADSP BF-533 EZ- 1 Kit",
          "- ADSP BF-537 EZ- 1 Kit",
          "- ADSP BF-537 Stamp board with Linux platform",
          "- ADSP 21065 Kit",
          "- ADSP 2181 Kit",
          "- Pro Audio development Kit",
          "- IPPBX board with FXO & FXS",
          "- Digital Storage Oscilloscope (50MHz) – 1",
          "- Thermal Camera"

        ],
        "image": "/assets/images/Laboratories/Ece/fourier.jpg"
      },
      {
        "topic": "Maxwell Microwave and optical laboratory",
        "detail": [
          "The Microwave and Optical lab with Reflex Klystron and Gunn diode microwave setup to understand the working principle of reflex klystron and to analyze the characteristics of Gunn diode in X-band(8-12GHz) frequency range. Optical modules like LED, Laser Diode, Photo Diode, Avalanche Photo Diode are available to understand its VI and PI characteristics. The satellite communication kit, radar communication kit facilitates application oriented knowledge through some data communication between transmitter and receiver through satellite and to measure the target object characteristics using electromagnetic signals in radar kit.",
          "The power meter, frequency meter, VSWR meter are available for microwave signal parameter measurements.",
          "The optical communication laboratory complements the topics studied in the optical communication theory course. The lab is equipped with fiber optic trainer kits and modules to enable the study of components of an optical communication system.",
          "Microwave and Optical Laboratory is equipped with the following equipments.",
          "* HARDWARE:",
          "- X band Reflex Klystron setup",
          "- X band Gunn setup",
          "- Various microwave components like magic tee, circulator, isolator, directional coupler, reflectometer, variable attenuator, and slotted line section with carriage probe, ss tuner, horn antenna",
          "- Laser diode module",
          "- LED module",
          "- Photodiode module",
          "- Avalanche photodiode module",
          "- Optical trainer kit",
          "- Modes of optical fiber setup",
          "- Satellite trainer kit",
          "- Radar trainer kit",
          "- Light Runner setup"
        ],
        "image": "/assets/images/Laboratories/Ece/maxwell.jpg"
      },
      {
        "topic": "Hollerith Hardware and Digital laboratory",
        "detail": [
          "Hardware and Digital Laboratory enhances the student's knowledge on different types of combinational and sequential logic circuits. The student can design, construct and verify the logic of various digital circuits.",
          "Hardware and Digital Laboratory comprises of the following equipments.",
          "- 8-bit Digital IC Trainer Kits",
          "- 10-bit Digital IC Trainer kit",
          "- 20-bit Digital IC Trainer kit",
          "- Digital IC Tester"
        ],
        "image": "/assets/images/Laboratories/Ece/Hollerith_Hardware_Lab_II.jpg"
      },
      {
        "topic": "Vinton Networks Laboratory",
        "detail": [
          "Network Laboratory motivates the students to design and analyze the behavioral aspects of wired and wireless networks. Furthermore, network lab motivates students to takeup research in WSN, MANET, VANET & Wi-Fi networks.",
          "Vinton Network Lab is Equipped with the following equipment:",
          "- Wireless sensor Hardware Tool (Gateway Module, Core Module, Sensors)",
          "- Network Simulator (NS-3) & (NS-2)",
          "- Netsim Simulation Software",
          "- Stratoshark"
      
        ],
        "image": "/assets/images/Laboratories/Ece/nr_lab.jpg"
      },
      {
        "topic": "Kilby VLSI Laboratory",
        "detail": [
          "The students are trained to design digital circuits using the various hardware description languages and also their implementation on FPGAs. Lab is well equipped with synopsys and real time implementation kits for the students to undertake projects in the area of VLSI Design.",
          "VLSI Lab is equipped with the following equipments.",
          "* HARDWARE",
          "- FPGA Universal Trainer kits",
          "- XILINX VERTEX 2, VERTEX 7 FPGA kits",
          "- XILINX SPARTAN 2E FPGA kits",
          "- XILINX SPARTAN 3, SPARTAN 3E FPGA kits",
          "- XC9536 CPLD Trainer kits",
          "- Coolrunner CPLD Trainer kits",
          "- ADD on cards",
          "- FPGA kit – Basys 3",
          "* SOFTWARE:",
          "- Renoir – Modelsim and Leonardo Spectrum with Design Entry",
          "- XILINX ISE Series with Modelsim",
          "- MICROWIND"
        ],
        "image": "/assets/images/Laboratories/Ece/kilby.jpg"
      },
      {
        "topic": "Robert Norton Noyce ASIC laboratory",
        "detail": [
          "The students are trained to design digital circuits using the various hardware description languages and also their implementation on FPGAs. Lab is well equipped with synopsys and real time implementation kits for the students to undertake projects in the area of VLSI Design.",
          "ASIC Lab is equipped with the following equipment.",
          "* Hardware",
          "- Xilinx Virtex5 XUPv5 LX110t development kit",
          "* Software",
          "- Cadence Software - Front end and Back end (15 users)",
          "- Mentor Graphics HEP Category Xilinx Vivado System Edition"
        ],
        "image": "/assets/images/Laboratories/Ece/ASIC_Lab.jpg"
      },
      {
        "topic": "Charles Babbage Computer Centre",
        "detail": [
          "The department has a well-equipped computer centre, facilitating students to learn programming languages such as C ,C++ ,Java and python to implement the concepts of data structures & algorithms.",
          "The Open source operating system like Linux is installed in all the system. Also open source software’s like Mysql & Eclipse is installed so the students can explore database and IDE to work on programming languages. The centre is also used for e-learn like NPTEL, Coursera , Edx.",
          "The Computer Centre is fully equipped with uninterrupted power supply and central air-conditioning units."
        ],
        "image": "/assets/images/Laboratories/Ece/Computer_Centre.jpg"
      },
      {
        "topic": "Bell Communication System Design Laboratory",
        "detail": [
          "This lab provides a platform to the students to design, simulate, analyze and test the RF circuits, antennas and microwave components using the Electromagnetic simulation tools and Vector Network Analyzer.",
          "The fundamental communication techniques are observed using Matlab simulation and practically tested by implementing in WiCOMM _T Wireless Digital Communication Training System.",
          "* HARDWARE",
          "- Keysight Vector Network Analyzer (30KHz – 9GHz)",
          "- WiCOMM-T Wireless Digital Communication Training System",
          "* SOFTWARE:",
          "ANSYS HFSS – 3D Structure Simulator",
          "Keysight Advanced Design System",
          "Matlab R2015b"

        ],
        "image": "/assets/images/Laboratories/Ece/Communication_Systems_Lab.jpg"
      },
      {
        "topic": "KEC - Freescale embedded system laboratory",
        "detail": [
          "KEC- Freescale Embedded System Laboratory was sponsored by M/s Freescale Semiconductors Pvt., Lt.,. This lab is equipped with industrial microprocessor and project board kits, which enhance student’s knowledge related to industrial needs. This lab is also equipped with single board computer and computing devices to facilitates in the field of latest technologies like Artificial Intelligence (AI), Machine Learning (ML).",
          "* HARDWARE",
          "- MCU project board (PBMCUSLK)",
          "- MCU 32 bit cold fire student learning kit (AP5223SLK)",
          "- Symphmy audio kit (SOUND BYTE)",
          "- FPGA application module student learning kit (APS3EFPGASLK)",
          "- Zigbee application module student learning kit (APB192USLK)",
          "- MPC8313 development kit (MPC8313E-RDB)",
          "- PIC Programmer",
          "- 8051 USB Programmer",
          "- Digital Multimeter",
          "- ARM 9 Kit with 7\" TFT Touch Screen and Linux 2.6",
          "- DC Power Supply +5v/+12V, 2A",
          "- TFT Screen With Touch Panel 3.5",
          "- Raspberry Pi 3",
          "- RPI NoIR camera board - V2",
          "- Orange Pi Zero - 512MB",
          "- Scientific DSO-SMO100 100 MHz, 1GS/s",
          "- Intel Neural Computing Stick -2",
          "- Microchip PICKIT-4",
          "- STM32 ARM Cortex M4 Development Kit (Components and Software)",
          "- Raspberry Pi 4 Model B",
          "* SOFTWARE:",
          "- Comprehensive Design & Simulation Environment for Micro-Controller Models",
          "- STM32CUBE IDE & Arduino IDE",
          "- STMicroelectronics NanoEdge AI Studio Edu Pack"
        ],
        "image": "/assets/images/Laboratories/Ece/Freescale_Embedded_System_Lab.jpg"
      },
      {
        "topic": "Project Cubicle",
        "detail": [
          "The department has a unique project cubicle for the students to carry out their project work in an environment which facilitates creativity and innovation. Students and research scholars utilize this facility for design, analyze and implement various academic and mini projects."
        ],
        "image": "/assets/images/Laboratories/Ece/project_cubicle.jpg"
      },
      {
        "topic": "Harvard Advanced Microcontroller Laboratory",
        "detail": [
          "This lab is established to impart practical knowledge on design of microprocessor based real time embeddedsystems, and aimed at uplifting the skills of the students in the design and development of embedded systems. The lab is equipped with advanced industrial control processors like PIC, AVR, Raspberry Pi, etc., and embedded communication protocol devices like Zigbee and LoraWAN. The lab has enough systems to accommodate batch of 35 students with individual computers and the hardware necessary to conduct experiments.",
          "Advanced Microprocessor Laboratory is equipped with the following equipment:",
          "* Hardware",
          "- PIC 16 Series Microcontroller",
          "- Raspberry Pi 3 B+",
          "- LoRaWAN Gateway and Nodes",
          "- Siemens IoT Gateway - SIMATIC IOT2020",
          "- Arduino UNO",
          "- Arduino Mega",
          "* SOFTWARE:",
          "- Proteus VSM Software",
          "- CCS Compiler",
          "- PCM Command line C Compiler for microchip PIC 10/12/14/16 Devices"
        ],
        "image": "/assets/images/Laboratories/Ece/AMC_lab.jpg"
      }
     
    ],
    
    "library": {
      "name": " Electronics and Communication Engineering Department Library",
      "description": "The Electronics and Instrumentation engineering department has a separate department library to cater to the specific needs of the students. The following is the consolidated data related to the department library.",
      "details": {
        "total_area": "20.12mx4.88m",
        "number_of_titles": "611",
        "number_of_books": "1452",
        "number_of_online_journals": "27",
        "number_of_national_journals & magazines_subscribed": "21",
        "No. of news papers subscribed": "03 + Employment News",
        "project_report": "All the BE and ME degree project work reports"
      }
    },

      "patents": {
        "details": [
          {
            "Title": "Automatic gas stove",
            "Students": ["G.Manikandan", "R.Shankar", "Jabachakraborty"],
            "Guide": ["Dr.G.Murugesan"],
            "Year": "25.4.2008",
            "Patent No": "219187"
          },
          {
            "Title": "Polymorphic keyboard for physically handicapped",
            "Students": ["K.S.Satheesh Kumar"],
            "Guide": ["V.R.Saraswathy"],
            "Year": "13.5.2008",
            "Patent No": "219748"
          },
          {
            "Title": "A plucking device for climbing a tree and harvesting a fruit from the tree",
            "Students": ["R.Sathishkumar"],
            "Guide": ["Dr.S.Maheswaran"],
            "Year": "9.8.2021",
            "Patent No": "374141"
          },
          {
            "Title": "Automatic Coconut Dehusking Machine With Identification of Decay in Coconut",
            "Students": ["R.P.Karthik"],
            "Guide": ["Dr.S.Maheswaran", "S.Sathesh"],
            "Year": "14.3.2024",
            "Patent No": "526009"
          }
        ]
      },
    
    "rnd": {
      "academic": "https://rnd.kongu.edu/academic/ece.php",
      "activities":"https://rnd.kongu.edu/activities/ece/index.php"
    },    
  "dept_images": [
      "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
  ]
}