{
  "image": "https://img.freepik.com/free-photo/person-using-ar-technology-their-daily-occupation_23-2151137517.jpg?t=st=1742316233~exp=1742319833~hmac=0445d7af0510bf642933e543fa19a030a8de1172c6bf050f78913509b2c64ce4&w=2000",
  "about": "M.Sc. Software Systems under the Computer Technology Postgraduate (CTPG) program is a unique integrated five-year course designed to provide students with a strong foundation in both theoretical and practical aspects of software development and system design. This program blends core concepts of computer science with advanced topics in software engineering, aiming to develop professionals who can innovate and lead in the fast-paced tech industry. Students are trained in programming, database management, system architecture, cloud computing, cybersecurity, and emerging technologies like AI and machine learning. With a curriculum that evolves with industry trends, the course emphasizes hands-on experience through projects, internships, and research activities. By the end of the five years, graduates are equipped with a master’s level understanding and industry-ready skills, making them highly competent for roles in software development, IT consulting, system analysis, and tech-driven entrepreneurship.",
  "dept-name": "Computer Technology - PG",
  "hod_name": "Dr.R.C.Suganthe",
  "intake": 60,
  "vision": "To become a technically competent centre in the domain of Computer Science to meet the changing needs of nation and beyond.",
  "mission": [
      "Inculcate conceptual knowledge with profound practical and real time industry exposure to the students.",
      "Nourish a learning ambience to enhance innovations, problem solving skills, leadership qualities, team-spirit and ethical responsibilities.",
      "Vitalize the students to acquire entrepreneurial skills to become global leaders."
  ],
  "objective": "To equip students with the necessary technical and managerial skills.",
  "peo": [
      "Work productively as high competent software professionals with strong domain knowledge to develop smart solutions for the upliftment of society.",
      "Emerge successful entrepreneurs with the strong business managerial skills.",
      "Exhibit eternal improvement to enhance knowledge and skills through life-long learning appreciating human values and ethics."
  ],
  "po": [
    "Engineering Knowledge: Apply knowledge of mathematics, natural science, computing, engineering fundamentals and an engineering specialization to develop to the solution of complex engineering problems.",
    "Problem Analysis: Identify, formulate, review research literature and analyze complex engineering problems reaching substantiated conclusions with consideration for sustainable development.",
    "Design/Development of Solutions: Design creative solutions for complex engineering problems and design/develop systems/components/processes to meet identified needs with consideration for the public health and safety, whole-life cost, net zero carbon, culture, society and environment as required.",
    "Conduct Investigations of Complex Problems: Conduct investigations of complex engineering problems using research-based knowledge including design of experiments, modelling, analysis & interpretation of data to provide valid conclusions.",
    "Engineering Tool Usage: : Create, select and apply appropriate techniques, resources and modern engineering & IT tools, including prediction and modelling recognizing their limitations to solve complex engineering problems.",
    "The Engineer and The World: Analyze and evaluate societal and environmental aspects while solving complex engineering problems for its impact on sustainability with reference to economy, health, safety, legal framework, culture and environment.",
    "Ethics: Apply ethical principles and commit to professional ethics, human values, diversity and inclusion; adhere to national & international laws.",
    "Individual and Collaborative Team work: Function effectively as an individual, and as a member or leader in diverse/multi-disciplinary teams.",
    "Communication: Communicate effectively and inclusively within the engineering community and society at large, such as being able to comprehend and write effective reports and design documentation, make effective presentations considering cultural, language, and learning differences.",
    "Project Management and Finance: Apply knowledge and understanding of engineering management principles and economic decision-making and apply these to one’s own work, as a member and leader in a team, and to manage projects and in multidisciplinary environments.",
    "Life-Long Learning: Recognize the need for, and have the preparation and ability for i) independent and life-long learning ii) adaptability to new and emerging technologies and iii) critical thinking in the broadest context of technological change."
  ],
  "pso":[
    "Apply knowledge in diverse areas of computer science and experience an environment conducive in cultivating skills for successful career and entrepreneurship extend relate.",
    "Identify the suitable mathematical solution and computing skills required to provide reliable solutions for the real world problems."
  ],
  "highlights": {
      "Funded Research Projects": [
        "Completed Funded Research Project worth Rs.7 lakh"
      ],
      "Consultancy": [
        "Completed Consultancy Works of worth Rs.31 lakh"
      ],
      "MoUs": [
        "Signed MoUs with leading companies like Incresco and Hackers Infotech"
      ],
      "Research Centre": [
        "Research Centre with 12 Scholars pursuing PhD"
      ],
      "Awards & Recognitions": [
        "Outstanding Scientist award by VIFRA 2015",
        "Bharat Seva Ratan Gold Medal Award by Global Economic Progress & Research Association 2015",
        "Best Researcher Award by Top Engineers 2016",
        "Best Scientist Award Association of Scientists Developers and Faculties 2016",
        "Excellent Professional Achievement Award by Society of Professional Engineers 2016",
        "Best Professor Award by Association of Scientists Developers and Faculties 2016",
        "Teaching and research excellence Award by Grabs Educational Charitable Trust 2017",
        "Best Research supervisor Award by Arunai International Research Foundation 2017",
        "Leading Educationist of India 2018 by DK international Foundation 2018",
        "Life time Achievement National Award by IRDP group of journals 2018",
        "Life time Achievements by Global Outreach Research & Education Association 2018",
        "Innovative Academician Award by Star International Foundation for Research and Education’s Academic Excellence Awards 2024"
      ],
      "Workshop and Seminars": [
        "Organized funded seminars and workshop programs worth Rs.11.41 lakh"
      ],
      "Student Achievements": [
        " A grant of Rs.3 lakh was received from the Ministry of Education for the project titled 'Detection of Malware Trojan in Software Used in the Power Sector'"
      ]
    },  

    "milestones": [
      {
        "year": 1998,
        "event": "B.E.(EIE) Programme started with an intake of 30."
      }
    ],

    "labs": [
      {
        "topic": "Laboratory Facilities",
        "detail": [
            "Computer laboratory is furnished with 125 Computer Systems and one Server worth INR. 55,83,026 to cater the needs of the students.",
            "The FTP Server is installed with UBUNTU.",
            "Students can work with software of turbo C++,Java jdk, Pycharm and Microsoft Visual Studio.",
            "Oracle 10G Client is installed for Relational Database Management Laboratory ­to create and interact with database.",
            "Students can design and develop software using Rational Rose and other software development tools.",
            "Students can design and develop interactive web page using HTML, CSS, Java Script, J2EE and .Net Framework Technologies.",
            "Provide practical exposure on Linux platform by creating and executing applications using gcc compiler in UBUNTU.",
            "Cloud Computing Techniques are imparted to the students using Free and Open source software like Virtual Box.",
            "Students can analyze and simulate testing methodologies using testing frameworks such as Selenium, JUnit.",
            "The Free and Open source software is downloaded and customized to meet the requirements of the software design methodologies."
        ],
        "image": "/assets/images/Laboratories/Ctpg/lab.jpg"
      }
    ],
    
    "library": {
      "name": " Computer Technology - PG Department Library",
      "description": "The Computer Technology - PG department has a separate department library to cater to the specific needs of the students. The following is the consolidated data related to the department library.",
      "details": {
        "number_of_titles": "275",
        "number_of_international_journals": "10",
        "number_of_national_journals": "5"
      }
    },
    "rnd": {
      "academic": "https://rnd.kongu.edu/academic/ct.php",
      "activities":"https://rnd.kongu.edu/activities/ctpg/index.php"
    },    
  "dept_images": [
      "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
  ]
}