{
  "image": "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png",
  "about": "The Department as a Research Centre provides facility leading to the degree of Doctor of Philosophy in the fields of Environmental Chemistry, Co-ordination Chemistry, Surface Chemistry & Adsorption, Nanotechnology and Material Science.",
  "dept-name": "Chemistry",
  "hod_name": "Dr.P.Manikandan",

  "vision": [
    "To make the students for understand the basic concepts of Chemistry which is highly essential and to the apply concepts in the field of Engineering and Technology effectively.",
    "To offer testing and consultancy services to industries and provide effective solutions.",
    "To support the development of the rural community through research."      ],
  "mission": [
    "To support the students in becoming quality engineers and scientists in various branches of Engineering and Technology.",
    "To support our students in their placements in reputed research organizations and industries.",
    "To carry out applied research in the field of environmental, organic,corrosion and surface chemistry."

  ],
  "highlights": {
    "Department has 17 faculty members (Ph.D - 14 and Ph.D Pursuing - 03)": true,
    "A separate Research Laboratory \"Centre for Environmental Research\" was established exclusively for doing research and Consultancy activities with all necessary facilities": true,
    "Recognized as a research centre by Anna University for doing Ph.D in Full / Part time. In this centre at present 4 scholars are pursuing Ph.D": true,
    "The department offers consultancy services to industries, NGO's and rural community in the region for analytical testing like water quality, food products and for guiding M.Sc., M.Phil., Projects": true,
    "Symposium on ‘Resources Extraction and Energy Consumption’ sponsored by TNSCST in 2010": true,
    "Workshop on ‘Recent Trends in Applications of Nanoscience in Corrosion Control’ sponsored by DRDO in 2010": true,
    "Two days National conference on ‘Recent Applications of Nanomaterials in Chemistry and Environmental Research’ sponsored by CSIR and MoEF in 2011": true,
    "One Day National Seminar on ‘Applications of Polymer Nanocomposite Materials in Various Fields (APNM 2011)’": true,
    "One Day National Seminar on ‘New Advances in Nanochemistry a Chemical Approach to Nanomaterials (NANC 2012)’ sponsored by DRDO in 2012": true,
    "Two day National conference on ‘Recent Applications of Nanomaterials in Chemistry and Environmental Research (RANCER 2012)’ sponsored by CSIR and BRNS in 2011 & 2012": true,
    "National seminar on ‘Industrial Applications of Polymer Nanocomposites (IAPNC- 13)’ sponsored by BRNS in 2013": true,
    "Two days National conference on ‘Recent Advances in Nanotechnology, Chemistry and Environmental Research (RANCER 2014)’ sponsored by MoES in 2014": true,
    "DAE-BRNS Sponsored One Day National Seminar on ‘Recent Advancements in Wastewater Treatment for Sustainable Development’ (RAWTSD-16) in 2016": true,
    "DBT Sponsored One Day National Seminar on ‘Recent Trends and Challenges in Phytochemistry and Biosorption’ (RTCPB-16) in 2016": true,
    "One day National level workshop on ‘Research Openings in Various Fields of Chemistry’ in 2017": true,
    "Two days International conference on ‘Energy, Environment and Advanced Materials for a Sustainable Future (ICEEAMSF-2017)’ sponsored by BRNS and CSIR in 2017": true,
    "Association of Chemistry Teachers Sponsored One Day National Seminar on ‘Environmental Applications of Chemical and Nanosciences’ ( EACN-2019) in 2019": true,
    "One day International virtual webinar on ‘Nano-The Tiny Warrior-Engineering Nanomedicine and Drug Delivery System’ in 2020": true,
    "National level Environmental Science Online ‘Quiz competition for students in view of world environmental day, in 2020": true,
    "Five Days Virtual FDP on ‘Vital Visionary Approach for Researchers-Recent Chemistry Perspective’ in 2020": true,
    "A Two Day International Webinar on ‘Trends in Convergence Science of Chemistry in Medicine’ in 2020": true,
    "Three days online FDP on ‘Journey of Nanomaterials for Intense Applications’ in 2020": true,
    "Two days webinar on ’Insight on proposals for funding agencies and Research writings’ in 2020": true,
    "Three days online FDP on ‘Digital tools for e-Teaching’ in 2020": true,
    "One day International webinar on ‘Transition metal catalyzed reactions in organic synthesis: application towards natural products and materials chemistry, in 2020": true,
    "Indian Science Academies' sponsored Two days Lecture workshop on ”Chemistry for a Sustainable Planet\" in 2021": true,
    "National level Environmental Science online Quiz competition for students in view of World Environment Day in 2021": true,
    "One day webinar on “Science of Climate Change” in 2021": true,
    "AICTE sponsored second International conference on “Energy, Environment and Advanced Materials for a Sustainable Future (ICEEAMSF-2021)” in 2021": true,
    "Two days State level online workshop on “Preparation Tips to Success CSIR-NET, GATE & SET Exams in Chemical Sciences” in 2021": true,
    "A National Level Quiz competition for students in view of “World Ozone Day” in 2021": true,
    "A Three day Virtual FDP on “Emerging Trends in Chemistry” in 2021": true,
    "Centre for Faculty Development, Anna University, Chennai sponsored six days online FDTP on ‘CY3151-Engineering Chemistry’ in 2022": true,
    "DAE-BRNS Sponsored National Seminar \"ADVANCED MATERIALS FOR ENERGY AND ENVIRONMNETAL APPLICATIONS(AMEEA-23) in 2023": true
  },
  
  "milestones": [
    {
      "year": 2017,
      "event": "Completed a minor research project worth Rs.1.2 lakhs funded by UGC."
    },
    {
      "year": 2015,
      "event": "Completed a major research project worth Rs.50.7 lakhs funded by DST (TSD)."
    },
    {
      "year": 2012,
      "event": "Completed a major research project funded by UGC, New Delhi."
    }
  ],
  "labs": [
    {
      "topic": "Prafulla Chandra Ray Chemistry Laboratory",
      "detail": [
        "- Chemistry Laboratory was established from the inception of the college and now it has latest facilities and infrastructure to support up to research level.",
        "- It has an area of 523.38 sq.mt & Research Lab of 51.35 sq.mt with the equipment worth Rs. 34, 86,334 are available.",
        "- Chemistry Laboratory has all the necessary glassware's and equipments for carrying out the experiments prescribed in the syllabus of I year B.E/B.Tech",
        "- Both the Chemistry & Research Laboratories offered several consultancy activities like Water Quality Parameter Analysis, Trace Element Analysis in Food Products, Adsorption studies, Synthesis of Nanomaterials, Testing Trace Elements in Soil and M.Sc., project guidance etc.,",
        "* Equipments available",
        "- Digital Potentiometer",
        "- Digital Conductivity meter",
        "- pH Meter",
        "- Spectrophotometer",
        "- Hot Plate with Thermostat",
        "- Digital Balance",
        "- Rough Balance",
        "- Electrical Bunsen",
        "- Water Bath",
        "- Electrical centrifuge machine",
        "- TDS meter",
        "- Hot plates",
        "- RO System"
      ],
      "image": "/assets/images/Laboratories/Chemistry/chemistry.jpg"
    },
    {
      "topic": "Centre for Environment Research Laboratory",
      "detail": [
        "* Equipments available",
        "- Flame Photometer",
        "- Digital Balance",
        "- Melting Point Apparatus",
        "- Refrigerator with stabilizer",
        "- Muffle Furnace",
        "- Hot Air Oven",
        "- Bio spectro-photometer",
        "- Digital Colorimeter",
        "- Inhibitor Orbital Shaker",
        "- Electrical centrifuge machine",
        "- Turbidity meter",
        "- Microwave oven",
        "- Magnetic drive pump",
        "- Suction pump",
        "- COD Analyser",
        "- COD Digestor",
        "- BOD incubator",
        "- DO Analyser",
        "- Ozonator",
        "- Universal Controller",
        "- pH sensor",
        "- ORP Sensor",
        "- Conductivity Sensor",
        "- Online Turbidity meter",
        "- UV Photo reactor",
        "- DC power supply",
        "- Diapharm Pump",
        "- Peristaltic Pump",
        "- Heber Pencil type-  UV Lamp"

      ],
      "image": "/assets/images/Laboratories/Chemistry/research_lab1.jpg"
    }
    
  ],
  "library": {
    "name": "Chemistry Department Library",
    "description": "The Chemistry department has a separate department library...",
    "details": {
      "Number of Titles": "370",
      "Number of Books Available": "06"


    }
  },
  "rnd": {
    "academic": "https://rnd.kongu.edu/academic/chemistry.php",
    "activities": "https://rnd.kongu.edu/activities/snh/index.php"
  },
  "dept_images": [
    "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
  ]
}
