{
  "image": "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png",
  "about": "Master of Computer Applications (MCA) is a postgraduate degree that focuses on advanced computing, software development, and information technology. It integrates core concepts of programming, database management, networking, cloud computing, cybersecurity, and artificial intelligence to develop innovative IT solutions. MCA graduates work in diverse domains such as software development, data analytics, system architecture, and IT consulting, driving technological advancements across industries. With the rapid growth of digital transformation, the field continues to evolve, incorporating emerging technologies like blockchain, IoT, and machine learning. As the demand for skilled IT professionals increases, MCA plays a crucial role in shaping experts who design, develop, and optimize cutting-edge computing solutions for a technology-driven future.",
  "dept-name": "Computer Applications (MCA)",
  "hod_name": "Dr.A.Tamilarasi",
  "intake": 120,
  "Ph.D": "-",
  
  "vision": "To be a centre of excellence for development and dissemination of knowledge in Computer Applications for the Nation and beyond.",
  "mission": [
      "Empower individuals with a strong foundation in Computational knowledge to enable them to become IT professionals to meet societal needs.",
      "Provide recent technology and develop communication, leadership and entrepreneurial skills among students to support continual improvement in the teaching-learning process and research activities.",
      "Impart professional ethics to students and make them socially responsible graduates."
  ],
  "objective": "To equip students with the necessary technical and managerial skills.",
  "peo": [
      "Apply computing and mathematical knowledge to identify, formulate, design, implement and develop  software solutions for problems across a broad range of application domains.",
      "Communicate effectively as an individual and also as a leader in diverse groups and in multi-disciplinary setting.",
      "Develop the professional ethics in work and realize the role of self in the development of society with a strive for independent and life-long learning in the broadest context ever-flourishing technological changes."
  ],
  "po": [
    "Foundation Knowledge: Apply knowledge of mathematics, programming logic and coding fundamentals for solution architecture and problem solving.",
    "Problem Analysis: Identify, review, formulate and analyse problems primarily focusing on customer requirements using critical thinking frameworks.",
    "Development of Solutions: Design, develop and investigate problems with as an innovative approach for solutions incorporating ESG/SDG goals.",
    "Modern Tool usage: Select, adapt and apply modern computational tools such as development of algorithms with an understanding of the limitations including human biases.",
    "Individual and Teamwork: Function and communicate effectively as an individual or a team leader in diverse and multidisciplinary groups. Use methodologies such as agile.",
    "Project Management and Finance: Use the principles of project management such as scheduling, work breakdown structure and be conversant with the principles of Finance for profitable project management. ",
    "Ethics: Commit to professional ethics in managing software projects with financial aspects. Learn to use new technologies for cyber security and insulate customers from malware.",
    "Life-long learning: Change management skills and the ability to learn, keep up with contemporary technologies and ways of working."
  ],
  "pso": [
    "Use computing technologies to solve problems and meet industrial needs.",
    "Become socially responsible person with good leadership quality and effective interpersonal skills."
  ],
  "highlights": {
    "Placement & Internship": [
      "Consistent improvement in Placement and Internship."
    ],
    "Funded Research Projects": [
      "Completed 3 Funded Research Projects worth Rs. 23.01 lakh.",
      "UGC Project: Rs. 5.02 lakh.",
      "AICTE-RPS Project: Rs. 4.45 lakh.",
      "ICMR Project: Rs. 13.54 lakh."
    ],
    "Funded Programs": [
      "Organized funded seminars, FDP, STTP, and workshop programs worth Rs. 35.74 lakh."
    ],
    "Research Centre": [
      "02 approved supervisors.",
      "26 scholars completed Ph.D.",
      "07 scholars pursuing Ph.D."
    ],
    "Faculty Achievements": [
      "Number of Faculty completed Ph.D: 09.",
      "Books publications by the faculty: 16.",
      "Publications by faculty in Journals and Conferences: 477."
    ],
    "Conferences & Sponsorships": [
      "Funded and Self-supporting National & International Conferences organized.",
      "IIT Bombay Sponsored Rs. 2.3 lakh for infrastructure development."
    ],
    "Consultancy Works": [
      "Completed Consultancy Works worth Rs. 25.32 lakh."
    ],
    "MoUs Signed": [
      "TekAfforde",
      "Effitrac Solutions",
      "XESStechLink",
      "VEI Technologies",
      "Smart Chainers",
      "Ingenious Technologies",
      "Nandha Infotech",
      "Tringapps",
      "Atna Technologies",
      "Workline Pvt. Ltd."
    ],
    "Student Achievements": [
      "Students presented & published papers in various National & International conferences and its proceedings."
    ]
  },  

    "milestones": [
      {
        "year": 2022,
        "event": "Received Best Research Department Award."
      },
      {
        "year": 2010,
        "event": "Established CTS sponsored laboratory."
      },
      {
        "year": 2007,
        "event": "60 to 120 intake."
      },
      {
        "year": 1998,
        "event": "30 to 60 intake."
      },
      {
        "year": 1995,
        "event": "30 intake MCA program commenced."
      }
    ],

    "labs": [
      {
        "topic": "Multimedia & Operating System Laboratory",
        "detail": "To perform image editing operations, sound editing operations, 2D/3D animations using Photoshop Tool, sound forge software and flash tools, for providing practical exposure to the students in open source software’s and Linux platform.",
        "image": "/assets/images/Laboratories/Mca/cc2.jpg"
      },
      {
        "topic": "Oracle Laboratory",
        "detail": "ORACLE lab is furnished with 50 personal computers with database client software enabling the students to create and interact with the database. The Application software includes Oracle 10-g which works under Windows and Oracle Express on Linux.",
        "image": "/assets/images/Laboratories/Mca/cc1.jpg"
      },
      {
        "topic": "CTS Open Source Laboratory",
        "detail": "To download Free / Open Source Software’s from the web which will help students to develop their own programs / mini projects and do research projects.",
        "image": "/assets/images/Laboratories/Mca/cc3.jpg"
      }
      
    ],
    
    "library": {
      "name": " Computer Applications Department Library",
      "description": "The Computer Applications department has a separate department library to cater to the specific needs of the Computer Application students. The following is the consolidated data related to the department library.",
      "details": {
        "total_area": "216.62 sq.m",
        "number_of_volumes": "1505",
        "number_of_titles": "909",
        "number_of_project_report_cd": "525",
        "value_of_books_in_rs": "8,99,882.00",
        "number_of_journals": "8",
        "value_of_journals_in_rs": "25,600.00",
        "working_hours": "8:40 AM to 4.30 PM"
      }
    },
    "rnd": {
      "academic": "https://rnd.kongu.edu/academic/ca.php",
      "activities":"https://rnd.kongu.edu/activities/ca/index.php"
    },    
  "dept_images": [
      "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
  ]
}