{
  "image": "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png",
  "about": "Master of Business Administration (MBA) is a professional degree that focuses on developing leadership, management, and strategic decision-making skills for the business world. It integrates core disciplines such as finance, marketing, human resources, operations, and entrepreneurship to prepare professionals for dynamic corporate environments. MBA graduates work in diverse industries, driving innovation, business growth, and organizational success through data-driven strategies and effective management. With the rise of digital transformation, globalization, and emerging markets, the field continues to evolve, incorporating analytics, artificial intelligence, and sustainable business practices. As the demand for skilled business leaders increases, an MBA plays a crucial role in shaping future executives, entrepreneurs, and industry leaders who drive economic growth and organizational excellence.",
  "dept-name": "Management Studies(MBA)",
  "hod_name": "Dr.P.Karthikeyan",
  "intake": 120,
  "Ph.D": "Ph.D in Management is offered",
  
  "vision": "To be a centre of excellence for development and dissemination of knowledge in Management for the Nation and beyond.",
  "mission": [
      "Transform the Student Community into ethically and socially inclined Business Leaders.",
      "Provide a conducive environment for Innovation, Continuous improvement and Value addition in Management education.",
      "Contribute to the whole society by conducting Research, MDPs and Consultancy in Business related areas."
  ],
  "objective": "To equip students with the necessary technical and managerial skills.",
  "peo": [
      "Graduates will be business leaders and managers with leadership and problem-solving skills in the business world.",
      "Graduates will drive entrepreneurship initiatives either on their own or within other organizations where they are employed.",
      "Graduates will update conceptual and practical knowledge in the field of business management to contribute to the business and nation building while upholding ethical practices."
  ],
  "po": [
    "Business Environment and Domain Knowledge:  Graduates are able to improve their knowledge about the fundamentals of business, it's functioning and current strategies adopted across industries.",
    "Critical thinking, Business Analysis, Problem Solving and Innovative Solutions:  Graduates are expected to develop skills on analysing the business data, application of relevant analysis, and problem solving in functional areas such as marketing, finance, operations and human resources.",
    "Leadership and Teamwork:  Graduates are expected to collaborate and lead teams across organizational boundaries and demonstrate leadership qualities, maximize the usage of diverse skills of team members in the related context.",
    "Effective Communication:  Graduates are expected to develop effective oral and written communication especially in business applications, with the use of appropriate technology (business presentations, digital communication, social network platforms and so on).",
    "International Exposure and Cross-Cultural Understanding:  Graduates are expected to demonstrate a global outlook with the ability to identify aspects of the global business and Cross-Cultural Understanding.",
    "Social Responsiveness and Ethics:  Graduates are expected to demonstrate awareness of ethical issues, identify the contemporary social needs and explore the opportunities for social entrepreneurship."
  ],
  "pso": null,
  "highlights": {
    "Faculty & Teaching Excellence": [
      "Highly qualified and industry-savvy faculty members.",
      "Strong in innovative teaching-learning process.",
      "Members of Professional Associations - AIMA, AIMS, MMA, CMA, EDISSIA, CII, YI, etc."
    ],
    "Faculty & Student Participation": [
      "Active participation in Kongu FM Radio, Legal Literacy Club, YI, EMDC, WDC, Career Counselling, HRD & Student Counselling."
    ],
    "Awards & Recognitions": [
      "CII-YI - Best Student Net Nationally for the year 2013 & 2014.",
      "NEN-Best Entrepreneurship Development Cell Award in 2015.",
      "CII Platinum Award for the year 2015.",
      "Best Citizen Consumer Club in Erode District in 2015.",
      "AIMS Best Social Responsibility Award in four consecutive years - 2015, 2016, 2017, and 2018."
    ],
    "Events & Conferences": [
      "Organized Inter-college REPOWIS event 2019 with a historic record of 1000+ active student participation.",
      "Organized ICWA-sponsored 3-day International Conference in 2019 with members from SAARC Nations.",
      "Organized ICSSR-sponsored National Conference on Industry 4.0 in 2021 through Virtual Mode."
    ],
    "Consultancy & Industry Collaboration": [
      "Notable consultancy activities offered to 12 concerns in the past three years.",
      "Signed 4 International and 8 National level Memorandums of Understanding (MoUs) in the past three years."
    ],
    "Research & Funding": [
      "Completed ICSSR-sponsored Research Projects worth Rs. 30 lakhs.",
      "Sanctioned ICSSR-sponsored Major Research Project worth Rs. 6 lakhs."
    ]
  },  
    "milestones": [
      {
        "year": 2021,
        "event": "Conducted ICSSR sponsored National Conference on Industry 4.0."
      },
      {
        "year": 2020,
        "event": "Trimester Pattern."
      },
      {
        "year": 2019,
        "event": "Conducted ICWA Sponsored SAARC International Conference."
      },
      {
        "year": "2015, 2016, 2017, 2018",
        "event": "AIMS Best Social Responsibility Award."
      },
      {
        "year": 2014,
        "event": "Significant Change in Curriculum - Introduction of Professional Skill Lab.."
      },
      {
        "year": 2011,
        "event": "Approved Research Centre by Anna University Coimbatore."
      },
      {
        "year": 2010,
        "event": " Shifted to Centrally air-conditioned premises."
      },
      {
        "year": 2008,
        "event": "Students In-take increased to 120."
      },
      {
        "year": 2004,
        "event": " Ranked as ‘B+’ category in All India Business School survey Conducted by AIMA."
      },
      {
        "year": 2002,
        "event": [
          "Accredited by National Board of Accreditation for 5 years.",
          "Affiliation changed to Anna University."
        ]
      },
      {
        "year": 1997,
        "event": "Students In-take increased to 60 students per year."
      },
      {
        "year": 1994,
        "event": "Programme started with an initial intake of 40 students. (Affiliated to Bharathiar University)."
      }
    ],

    "labs": [
      {
        "topic": "MBA Computer Centre",
        "detail": "This laboratory houses 61 Desktop Computers (INTEL Core i7 Processor) and is furnished with various accounting, operations research, statistical and database management packages. Latest Business Application software like SPSS, IBM SPSS AMOS, TALLY, E-Views, Business Simulation Games and database like Prowess IQ (CMIE) have been installed and is constantly being upgraded. Internet facility is made available enabling the students and faculty to collect and use learning and teaching resources. Availability of latest software package in the area of research helps the students to carry out their project work using advanced statistical tools.",
        "image": "/assets/images/Laboratories/Mba/lab.jpg"
      }
    
    ],
    
    "library": {
      "name": "Management Studies Department Library",
      "description": "The Management Studies department has a separate department library to cater to the specific needs of the MBA students. The following is the consolidated data related to the department library.",
      "details": {
        "total_area": "1980 sq.ft",
        "number_of_titles": "1435",
        "number_of_international_journals/magazines_subscribed": "45",
        "number_of_national_journals/magazines_subscribed": "62",
        "number_of_newspapers_subscribed": "6",
        "online_resources": "PROWESS, EBSCO, J Gate, Delnet Proquest",
        "project_report": "570",
        "others": "Copy of laboratory manuals, special materials and articles prepared by faculty",
        "Audio/Video Cassettes/CDs": "91"
      }
    },
    "rnd": {
      "academic": "https://rnd.kongu.edu/academic/mba.php",
      "activities":"https://rnd.kongu.edu/activities/mba/index.php"
    },    
  "dept_images": [
      "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
  ]
}