{
  "image": "../../../assets/images/Department Banner/chem.jfif",
  "about": "Chemical Engineering is a branch of engineering that focuses on the design, development, and optimization of chemical processes for producing valuable products. It integrates principles of chemistry, physics, mathematics, and biology to develop sustainable and efficient solutions for industries such as pharmaceuticals, energy, food processing, petrochemicals, and environmental engineering. Chemical engineers work on cutting-edge technologies like nanotechnology, renewable energy, biochemical engineering, and process automation to improve production efficiency and environmental sustainability. With the increasing emphasis on green technologies and sustainable manufacturing, the field continues to evolve, addressing global challenges such as climate change and resource management. As industries strive for safer and more efficient processes, Chemical Engineering plays a crucial role in innovation, sustainability, and technological advancement.",
  "dept-name": "Chemical Engineering",
  "hod_name": "Dr.V.Sangeetha",
  "intake": 60,
  "Ph.D": "-",
  "vision": "To be a centre of excellence for development and dissemination of knowledge in Chemical Engineering for the Nation and beyond.",
  "mission": [
      "Impart knowledge to students at all levels through a vibrant, dynamic and state of the art intellectual delivery to ensure the creation of a complete Chemical Engineer with a high sense of social responsibility and professional ethics.",
      "Synergize the efforts of the students and faculty to evolve innovative engineering practices and teaching methodologies.",
      "Generate an environment of continuous learning and research."
  ],
  "objective": "To equip students with the necessary technical and managerial skills.",
  "peo": [
      "Exhibit professional competency in design and development of chemical products, processes and equipment in chemical and allied industries.",
      "Perform research and development by utilizing and continuously upgrading the experimental skills, Mathematical tools, applied software and simulation practices and engage in futuristic progression.",
      "Demonstrate interpersonal skills and leadership qualities and contribute to solve multidisciplinary problems in national and global level."
  ],
  "po": [
    "Engineering knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems.",
    "Problem analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences.",
    "Design/development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations.",
    "Conduct investigations of complex problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data and synthesis of the information to provide valid conclusions.",
    "Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.",
    "The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.",
    "Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.",
    "Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.",
    "Individual and team work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings.",
    "Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions.",
    "Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments.",
    "Life-long learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change."
  ],
  "pso": [
      "Essentials of Chemical Engineering: Correlate theoretical concepts with real time experimental and field data through application of process simulation and analytical techniques.",
      "Chemical Process Design and Development: Develop cutting edge chemical processes, equipment and products for the benefit of the human kind using innovative research and development skills and continuous learning efforts."
  ],
  "highlights": {
    "Research & Publications": [
      "Published 296+ papers in national and international journals",
      "Published 8 Book Chapters",
      "Published 5 Patents"
    ],
    "Funded Research Projects": [
      "33 research projects worth Rs. 173.9 Lakh funded by DST, AICTE, UGC, TNSCST, MOEF, IIChE, KEC (SEED GRANT)"
    ],
    "Research Centre": [
      "33 candidates completed their Ph.D. in the research centre approved by Anna University"
    ],
    "Events Conducted": [
      "Conducted 17 Conferences/Seminars/Workshops/FDPs worth Rs. 26.09 Lakh funded by AICTE, CSIR, and Pidilite Industries"
    ],
    "Student Projects": [
      "20 Student Projects received funds from TNSCST, FAER, and IIChE"
    ],
    "Industry Collaboration": [
      "Signed MoUs with 6 industries/institutes",
      "Consultancy projects worth Rs. 8+ Lakh are currently undertaken"
    ],
    "Student Exchange Program": [
      "Student Exchange Program during 5th semester with University Malaysia Pehang"
    ],
    "Department Awards": [
      "Best Industry Linked Technical Institute (AICTE-CII Survey listed the Department in Platinum Band) - 2015",
      "Best Academic Department from Dr. Kalam Educational Trust for Tribal - 2017",
      "Ambuja’s IIChE Best Student Chapter Award in CHEMCON - 2017",
      "Pidilite ‘Best Student’s Chapter’ Award in CHEMCON – 2018, 2021"
    ],
    "Student Awards": [
      "Bronze Medal from NDRF (2017 – 2018)",
      "Gold and Silver Medals from NDRF (2018 - 2019)",
      "Best Campus Ambassador Award at NIT, Calicut (2018)",
      "Gold, Silver and Bronze Medals from NDRF (2019 – 2020)",
      "Product Winners at SIH, Tie Global, YI – IDS, TNSI, KEC – HACKATHON worth > Rs. 2.15 Lakh"
    ]
  },  

    "milestones": [
      {
        "year": 2023,
        "event": " Celebrated Silver Jubilee Meet of First Batch (1994 – 1998) and Organized SCHEMCON -2023."
      },
      {
        "year": 2022,
        "event": "NBA Accredited for 3 Years."
      },
      {
        "year": 2021,
        "event": " Received approval to organize SCHEMCON – 2023."
      },
      {
        "year": 2020,
        "event": "Accredited by NBA-Tier I for 1 year."
      },
      {
        "year": 2019,
        "event": "Silver Jubilee Celebration."
      },
      {
        "year": 2018,
        "event": "Accredited by NBA-Tier I for 3 years."
      },
      {
        "year": 2017,
        "event": "Started Student Exchange Program."
      },
      {
        "year": 2016,
        "event": "Accredited by NBA-Tier I for 1 year."
      },
      {
        "year": 2015,
        "event": "AICTE-CII Survey listed the Department in Platinum Band; Expansion of floor area (6450 Sq. ft)."
      },
      {
        "year": 2014,
        "event": "Accredited by NBA-Tier I for 2 years."
      },
      {
        "year": 2013,
        "event": "Increase of B.Tech intake from 60 to 120."
      },
      {
        "year": 2008,
        "event": "NBA Accredited for 5 Years for 2nd time; Extension of area – New building."
      },
      {
        "year": 2007,
        "event": "Autonomous Status – Anna University, Chennai."
      },
      {
        "year": 2005,
        "event": "Started Ph.D / M.S. (By Research) Program."
      },
      {
        "year": 2004,
        "event": "Tech intake increased from 40 to 60."
      },
      {
        "year": 2003,
        "event": "Started M. Tech Program."
      },
      {
        "year": 2001,
        "event": "NBA Accredited for 5 years ; Inaugurated IIChE Students’ Chapter."
      },
      {
        "year": 2000,
        "event": "Established Mineral Water Plant."
      },
      {
        "year": 1999,
        "event": "Established Computer Center and R & D Lab."
      },
      {
        "year": 1998,
        "event": "First Batch Students Graduated."
      },
      {
        "year": 1997,
        "event": "Inaugurated  Department New Building, Started Annual National Symposium SYLLOGIC."
      },
      {
        "year": 1995,
        "event": "Inaugurated Chemical Engineering Association."
      },
      {
        "year": 1994,
        "event": "Started B. Tech with an intake of 40."
      }
    ],

    "labs": [
       {
        "topic": "Navier’s Process Simulation Laboratory",
        "detail": [
            "Process simulation laboratory is a unique feature of our department which, with the state of the art process modelling and simulation facilities, contributes to teaching learning process to a remarkable extent. This facility was created for making the students to become familiar with the modern software tools and packages for the design, monitoring and control of chemical processes. The knowledge gained by studying this course would be useful for finding solution to industrial problems such as creating steady-state and dynamic models for plant design, performance monitoring, optimization and troubleshooting.",
            "SOFTWARES AVAILABLE: Aspen ONE Engineering for Universities r5, HTRI-Xchanger Suite Educational 7, Process Simulator, ANSYS 12, MATLAB R2015b, and AutoCAD Student Version."
        ],
        "image": "/assets/images/Laboratories/Chem/simulation.jpg"
      },
      {
        "topic": "Reynolds Fluid Mechanics Laboratory",
        "detail": [
            "Fluid Mechanics laboratory is important in the Chemical Engineering curriculum, since in any process industry, storage, handling and transportation of fluids play a vital role. Chemical Engineers are concerned with transportation of fluids (both liquids and gases) from one location to another through pipes or ducts. This activity requires determination of the pressure drop, friction factor through the system and consequently of the power required for pumping, selection of suitable type of pumping device and measurement of the flow rates.",
            "Equipments in the lab: Venturimeter, Orificemeter , Rotameter, Pitot tube, V-Notch, Open drum, orifice, Straight pipes, Concentric pipes, Helical coil, Valves and pipe fittings, Packed bed column, Fluidized bed column, Centrifugal pump test rig, Reciprocating pump test rig, Gear oil pump test rig (Computerized), Reynolds apparatus, Bernoulli’s theorem apparatus, Fluidized bed heat transfer unit, and Air flow orificemeter."
        ],
        "image": "/assets/images/Laboratories/Chem/fluidmechanics.jpg"
      },
      {
        "topic": "Taylor Mechanical Operations Laboratory",
        "detail": [
            "Mechanical Operations Laboratory involves handling and processing of particulate solids which form the major components of production processes in Chemical industries like Cement, Fertilizer, Paint and Pharmaceuticals, etc. The laboratory is well equipped with sophisticated units for size reduction and size separation operations.",
            "Equipments in the lab: Smooth Roll Crusher, Blake Jaw Crusher, Ball Mill, Hammer Mill, Cyclone Separator, Plate and Frame Filter Press, Vacuum Leaf Filter, Air Elutriator, Beaker Decantation, Batch Sedimentation, Forth floatation, Electro Mechanical Sieve Shaker, Compressor, Pulveriser, Baum Jig, Air Elutriator, Agitated vessel (turbine and propeller), screw conveyor (variable speed) and Rotary drum vacuum filter."
        ],
        "image": "/assets/images/Laboratories/Chem/mechanicaloperations.jpg"
      },
      {
        "topic": "Nusselt Heat Transfer Laboratory",
        "detail": [
            "The lab provides practical knowledge on three basic modes of heat transfer and their applications in industrial heat transfer operations. Experiments help the students to gain practical experience on various heating/cooling mechanisms to understand the principles of thermo-fluid/solid sciences. The lab also extends facilities for conducting UG, PG and Ph. D research projects.",
            "Equipments in the lab: Double pipe heat exchanger, Shell and tube heat exchanger, Vertical condenser, Horizontal condenser , Heat transfer in agitated vessel , Transient heat conduction (constant Q & T), Heat transfer in plain and Finned tube, Plate and Spiral type Heat Exchanger, Stefan Boltzmann apparatus, Heat Transfer in Natural Convection, Heat Transfer through forced convection, Heat Transfer through Packed bed , Revomax Boiler, Single Effect Evaporator, Thermal Conductivity, Emissivity Apparatus, Composite wall, and Pool boiling Apparatus."
        ],
        "image": "/assets/images/Laboratories/Chem/processheat.jpg"
      },
      {
        "topic": "Ficks Mass Transfer Laboratory",
        "detail": [
            "The lab facilitates the students to understand the fundamental concepts of interphase Mass Transfer. Experimental studies equip the students with the necessary input for the design/operation of complex equipment for mass transfer operations like absorption, distillation, crystallization, extraction etc. The lab also extends facilities for conducting UG, PG and Ph. D research projects.",
            "Equipments in the lab: Tray Drier, VLE Set up, Steam distillation unit, Simple distillation unit, Diffusivity Apparatus, Surface Evaporation set up, Wetted Wall Column, Absorption Column, Vacuum Dryer, Sieve plate distillation column, Rotating disc contactor, Packed column extractor, Packed column distillation."
        ],
        "image": "/assets/images/Laboratories/Chem/masstransfer.jpg"
      },
      {
        "topic": "M M Sharma Chemical Reaction Engineering Laboratory",
        "detail": [
            "The lab aims to provide necessary practical knowledge on technical inputs like rate of reactions under different thermodynamic and reactor conditions necessary for the optimum design of a reactor. Experiments related to chemical kinetics and operation of batch and continuous reactors are conducted in the lab. The lab also extends facilities for conducting UG, PG and Ph. D research projects.",
            "Equipments in the lab: Tubular reactor, Batch reactor, RTD study pulse, Plug flow reactor, Continuous stirrer tank reactor, Mixed flow reactor in series, Bubble Column reactor, Combined Reactor – plug flow and mixed flow, Bio chemical reactor, Peristaltic Pump, Auto Clave, Constant Temperature water bath with shaker, Brookfield Rheometer (Viscometer), Conductivity controller, Fluidized – bed, Fluid solid catalytic reactor, Non – Fluid solid catalytic reactor, Jet Mixer."
        ],
        "image": "/assets/images/Laboratories/Chem/chemicalreactionlab.jpg"
      },
      {
        "topic": "G H COHEN & G A COON’S Process Dynamics and Control Laboratory",
        "detail": [
            "Process Dynamics and Control Laboratory has been established to illustrate the function of basic controller modes (ON/OFF, P, PI, and PID) and working principle of various control valves, etc. The lab extends facilities for carrying out hands on practice on Control System Simulation using MATLAB Simulink. The lab also extends facilities for conducting UG, PG and Ph. D research projects.",
            "Equipments in the lab: Two tank Interacting System & Non interacting system, Single tank system, Pressure control trainer, Level control trainer, Flow control trainer, Temperature control trainer, Feed-forward controller, Control value characteristic."
        ],
        "image": "/assets/images/Laboratories/Chem/processdynamics.jpg"
      },
      {
        "topic": "Venkata Raman Applied Chemistry Laboratory",
        "detail": [
            "The Lab is facilitated with instruments to provide the practical knowledge on Inorganic, Organic, and Physical Chemistry. Educate students to design and create environmentally benign chemical processes as well as to inculcate the practice of green technologies to develop sustainable Chemical Systems. This laboratory is associated with research components to help student and research scholars to address critical issues pertaining to environmental sustainability.",
            "Instruments in the Laboratory: Atomic Absorption Spectrophotometer, UV- Vis Spectrophotometer (Single Beam & Double Beam),Micro Calorimeter, Flame photometer, ABBE Refractometer, Electrical Centrifuge, Electron Microscope, BOD Incubator, Hot Air Oven, and Muffle Furnace, etc."
        ],
        "image": null
      },
      {
        "topic": "Fabrication Laboratory",
        "detail": [
            "Fabrication Lab is a cutting-edge facility designed to support innovative research, design, and development of process equipment. Equipped with state-of-the-art welding facilities, precision tools, and expert technical support, the lab enables students and faculty to collaborate on projects that foster practical learning, innovation, and industry-relevant expertise.",
            "Equipment in the lab: Cutting Machine, Jig Saw Machine, Angle Grinder, Drilling Machine, Welding Machine."
        ],
        "image": "/assets/images/Laboratories/Chem/fabricationlab.jpg"
      },
      {
        "topic": "Testing and Analysis of Petroleum Products Laboratory",
        "detail": [
            "Petroleum Testing and Analysis Laboratory is equipped with all the equipment’s for testing and analyzing the properties and qualities of petroleum products and other petroleum-related substances such as gasoline, kerosene, petrol, diesel etc., . The equipment can measure a variety of properties, including; flash point, fire point, viscosity, carbon residue, sulfur content etc. This lab finds the major application in petroleum refineries and fuel sectors.",
            "Equipment in the lab: Reid vapour pressure test apparatus, Carbon residue apparatus, Copper corrosion test apparatus, Petroleum ASTM Distillation apparatus, Smoke point apparatus, Cloud and Pour point apparatus, Penetrometer, Flash and Fire point apparatus, Drop point apparatus, Aniline point apparatus, Saybolt viscometer."
        ],
        "image": "/assets/images/Laboratories/Chem/petroleumlab.jpg"
      },
      {
        "topic": "Chemical Engineering Thermodynamics Laboratory",
        "detail": [
            "The Chemical Engineering Thermodynamics Laboratory is a crucial facility designed to reinforce theoretical concepts through hands-on experimentation. It provides undergraduate students with practical exposure to thermodynamic principles, including the study of energy transformations, phase equilibria, and thermodynamic properties of pure substances and mixtures. The Chemical Engineering Thermodynamics Laboratory serves as a foundation for understanding energy interactions in chemical processes, equipping students with the knowledge required for advanced studies and practical applications in chemical industries.",
            "Equipment in the lab: Density meter, Digital Bomb Calorimeter, Piston Cylinder Assembly, Electronic balance."
        ],
        "image": "/assets/images/Laboratories/Chem/thermodynamics.jpg"
      }
     
    ],
    
    "library": {
      "name": "Chemical Engineering Department Library",
      "description": "The Chemical Engineering Department Library has been established to facilitate the faculty and students to have access to books, journals, (including electronic journals) online databases, magazines pertaining to Chemical and Allied Engineering subjects. The following is the consolidated data related to the department library.",
      "details": {
        "total_area": "59 sq.m",
        "number_of_titles": 246,
        "number_of_books": 565,
        "number_of_national & international_journals": "15/4",
        "number_of_newspapers subscribed": "3",
        "project_report": "All the BTech and MTech degree project work reports since 1998",
        "others": "Copy of laboratory manuals, special materials / articles prepared by faculty",
        "number_of_visuals": "27"
      }
    },
    "patents": {
      "details": [
        {
          "S.N": 1,
          "Name": ["Shanmugan Sri Sakthi", "Saravana Prabhu","Babu Jagadesan","Ramachandran Vijayaraj","Subramanian Senthil Kumar"],
          "Title": "Mineralization of a Model Pollutant over Silver Modified TiO 2 Immobilized on a Rotating Cylindrical Reactor",
          "Guide": "Dr.N.Velumani",
          "Patent No": "211890",
          "Status": "2004"
        }
      ]
  },   
    "rnd": {
      "academic": "https://rnd.kongu.edu/academic/chemical.php",
      "activities":"https://rnd.kongu.edu/activities/chem/index.php"
    },    
  "dept_images": [
      "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
  ]
}