{
  "image": "https://img.freepik.com/free-photo/person-using-ar-technology-their-daily-occupation_23-2151137517.jpg?t=st=1742316233~exp=1742319833~hmac=0445d7af0510bf642933e543fa19a030a8de1172c6bf050f78913509b2c64ce4&w=2000",
  "about": "The Department, recognized as a Research Centre, offers facilities leading to the degree of Doctor of Philosophy in diverse areas of Physics including Solid State Physics, Materials Science, Nuclear Physics, Quantum Mechanics, Spectroscopy, Nanoscience and Nanotechnology, Thin Film Technology, Crystal Growth, Nonlinear Dynamics, Photonics, Theoretical and Computational Physics, and Renewable Energy Studies.",
  "dept-name": "Physics",
  "hod_name": "Dr.K.Prabu",
  "progoffr": "Ph.D",
  "vision": "To be a centre of excellence for dissemination of knowledge in Physics and to promote innovation for academic and professional success for the welfare of the nation and beyond.",
  "mission": [
      "The Department of Physics is committed to provide adequate knowledge in physics for engineering students through an effective teaching-learning process, to mould them into competent professionals ready to meet global challenges and to promote research activities by nurturing the spirit of innovation among students and members of faculty by providing state-of-the-art facilities in the new areas of science and technology."
  ],
  "objective": "The Department aims to disseminate knowledge and skill based understanding of the concepts of science, especially in areas relevant to Engineering and Technology. The research centre in the department provides an active and dynamic research atmosphere where research on futuristic areas in physics is pursued.",
  
  "highlights": {
    "The department organized a national seminar on “Crystal Growth” during 27-29 January 2005": true,
    "The department is recognized as research centre under Anna University Chennai in 2007, to carry out active research in various fields such as condensed matter physics, spintronics, nanotechnology, thin film technology, polymers, ion implantation and solar energy": true,
    "A major research project on “Synthesis and Study of Pervoskite Structured Nanocrystalline Thin Films for the Application of Information Storage Devices” funded by UGC, New Delhi for Rs.10.24 lakhs was granted in 2010": true,
    "The department conducted a DRDO sponsored silver jubilee year national conference on \"Recent Advances in Crystal Growth and Nanoscience\" during 26 & 27 March 2010": true,
    "BRNS, DST, CSIR, ISRO and AICTE sponsored national conference on \"Spintronic Materials: Nanostructures and Devices\" was conducted by the department during 3- 4 March 2011 and the proceedings was published in the Elsevier online journal “Physics Procedia”": true,
    "The department organized a CSIR sponsored one day National Seminar on \"Recent Trends and Development in the Emerging Field of New Transport Conductors and Device Applications Using Multidisciplinary Approach\" on 19 June 2012": true,
    "The department conducted a DRDO sponsored one day National Seminar on “Recent Trends and Challenges in Lithium Ion Batteries “on 19 December 2012": true,
    "The Department organized a UGC sponsored one day national seminar on “Trends and Opportunities in Energy Efficient Solar Cells for Future Power Needs” on 23 December 2014": true,
    "A minor research project on “Design and development of performance enhancement of wind assisted domestic solar hot water system by filling carbon dioxide – methane – nitrous oxide gases in the collector panel for rural areas” funded by UGC, New Delhi for Rs.2.01 lakhs was granted in 2015": true,
    "A two week ISTE - STTP on engineering physics sponsored by IIT Bombay under national mission on education through ICT, MHRD, New Delhi was organized during 8-18 December 2015": true,
    "The Department is recognized as a remote centre for ASK A QUESTION programme, IIT Bombay": true,
    "BRNS and CSIR sponsored International conference on ‘Energy, Environment and Advanced Materials for a Sustainable Future (ICEEAMSF-2017)’ was organized during 23-24 May 2017": true,
    "CSIR sponsored national seminar on Research issues in nanocomposite polymers for super capacitor fabrication was organized on 12, July 2018.": true,
    "Indian Science Academies education programme Lecture workshop on Research issues on materials used for high energy storage devices was conducted on 16 & 17, August 2018.": true,
    "A research project on “Development of solution processed economical CZTS based absorber thin film for solar photovoltaic applications” funded by UGC-DAE CSR, for Rs.1.35 lakhs was granted in 2018.": true,
    "Indian Science Academies sponsored Lecture workshop (Virtual) on “Recent trends in Material Science” was conducted on September 2020.": true,
    "Webinar (Virtual) on “Nonlinear Dynamics: An Evolving Science” was conducted on 2 November 2020.": true,
    "AICTE sponsored International conference (Virtual) on “Energy, Environment and Advanced Materials for a Sustainable Future” was conducted on 15-16 July 2021.": true,
    "IIPE (KEC) sponsored National level webinar (Virtual) on “From Structural to Function via Algorithms and Simulations” was conducted on 22-23 September 2021.": true,
    "Faculty Development Program (Virtual) on “Teaching Methodologies and Design Thinking” was conducted on 23 October 2021.": true,
    "Webinar on “Titanium Based Materials for Dental Filling and Bioplant Applications” was conducted on 13 November 2021.": true,
    "Webinar on “Soil Physics” was conducted on 13 November 2021.": true,
    "Indian Science Academies sponsored Lecture workshop (Virtual) on “The Applications of Condensed Matter Physics” was conducted on 11-12 May, 2022.": true,
    "Research projects of worth 4.90 lakhs and 4.69 lakhs were sanctioned through KEC Seed Grant Research Scheme during the academic year 2020-2021 & 2021-2022.": true,
    "A national level webinar on “Energy Materials” was organized for the students on 17 November 2023 in commemoration with 40th inception day celebrations of the institution.": true,
    "A self-supporting five day national level online FDP on “Up skilling for the future” was conducted on 22-26 April, 2024.": true,
    "Indian Science Academies sponsored lecture workshop on “Physics for Engineering” was conducted on 02-03 September, 2024.": true
  },  

    "labs": [
      {
        "topic": "Physics Laboratory",
        "detail": [
            "Three physics laboratories have been established with an area of 523.38 sq.m. and with equipment worth Rs.15.36 lakhs. Thin film research laboratory was established with an area of 51.35 sq.m. and with equipment worth Rs.15 lakhs."
        ],
        "image": "/assets/images/Laboratories/Physics/lab1.jpg"
      }
    ],
    
    "library": {
      "name": "Physics Department Library",
      "description": "The Physics department has a separate department library to cater to the specific needs of the students. The following is the consolidated data related to the department library.",
      "details": {
        "number_of_titles": "175"
      }},
      "rnd": {
        "academic": "https://rnd.kongu.edu/academic/physics.php",
        "activities":"https://rnd.kongu.edu/activities/snh/index.php"
      },    
    "dept_images": [
        "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
    ]
  }
