{
  "image": "../../../assets/images/Department Banner/auto.webp",
  "about": "Automobile Engineering is a branch of engineering that focuses on the design, development, manufacturing, and maintenance of automobiles. It integrates elements of mechanical, electrical, electronic, software, and safety engineering to create efficient and high-performance vehicles. Automobile engineers work on various aspects, including vehicle aerodynamics, powertrain systems, fuel efficiency, safety features, and advanced technologies such as electric and autonomous vehicles. With the rapid advancements in automotive technology, the field is evolving towards sustainability, incorporating hybrid and electric powertrains to reduce carbon emissions. As the demand for smart and connected vehicles increases, automobile engineering continues to drive innovation in transportation, enhancing performance, safety, and environmental impact.",
  "dept-name": "Automobile Engineering",
  "hod_name": "Dr. P. C. Murugan (w.e.f 01.06.2024)",
  "intake": 30,
  "staffs": 50,
  "lab_count": 10,
  "classrooms": 8,
  "workshops": 5,
  "research_centers": 2,
  "patents_filed": 12,
  "industry_mous": 15,
  "vision": "To be a Centre of Excellence for development and dissemination of knowledge in Automobile Engineering for the nation and beyond.",
  "mission": [
      "Establish an academic center to develop quality automotive engineers through professional teaching learning process.",
      "Develop research interest among the graduates through state-of-the-art facilities.",
      "Promote innovation and industrial consultancy to meet the societal needs."
  ],
  "objective": "To equip students with the necessary technical and managerial skills.",
  "peo": [
      "Pursue successful career in the domain of design, analysis, testing and diagnostics that meet the needs of global industries.",
      "Habituate continuous learning to carry out research and development activities for solving real time multi-disciplinary problems",
      "Demonstrate entrepreneurial skills and contribute to the society as an ethical and responsible citizen."
  ],
  "po": [
      "Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems.",
      "Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences.",
      "Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations.",
      "Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions.",
      "Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modelling to complex engineering activities with an understanding of the limitations.",
      "Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.",
      "Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.",
      "Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.",
      "Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings.",
      "Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions.",
      "Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments.",
      "Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change."
  ],
  "pso": [
      "Analyze the functioning of automotive engine, transmission, chassis and other mechanical systems.",
      "Examine the electrical and electronic systems related to various automotive applications."
  ],
  "highlights": {
      "Conferences organized": "International - 3",
      "Sponsored Seminars / Workshops / FDP organized": "4 (funded by CSIR)",
      "Publications by faculty in journals": 98,
      "Publications by faculty in conferences": 40,
      "Consultancy / training activities carried out": "Rs.5.23Lakhs",
      "Consistent improvement in Placement and Internship": true,
      "Sponsored student’s projects": "06 (IIT Palakkad, SPARK fund and SEED grant)",
      "MoU": [
          "Brakes India", "Wheels India", "Roots Industries", "Niyata Infotech Pvt Ltd, Bangalore", 
          "Sree Saradhambal Automobiles Pvt Ltd, Coimbatore", "Aadhi Cars Pvt Ltd, Coimbatore", "IMIK Technologies, Coimbatore"
      ],
      "State of art laboratory facilities": true,
      "Papers presented by students": "140 and won 20 prizes, 7 prizes from MITs, NITs & other premier institutions",
      "Projects presented by students": "59 and won 25 prizes, 6 prizes from IITs.",
      "Participation in National and International Events": [
          "KPIT", "E-Kart", "Baja", "Go-kart", "E-Kart", "Aero Modelling", "Electric Two-Wheeler Design Challenge", "Bicycle Design Challenge"
      ]
  },

    "milestones": [
      {
        "year": 2024,
        "events": [
          "Winner of KPIT SPARKLE, PLATINUM AWARD with Cash Prize of Rs. 7,00,000/-",
          "Received Centre of Excellence Award for Design from Autodesk",
          "Received Startup Winner Award with Cash Prize Rs. 30,000/-",
          "Winner of VIT Conclave with Cash Prize Rs. 25,000/-",
          "Winner of Electric Kart with Cash Prize Rs. 40,000/-",
          "Winner of Yi Innovation Challenge with Cash Prize Rs. 75,000/-",
          "92% Students Graduated in 2023 Batch",
          "Organized National level SAE India Student Convention on 25, October 2024"
        ]
      },
      {
        "year": 2023,
        "events": [
          "Achievement of 100% Placement",
          "Research Centre recognition by Anna University",
          "Received Certificate of Appreciation award from MathWorks"
        ]
      },
      {
        "year": 2022,
        "events": [
          "International Conference organized (ICFEE 2022) with SCI/SCOPUS Journal Publication",
          "Achievement of 100% Placement",
          "Accredited by NBA"
        ]
      },
      
      {
        "year": 2021,
        "event": "Jointly Organized IEEE Conference with Institute of Information Technology, Pune"
      },
      {
        "year": 2019,
        "events": [
          "Establishment of Automotive Embedded Systems Laboratory",
          "Participation and Won prizes in Bharath Karting Championship Season – 1 & 2"
        ]
      },
      
      {
        "year": 2018,
        "events": [
          "Received Sponsored SUV EcoSport Vehicle from Ford India, Chennai",
          "1st International Conference Organized in collaboration with Civil, Mechanical & Mechatronics departments (ICSMDA 2018)",
          "Participated in SAE BAJA and secured 23rd National Position"
        ]
      },
      {
        "year": 2017,
        "event": "Organized SAE, India 11th National Student Convention"
      },
      {
        "year": 2015,
        "event": "BE (Automobile Engineering) program commenced"
      }
    ]  ,

    "labs": [
      {
        "topic": "Automotive Chassis Component Laboratory",
        "detail": "The main objective of the Automotive Chassis Components Laboratory is to gather knowledge in order to apply the skills of disassembling and assembling chassis components. The primary aim of this lab is to teach the students about various components in detail and how to disassemble and reassemble them.",
        "image": "/assets/images/Laboratories/Auto/Chassis_Lab.png"
      },
      {
        "topic": "Automotive Engine Components Laboratory",
        "detail": "Automotive Engine Components Laboratory is fully equipped with different types of IC engines, like single-cylinder and multi-cylinder engines, various engine components like carburetors, cooling systems, lubricating systems, and cut-section models of turbochargers and superchargers. This laboratory is also equipped with a high-speed and low-speed engine with mechanical and eddy current loading arrangements, an AVL444 exhaust gas analyzer, an AVL 437 smoke meter, an advanced engine combustion analyzer, a cut section of the clutch, various types of gearboxes, constant velocity joints, and differential gear.",
        "image": "/assets/images/Laboratories/Auto/Engine_Lab.png"
      },
      {
        "topic": "Automotive Fuels And Lubricants",
        "detail": "The main goal of this laboratory is to identify the characteristics of various fuels and lubricants and compare them to benchmarks in order to gauge their quality. The research-level equipment available in the laboratory includes Cleveland’s Open Cup Flash and Fire Point Apparatus, Redwood Viscometer, Digital Bomb Calorimeter, Abel Flash Point Apparatus, Aniline Point Test Apparatus, Junkers Gas Calorimeter, and Oil Extracting Machinery.",
        "image": "/assets/images/Laboratories/Auto/Fuels_Lab.png"
      },
      {
        "topic": "Automotive Electrical Laboratory",
        "detail": "Automotive Electrical Laboratory is Equipped with an Auto Electrical Test Bench with necessary field I/O Devices, Starting Systems Assembly Unit, Charging System Assembly Unit, Ignition System Assembly Unit, Vehicle Lighting System Unit, Vehicle Batteries, and Multi-Point Electronic Fuel Injection Systems.",
        "image": "/assets/images/Laboratories/Auto/Electrical_Lab.png"
      },
      {
        "topic": "CAD Laboratory",
        "detail": "CAD Centre has 36 terminals, networked with two servers. The latest software in the CAD area has been purchased and continuously upgraded. The centre is kept open for students up to 9 pm. This enables students and faculty to learn the latest software and carry out research work. The following software is used for modeling, analysis, and simulation purposes: CREO 7.0, Solid Works 18-19, MATLAB 2022b, ANSYS 2020R1, and ALTAIR Inspire 2022.",
        "image": "/assets/images/Laboratories/Auto/CAD_Lab.png"
      },
      {
        "topic": "Automotive Embedded Laboratory",
        "detail": "The Automotive Embedded Lab aids students in developing their understanding of the architecture, programming, and interface of various processors and microcontrollers. Students can hone their talents in the areas of microprocessors, microcontrollers, and their automotive applications. The features and amenities offered in this lab assist students in completing their projects and expanding their knowledge of automotive embedded technologies.",
        "image": "/assets/images/Laboratories/Auto/Embedded_Lab.png"
      },
      {
        "topic": "Vehicle Maintenance Laboratory",
        "detail": "The Vehicle Maintenance Laboratory is a place where students can get knowledge about how to service and maintain different types of vehicles for their continuous performance and reconditioning work. Students will gain direct, practical exposure to the service and maintenance of all important vehicles and their sub-systems. This lab is fully equipped with machines like a computerized wheel aligner, wheel balancer, tire inflator, tire remover, A/C gas refilling machine, valve grinding machine, valve lapping machine, headlight aligner, and two-post lifts. Measuring instruments, general and special purpose tools, and air power tools such as pneumatic guns are also available in this lab for vehicle service and maintenance jobs. The lab is also capable of doing several consultancy works related to all types of vehicle service and maintenance.",
        "image": "/assets/images/Laboratories/Auto/Vehicle_Lab.png"
      }
    ],
    
    "library": {
      "name": "Automobile Engineering Department Library",
      "description": "The Automobile engineering department has a separate department library to cater to the specific needs of the Automobile Engineering students. The following is the consolidated data related to the department library.",
      "details": {
        "total_area": "114.7 sq.m",
        "number_of_titles": 150,
        "number_of_project_report_cd": 91,
        "value_of_books_in_rs": "63,167.00",
        "number_of_journals_and_magazines": "7/2",
        "value_of_journals_in_rs": "23,500.00",
        "working_hours": "8:40 AM to 4:30 PM"
      }
    },
    "rnd": {
      "academic": "https://rnd.kongu.edu/academic/automobile.php",
      "activities":"https://rnd.kongu.edu/activities/automobile/index.php"
    },    
  "dept_images": [
      "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
  ]
}