{
  "image": "https://img.freepik.com/free-photo/person-using-ar-technology-their-daily-occupation_23-2151137517.jpg?t=st=1742316233~exp=1742319833~hmac=0445d7af0510bf642933e543fa19a030a8de1172c6bf050f78913509b2c64ce4&w=2000",
  "about":"B.Sc. Computer Technology Undergraduate (CTUG) is a comprehensive academic stream offering three specialized 3-year degree programs: B.Sc. Computer Systems and Design, B.Sc. Information Systems, and B.Sc. Software Systems. These programs are designed to equip students with in-depth knowledge and practical skills in modern computing technologies. The B.Sc. Computer Systems and Design course emphasizes the architecture, development, and optimization of computer hardware and software systems. B.Sc. Information Systems focuses on the application of technology in business and organizational settings, covering topics such as data management, system analysis, and IT infrastructure. Meanwhile, B.Sc. Software Systems prepares students for software development and engineering roles, with a strong foundation in programming, algorithms, and application design. Together, these programs foster analytical thinking, problem-solving, and technical proficiency, preparing graduates to thrive in the dynamic fields of IT, software development, and digital transformation.",
  "dept-name": "Computer Technology-UG",
  "hod_name": "Dr.S.Kalaiselvi",
  "prog_offr":["CSD, IS, SS"],
  "csd":60,
  "is":60,
  "ss":60,  
  "vision": "To become a technically competent centre in the domain of computer science to take care of the global industrial needs.",
  "mission": [
      "Develop inventive, proficient, ethical and quality conscious software professionals.",
      "Produce stake holders who can contribute to technological development and social upliftment.",
      "Provide students with the state-of-art technologies to excel in academics to meet the IT industrial needs."
  ],
  "objective": "To equip students with the necessary technical and managerial skills.",
  "csddesc": "This branch of study focuses on providing the knowledge and skills necessary to develop new paradigms for the design and development of state-of-the-art software projects by incorporating the technologies of computer science.",
  "csd-peo": [
      "Be successfully employed as Software developer and/or accepted into higher education.",
      "Engage in professional development with the ability to progress in the organization.",
      "Adapt to societal changes of industries, lifelong learning and entrepreneurial endeavours."
  ],
  "csd-pso": [
      "Analyze, develop and provide solutions to industrial problems in computer domain using programming, data processing and analytical skills.",
      "Apply software application oriented skills to innovate solution to meet the ever changing demands of IT industry."
  ],
  "isdesc": "This branch of study focuses on the use of computer technology and information management methods to solve problems, by understanding the gamut of product development and web-based applications.",
  "is-peo": [
      "Practice in computer and information systems related field and/or pursue advanced studies.",
      "Function as a responsible professional and to adapt to an ever-changing environment.",
      "Incorporate ethical values and continuous learning to resolve societal issues."
  ],
  "is-pso": [
      "Provide solutions for the problems of computer and information systems domain, using programming, web scripting and information security skills.",
      "Apply software professional skills to enhance IT oriented services."
  ],
  "ssdesc": "This branch of study emphasizes critical thinking and design considerations involved in software-enabled systems, by acquiring the knowledge and skills of software engineering and development.",
  "ss-peo": [
      "Flourish in software profession and/or pursue post-graduation.",
      "Exhibit professional competency and contribute to the intellectual foundation of software engineering discipline.",
      "Live and work as contributing, well-rounded member of society."
  ],
  "ss-pso": [
      "Design, develop and manage the problems in the field of software engineering using programming, project management and analysis skills.",
      "Create and provide robust solutions for the complex industrial problems using effective project management skills."
  ],
  "po": [
    "Engineering knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems.",
    "Problem analysis: Identify, formulate, research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences.",
    "Design/development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations.",
    "Conduct investigations of complex problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions.",
    "Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.",
    "The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.",
    "Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.",
    "Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.",
    "Individual and team work: Function effectively as an individual.",
    "Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large.",
    "Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work.",
    "Life-long learning:  Recognize the need for and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change."
  ],
  
  "highlights": {
    "Establishment": [
      "Started in the year 1996."
    ],
    "Faculty": [
      "14 faculty members with PhD.",
      "11 faculty members pursuing PhD."
    ],
    "MoUs Signed": [
      "CISCO, Singapore - Established CISCO academy for training.",
      "C-DAC, Bengaluru - Collaboration in High Performance Computing.",
      "Datalore, Bengaluru - Students’ project development.",
      "Botminds, Chennai - Training students based on industrial needs.",
      "Society for Electronic Transaction and Security, Chennai - Training in Cyber Security.",
      "ACME SYSTEM, Coimbatore - Inplant training for better career opportunities.",
      "WIZAARD SYSTEMS, Coimbatore - Industry-student interaction to develop problem-solving skills.",
      "ACCENT TECHNO - Guest lectures and internships to improve technical skills.",
      "RUBIXE, Chennai - Training students on recent IT industry trends."
    ],
    "Research Grants": [
      "Received Rs. 13 Lakhs from ICSSR and UGC for 2 Research Projects in the past five years."
    ],
    "Funded Programs": [
      "Organized 14 Seminars/Workshops/Conferences/STP with a grant of Rs. 4,81,000/- in the past five years."
    ],
    "Publications & Research": [
      "Presented 78 papers in conferences.",
      "Published 142 research papers in National and International journals in the past five years.",
      "Contributed towards the edition of 15 books.",
      "Published 6 book chapters.",
      "Faculty in editorial board of PPG, IJERSS, ARCCE, LSRT, ARES, Science Publication, BSCWAST-USA."
    ],
    "Software & Consultancy": [
      "Developed software and websites for industry.",
      "Generated revenue of Rs. 3,57,120/- in the past five years.",
      "Actively involved in consultancy activities through IIPC.",
      "Conducted various training sessions for industrial professionals."
    ],
    "Academic Performance": [
      "Sustaining excellent pass percentage in all three courses for the past five years:",
      "CSD: 80.95%, IS: 86.44%, SS: 97.96%."
    ],
    "Sports Achievements": [
      "Won 80 prizes and medals in sports at District, State, and National levels since 2014."
    ],
    "Placement": [
      "Maintaining optimum placement record since 2004.",
      "85% placement rate with reputed MNCs.",
      "Renowned recruiters: Infosys, CTS, TCS, Wipro, ZOHO, CLOUD ASSET, SHANKI Systems, EXALCA, SURESOFT, ACCENTA, Webberax, Vinsinfo."
    ],
    "Student Training & Opportunities": [
      "Continuous training for competitive exams.",
      "Conducting National level technical symposium every year.",
      "Providing industry exposure through in-plant training.",
      "Organizing industry visits for knowledge enhancement.",
      "Conducted 39 non-formal courses benefiting 1000+ students since 2009.",
      "Conducted 8 one-credit courses for technical skill enhancement.",
      "Encouraging student interaction with industry professionals through association activities."
    ]
  },  

    "milestones": [
      
      {
        "year": 2020,
        "event": "Reaccredited by NBA for 1 year."
      }
      
    ],

    "labs": [
      {
        "topic": "CISCO Academy & Mobile Application Development Laboratory",
        "detail": [
          "Offers opportunity to students to an have hands on experience in design and installation computer networks.",
          "The training is designed to meet the present industry standards to qualify the CISCO certifications (CCNA).",
          "Students gain experience in configuring complex networks and implementing and troubleshooting different network configurations.",
          "Mobile computing laboratory was established during the year 2010-2011.",
          "To enable the students to perform the embedded C program with 16F877A microcontroller kit",
          "It helps the students to generate code for some real time applications that can be performed with mobile phone."
        ],
        "image": "/assets/images/Laboratories/Ctug/Computercentre.jpg"
      },
      {
        "topic": "Communication Laboratory",
        "detail": [
          "To make students recognize the sounds of English through Audio-Visual aids and Computer Software.",
          "To help them overcome their inhibitions and self- consciousness while speaking in English and to build their confidence. The focus is on fluency rather than accuracy.",
          "To help the students cultivate the habit of reading passages from the Computer monitor, thus providing them with the required facility to face computer-based competitive exams, such as GRE, TOFEL, GMAT etc.",
          "To train the students to use language effectively to face interviews, group discussions, public speaking, etc.",
          "To expose the students to a variety of self - instructional, learner-friendly and totally inter-active modes of language learning."
        ],
        "image": "/assets/images/Laboratories/Ctug/communication.jpg"
      },
      {
        "topic": "Digital Laboratory & Microprocessor Laboratory",
        "detail": "Digital laboratory was established during the year 2006-07. The IC lab provides an opportunity for the students to work on the various digital design circuits like Adders, Subtractors, Multiplexers, Encoders and Decoders etc., with 74XX series. The lab is equipped with digital IC trainer kit ,Digital IC Tester, Breadboards and Various IC series. This lab is very useful for the students to impart basic Hardware Knowledge.",
        "image": "/assets/images/Laboratories/Ctug/microprocessor.jpg"
      },
      {
        "topic": " Computer Center Laboratory",
        "detail": "Our Department consists of 5 Computer Centers which are equipped with 150 computers with the configuration of Core 2 Duo, Core i3 and Core i5 processors. Laboratories consists of software tools and softwares such as, Packet Tracer- Network Simulatior, Data Mining- R tool, Virtual Box, VM ware, Cloud Sim, AWS, QWIK Labs, Oracle 10G, Anaconda 3.0, Android Studio 3.0.1, NS3, JDK 1.8, JRE 1.8, Rational Rose Suit, Visual Studio, Selenium, Turbo C++, Symantec Endpoint protection, Justinmind Prototyper, Microsoft office 2007, Eclipse, Django, Net Beans IDE, Notepad++, Python 3.4, Apche tomcat, R studio, Raptor, Weka 3.8, Protégé, GCC Compiler, Balsamiq Wireframes, Dev C++, Cassandra, My SQL, Hadoop, Borland C and Communication Softwares such as, Tense Buster, Study Skill Success, Issues in English, CL Client and EL Client.",
        "image": "/assets/images/Laboratories/Ctug/computerlab.jpg"
      }
    ],
    
    "library": {
      "name": "Computer Technology - UG Department Library",
      "description": "The Computer Technology - UG department has a separate department library to cater to the specific needs of the students. The following is the consolidated data related to the department library.",
      "details": {
        "number_of_journals": "12",
        "number_of_titles": "903",
        "project_report": "BSc degree project reports"
      }
    },
    "rnd": {
      "academic": "https://rnd.kongu.edu/academic/ct.php",
      "activities":"https://rnd.kongu.edu/activities/ctug/index.php"
    },    
  "dept_images": [
      "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
  ]
}