{
  "image": "../../../assets/images/Department Banner/civil.jpg",
  "about": "Civil Engineering is a branch of engineering that focuses on the planning, design, construction, and maintenance of infrastructure. It integrates elements of structural, geotechnical, environmental, transportation, and water resources engineering to develop safe and sustainable built environments. Civil engineers work on various projects, including bridges, roads, buildings, dams, and urban planning, ensuring durability, efficiency, and safety. With rapid advancements in construction materials and technology, the field is evolving towards smart infrastructure, incorporating sustainable and resilient designs to address climate challenges. As the demand for modern and eco-friendly cities increases, civil engineering continues to drive innovation in infrastructure, enhancing functionality, sustainability, and societal impact.",
  "dept-name": "Civil Engineering",
  "hod_name": "Dr.S.Balaji",
  "intake": 60,
  "me": 12,
  "phd":"-",
  "vision": "To become a center of excellence to meet the global challenges in the diversified field of Civil Engineering.",
  "mission": [
      "To impart quality Education through effective teaching learning methods.",
      "To encourage students to pursue research activities and to collaborate with industries to promote consultancy activities.",
      "To develop engineers who can participate in the technical advancement and social upliftment of the society."
  ],
  "objective": "The objective of Civil Engineering Department is to disseminate the knowledge above latest technologies in Civil Engineering to the students so that they cater the demand of builders/contractors and construction industry in and around the institution as well as to the needs of the country and abroad.",
  "peo": [
      "Analyse, design and execute projects based on the fundamental knowledge of Civil Engineering.",
      "Implement feasible solution to overcome societal problems using professional knowledge which results in sustainability.",
      "Exhibit professional and ethical attitude, good communication skills and pursue life-long learning skills needed for a successful professional career."
  ],
  "po": [
      "Engineering knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems.",
      "Problem analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences and engineering sciences.",
      "Design/development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations.",
      "Conduct investigations of complex problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions.",
      "Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.",
      "The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.",
      "Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.",
      "Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.",
      "Individual and team work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings.",
      "Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions.",
      "Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments.",
      "Life-long learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change."
  ],
  "pso": [
      "Understand the requirement of the industry and perform effectively with professional skills.",
      "Apply advanced and innovative techniques and methodologies in Civil Engineering Practices."
  ],
  "highlights": {
      "NBA accreditation": [
        "2001", "2008", "2014", "2022"
      ],
      "Best Industry linked department award": [
         "2014-2015", "2018-2019", "2019-2020", "2022-2023", "2023-2024"
      ],
      "Research centre": 8,
      "Faculty members awards and fellowships from": [
        "AICTE", "BOYSCAST", "IE(I)", "CTS", "ASDF", "IITG & IIT M", "IEEE", "ICACI", "SHRISTI", "ANNA UNIVERSITY"
      ],
      "Sponsored research projects": [
        "AICTE", "IE(I)", "Coir Board", "TNSCST", "UGC", "SPARK", "DST & CSIR", "ACI with IIT-M"
      ],
      "Publications by faculty in national and international journals ": 188,
      "Good placement records since from the inception of the program.": true,
      "Students awards from": [
        "ICACI", "IIT Madras", "VIT", "ICTACT", "CII", "ISSRD", "IPTACT", "IE(I)", "Overall Best Outgoing Student(KEC)"
      ],     
      "student’s projects in association with": [
        "IISc", "IIT's", "ICACI", "IE(I)", " TNSCST", " CSIR-SERC", "CSIR-CECRI", "TBI @ KEC", "Other leading private industries" 
      ],
      "MoU": [
          "NHAI", "Larson & Turbo Limited", "Bosch Limited", " RPP Infra Projects Ltd", "URC Construction", " Banka Bioloo", " R.R Thulasi Builders (I) Pvt Ltd"
      ],
      "International certification course":[
        " BIM-Revit", " TEKLA"
      ] 
     },

    "milestones": [ 
      {
        "year": 2024,
        "events": [
         "ACI Outstanding University Award for KEC-ICACI Students Chapter."
        ]
      },
      {
        "year": 2023,
        "events": [
          " Best Performing Department in Industry-Institute Partnership activities (KEC).",
          "ACI Outstanding University Award for KEC-ICACI Students Chapter."
          
        ]
      },
      {
        "year": 2022,
        "events": [
          "ACI Excellence University Award for KEC-ICACI Students Chapter.",
          " Accredited by NBA Tier I for 3 years."
        ]
      },
      {
        "year": 2020,
        "event": [
        "Best Performing Department in Industry-Institute Partnership activities(KEC).",
        "ACI Excellence University Award for KEC – ICACI Students Chapter."
        ]
      },
      {
        "year": 2019,
        "events": [
          " Establishment of Structural Engineering laboratory.",
          "Best Performing Department in Industry-Institute Partnership activities(KEC).",
          " ACI Outstanding University Award for KEC-ICACI Students Chapter."
        ]
      },
      {
        "year": 2018,
        "events": [
          "Best Performing Department in Industry-Institute Partnership activities.",
          "ACI Outstanding University Award for KEC-ICACI Students Chapter."
        ]
      },
      {
        "year": 2017,
        "event": "Establishment of CO2 sequestration sponsored Research Lab IIT-Madras and USA Consulate General, Chennai(6.7lakhs)."
      },
      {
        "year": 2014,
        "event": "Accredited by NBA Tier I for 3 years."
      },
      {
        "year": 2013,
        "event": "B.E intake increased to 240 Students."
      },
      {
        "year": 2012,
        "event": "M.E - Structural Engineering."
      },
      {
        "year": 2008,
        "event": "Accredited NBA for 5 years."
      },
      {
        "year": 2007,
        "event": "B.E intake increased to 120 Students."
      },
      {
        "year": 2005,
        "event": "Recognized as research centre for Ph.D. programme under Anna University, Chennai."
      },
      {
        "year": 2003,
        "event": "M.E - Construction Engineering and Management."
      },
      {
        "year": 2001,
        "event": "Accredited by NBA for 5 years."
      },
      {
        "year": 1984,
        "event": "BE (Civil Engineering) program commenced."
      } 
    ],

    "labs": [
      {

        "topic": "Newmark's Strength of Materials Laboratory",
        "detail": [
          "Strength of Materials Laboratory was established in the year 1984, focused on demonstrating the basic principles in the area of strength and mechanics of materials and structural analysis to the undergraduate students through a series of experiments is the objective of the strength of materials lab.",
          "The following material properties of Steel Rods, Wires, Wood, Paver Block, Tiles, Bricks, Hollow Blocks, Hume Pipes can be determined in the laboratory:",
          "- Impact strength",
          "- Tensile strength",
          "- Compressive strength",
          "- Hardness",
          "- Ductility",
          "* Equipments:",
          "- Universal Testing Machine (1000 kN)",
          "- Torsion Testing Machine (10 kgm)",
          "- Digital Spring Testing Machine",
          "- Digital Wood Testing Machine (5 T)",
          "- Impact Test Machine (Izod and Charpy)",
          "- Digital Rockwell and Brinell Hardness Test",
          "- Vickers Hardness Testing Machine",
          "- Deflection Bench Apparatus",
          "- Mechanical Extensometer",
          "- Universal Testing Machine (400 kN)",
          "- Fatigue Testing Machine",
          "Consultancy and testing activities like Compression test, Tension test, Hardness test, and Bend test are done for Government and Non-governmental organizations."
        ],

        "image": "/assets/images/Laboratories/Civil/newmarkslab.jfif"
      },
      {
        "topic": "Adam Neville Concrete Laboratory",
        "detail": [
          "The concrete laboratory is equipped with all the latest equipment for testing the quality of cement, fine aggregates, and coarse aggregates. Concrete strength tests and analysis are also carried out in this laboratory.",
          "This laboratory is equipped with the following equipment:",
          "- Hand Operated Compression Testing Machine (100t)",
          "- Compression Testing Machine (200 T)",
          "- Digital Compression Testing Machine (200 T)",
          "- Auto Clave for Cement",
          "- Flow Table for Concrete",
          "- Air Permeability Apparatus",
          "- Accelerated Curing Tank",
          "- 4kN Flexural Strength Testing Machine",
          "- Reciprocating Air Compressor & Receiver",
          "- Digital Inclinometer",
          "- Ultrasonic Pulse Velocity & Rebound Hammer",
          "- Concrete Permeability Apparatus – 3 Cell Mould",
          "- Slump Test Apparatus",
          "- Compaction Factor Apparatus",
          "- Mortar Cube Vibrator",
          "- Sieve Shaker (Motorized)",
          "- Concrete Mixer",
          "- Demountable Mechanical Strain Gauge",
          "- Flow Table – Electric Operated",
          "- SCC Workability Test Apparatus",
          "- RCPT Setup"
        ],
        "image": "/assets/images/Laboratories/Civil/adam.jfif"

      },      
      {
        "topic": "Mc Carty Environmental Engineering Laboratory",
        "detail": [
          "The 'Mc Carty' Environmental Engineering Laboratory is well equipped with the latest equipment and testing facilities in the area of drinking water quality analysis, wastewater analysis, sludge analysis, salt contents in soil, etc.",
          "* Equipments:",
          "- Hot Air Oven",
          "- Dessicator",
          "- Incubator",
          "- pH Meter",
          "- Jackson Turbidity Meter",
          "- Centrifuge",
          "- Electronic-Colony Counter",
          "- Vacuum Pump",
          "- Muffle Furnace",
          "- Auto Clave",
          "- D.O Analyser",
          "- LOVI BOND Comparator & Color Disc (Universal)",
          "- Single-Pan Analytical Balance",
          "- Chemical Balance Weighing Box",
          "- Electrical Conductivity Meter",
          "- Imhoff Cone",
          "- Chemical Balance",
          "- COD Apparatus & COD Digestion Apparatus",
          "- Stabiliser",
          "- Nephelo Turbidity Meter",
          "- Electric Bunsen Burner",
          "- High Volume Air Sampler (RDS)",
          "- 8 Digital Colorimeter",
          "- Electronic Balance",
          "- Water Distillation Unit",
          "- Membrane Filter Apparatus",
          "- Zipette (Imported)",
          "- ¼ Hp Pump Motor",
          "- Refrigerator – 230 Lt",
          "- Kjeldahl Full Experimental Setup",
          "- Heating Mantle – 1000 ml Capacity",
          "- Water Bath",
          "- Magnetic Stirrer with Hot Plate 1 Lt",
          "- BOD Incubator",
          "- Jar Test Apparatus",
          "- Digital pH Meter & Digital Conductivity Meter",
          "- UV-VIS Visible Spectrophotometer",
          "- De-Mineraliser",
          "- Jar Test Apparatus - ‘KEMI’ make",
          "- HOT Plate 8” dia - ‘SIGMA’ make",
          "- TDS Meter (DIST 1 & 2) - ‘HANNA’ make",
          "- Digital Flame Photometer “Systronics” make – 130 – Setup",
          "- Electronic Top Loading Balance",
          "Testing and consultancy activities are carried out for various government agencies like the Public Works Department, TWAD Board, Highways Department, and also for various private agencies."
        ],
        "image": "/assets/images/Laboratories/Civil/mccartylab.jfif"

      },      
      {
        "topic": "Khosla Hydraulic Engineering Lab-I & Visvesvaraya Engineering Lab-II",
        "detail": [
          "The Hydraulics Laboratory, established at the inception of the Civil Engineering Department, consists of two labs: one for machinery and another for flow experiments.",
          "The laboratory is fully equipped with all necessary equipment along with their accessories as required for courses in Civil, Mechanical, Mechatronics, and Electronics & Instrumentation Engineering. The laboratory has kept pace with modern technological advancements with the addition of new equipment as and when required.",
          "* Facilities:",
          "- Underground tank capacity: 55,675 litres of water",
          "- Two small sumps for (Pelton wheel turbine & Kaplan turbine) with re-circulation system in Laboratory I.",
          "- Overhead tank: 27,385 litres capacity",
          "- Outside sump: To collect the water from the flow experiments.",
          "* The Fluid Mechanics Laboratory (Lab-II) is equipped with:",
          "- Mouth Pieces and Notches",
          "- Orifice Meters",
          "- Venturi Meter",
          "- Calibration Test Rig for Roto-Meter",
          "- Water-Meter",
          "- Pitot Tube",
          "- Bernoulli's Theorem Apparatus",
          "- Ship Model for Determination of Meta-Centric Height and a Hydraulic Ram",
          "- Impact of Jet on Vanes",
          "- Reynolds Apparatus",
          "- Pipe Friction Apparatus",
          "* The Hydraulic Machinery Laboratory (Lab-I) is equipped with:",
          "- Pelton Wheel",
          "- Kaplan Turbine",
          "- Francis Turbine",
          "- Single & Multistage Centrifugal Pump",
          "- Jet Pump",
          "- Gear Oil Pump",
          "- Submersible Pump",
          "- Vertical Turbine Pump Test Rig",
          "- Compressor Pump Test Rig",
          "- Reciprocating Pump",
          "The laboratory building is provided with adequate ventilation, lighting, and comfortable seating arrangements for students to work. Routine repair and maintenance of all equipment are done by the lab technician with support from a service engineer from outside, who also takes care of annual servicing."
        ],
        "image": "/assets/images/Laboratories/Civil/khosla.jfif"

      },
      
      {
        "topic": "Everest Survey Laboratory",
        "detail": [
          "The Survey Laboratory is equipped with the latest survey equipment such as Total Station, Auto Level, and GPS. Consultancy services are offered in the field of land surveying, preparation of contour maps, setting out works, and partitioning of land properties in different districts of Tamil Nadu.",
          "* Equipments:",
          "- Chain",
          "- Levelling Instrument",
          "- Prismatic Compass",
          "- Plain Table",
          "- Theodolite",
          "- Advanced Total Station",
          "- GPS",
          "* Survey Camp:",
          "The survey camp is conducted for the benefit of students as part of their academic curriculum for four days during their winter vacation."
        ],
        "image": "/assets/images/Laboratories/Civil/everest.jfif"

      },      
      {
        "topic": "V.T. Chow Computational Laboratory",
        "detail": [
          "The Computer Centre in the Department of Civil Engineering was established in the year 1997 to provide knowledge on computer-based analysis, design, and drafting to students, as well as to facilitate research and consultancy activities.",
          "* Facilities:",
          "- Number of Computers: 42 Systems",
          "- Printer: 1"
        ],
        "image": "/assets/images/Laboratories/Civil/vtchow.jfif"

      },      
      {
        "topic": "John Pennycuick Computer Centre",
        "detail": [
          "John Pennycuick Computer Centre was established in February 2017. It provides a platform for students to enhance their knowledge in computer-based analysis, design, and drafting. The centre is also used for research and consultancy activities.",
          "The Computer Centre is well-equipped and air-conditioned with the following facilities:",
          "- 72 computers with the latest software packages",
          "- Printing facilities (Laser Printer)",
          "- Audio System",
          "- Wall-mounted LCD Projector",
          "Additionally, the laboratory has adequate printing facilities and remains open for students beyond working hours."
        ],
        "image": "/assets/images/Laboratories/Civil/jp_cc.jpg"

      },      
      {
        "topic": "Terzaghi Soil Mechanics Laboratory",
        "detail": [
          "The Soil Mechanics Laboratory, established in 1985, meets the requirements of the undergraduate program as well as research and consultancy activities.",
          "* Equipments:",
          "- Direct Shear Test Apparatus",
          "- Vibrating Table",
          "- Proctor Compaction Apparatus",
          "- Loading Frame Motorized",
          "- Sand Pouring Cylinder",
          "- Unconfined Compression Tester (Proving Ring Type)",
          "- Pycnometer",
          "- Consolidation Test Apparatus",
          "- CBR Loading Frame Apparatus",
          "- CBR Mould",
          "- Shrinkage Limit Apparatus",
          "- Liquid Limit Device",
          "- Liquid Limit Cone Penetrometer",
          "- Sieve Shaker (Motorized)",
          "- Plastic Limit Apparatus",
          "- Jodhpur Permeameter",
          "- Automatic Soil Compaction Machine",
          "- Hot Air Oven",
          "- Universal Extruder Hand Operated",
          "- Rapid Moisture Meter",
          "- Vane Shear Apparatus",
          "- Field Test Kit",
          "- Proving Ring",
          "- Plate Load Test Apparatus",
          "- Sieves – Brass",
          "- Standard Penetration Test Apparatus",
          "- Triaxial Outfit",
          "- Infra-Red Moisture Meter with Auto Transformer",
          "- Core Cutter with Accessories",
          "- Electronic Balance",
          "- 3-Gang Consolidation Test Apparatus",
          "- Glassware Items",
          "- Permeability Apparatus",
          "- Swell Pressure Test Apparatus",
          "- Hydrometer with Jar",
          "- California Bearing Ratio Apparatus"
        ],
        "image": "/assets/images/Laboratories/Civil/terzaghi.jpg"

      },
      {
        "topic": "John Macadam Highway Engineering Laboratory",
        "detail": [
          "The Highway Engineering Laboratory is well equipped with the following equipment:",
          "* Equipments:",
          "- Compression Testing Machine",
          "- Impact Testing Apparatus",
          "- Deval Abrasion Apparatus",
          "- Los Angeles Abrasion Machine",
          "- Penetrometer for Bitumen",
          "- Saybolt Viscometer",
          "- Softening Point Apparatus",
          "- Ductility Equipment",
          "- Bitumen Extractor",
          "- Skid Resistance Tester",
          "- Marshall Stability Machine",
          "- California Bearing Ratio Apparatus",
          "Consultancy and testing activities are carried out for government and non-governmental organizations."
        ],
        "image": "/assets/images/Laboratories/Civil/john.jpg"

      },
      {
        "topic": "Structural Engineering Laboratory",
        "detail": [
          "The Structural Engineering Laboratory is well equipped with the following equipment:",
          "* Equipments:",
          "- EOT Crane (5T Capacity)",
          "- Loading Frame (100T Capacity)",
          "- Test Floor (100T Capacity)",
          "- Reaction Wall",
          "- Servo Controlled UTM (100T Capacity)",
          "- Direct Tension Set-up (50kN Capacity)",
          "- Double Acting Hydraulic Jack",
          "- Power Pack (Motorized Pumping Unit) for Hydraulic Jack",
          "- FFT Analyzer, Accelerometer & Impact Hammer",
          "- Crack Opening Displacement (COD) Gauge",
          "- DEMEC Gauge",
          "- Data Acquisition System (24 Channels)",
          "- LVDT",
          "- Load Cell",
          "- Steam Curing Chamber",
          "- Pan Mixer",
          "- Mixer Machine",
          "- Universal Load Cell (20T Capacity)",
          "- Vibrating Table",
          "- Electronic Weighing Machine",
          "Consultancy and testing activities on the behavior of beams, columns, beam-column joints, slabs, and RC frames can be investigated."
        ],
        "image": "/assets/images/Laboratories/Civil/structural.jpg"

      },
      {
        "topic": "Project Laboratory",
        "detail": [
          "The Project Laboratory provides an environment for students to develop their projects and conduct scientific research, experiments, and measurements under controlled conditions.",
          "* Equipments:",
          "- Impact Trill Kit",
          "- Tiles & Plywood Cutter",
          "- Steel Cutting Machine",
          "- Noise Level Meter",
          "- Illuminance Meter",
          "- Rain Gauge",
          "- Relative Humidity Sensor",
          "- TDS Meter"
        ],
        "image": null

      }
    ],
    
    "library": {
      "name": "Civil Engineering Department Library",
      "description": "The Civil engineering department has a separate department library to cater to the specific needs of the Civil Engineering students. The following is the consolidated data related to the department library.",
      "details": {
        "number_of_books": "828",
        "number_of_Video Cassettes": "75",
        "number_of_cd-roms": "17",
        "number_of_charts": "11",
        "number_of_newspaper_subscribed": "3",
        "number_of_international_journals": "80",
        "number_of_national_journals": "22",
        "working_hours": "8:40 AM to 4:30 PM"
      }
    },
    "patents":{
      "details": [
        {
          "title": "Electronic Level Indicator Using Sensors",
          "students_involved": "S.J. Agasaravanan, S. Suresh Kumar, S. Karthikeyan, A.R. Alagarsamy",
          "faculty": "Dr. R. Malathy",
          "status": "Approved (Patent No. 220419)"
        },
        {
          "title": "Carbon-di-oxide Curing Chamber for the Production of CO2 Blocks from Construction and Demolition Debris",
          "students_involved": "M. Diwakar, V. Balakarthikeyan",
          "faculty": "Dr. G.S. Rampradheep",
          "status": "Approved (Patent No. 305934)"
        },
        {
          "title": "System for Supporting Luggage with Wheels While Ascending and Descending Staircases",
          "students_involved": "S. Kaushik, G. Lekha, M. Karthick",
          "faculty": "Mrs. S. Sharmila",
          "status": "Approved (Patent No. 367862)"
        },
        {
          "title": "Concrete Canoe Design",
          "students_involved": "M. Diwakar, V. Balakarthikeyan",
          "faculty": "Dr. G.S. Rampradheep",
          "status": "Approved (Patent No. 328235-001)"
        },
        {
          "title": "Paver Block",
          "students_involved": "Prabhu T, Arunagiri M, Jayashree S, Jawagar P",
          "faculty": "Dr. S. Suchithra, Dr. P.S. Kothai, Mr. S. Venkatachalam",
          "status": "Approved (Patent No. 375458-001)"
        },
        {
          "title": "Permanent Form Work Panel for Reinforced Concrete Beam",
          "students_involved": "Arun R, Dharanyaa R",
          "faculty": "Mr. S. Venkatachalam, Dr. K. Vishnuvardhan, Dr. D. Ambika, Dr. S. Suchithra",
          "status": "Approved (Patent No. 373852-001)"
        },
        {
          "title": "Integral Permanent Panel for Concrete Formwork",
          "students_involved": " - ",
          "faculty": "Mr. S. Venkatachalam, Dr. K. Vishnuvardhan, Mr. S.K. Maniarasan",
          "status": "Approved (Patent No. 364432-001)"
        },
        {
          "title": "Brick Moulding Machine",
          "students_involved": " - ",
          "faculty": "M. Arun Kumar, P. Kulanthaivel, S. Vinodhkumar, P. Ravichandran, T.S. Mukesh, A.R. Krishnaraja, A. Siva Kumar, V. Naveen Raj, K. Sampathkumar",
          "status": "Approved (Patent No. 381983-001)"
        }
      ]
    },   
    "testing":{
      "category": "TESTING/CONSULTANCY",
      "description": "Testing & Consultancy works are carried out in the following diversified fields",
      "fields": [
        "RCC & Steel Structural Design - Detailing",
        "Structural Materials testing",
        "Testing on Beam, Column, Slab, Beam-Column Joint, Frame",
        "Concrete Materials and Concrete Mix Design",
        "Soil testing & Consultancy",
        "Material Testing",
        "NDT",
        "Water Quality Testing",
        "Surveying (Total station, GPS, Layout, Levelling and Setting out works)"
      ],
      "researchFacilities": [
        "Compression Testing Machine (200T)",
        "Vicat Apparatus",
        "Consistometer",
        "Electrical Strain Gauge",
        "Testing Frame 100 T",
        "Rebound Hammer",
        "Ultrasonic Pulse Velocity Tester (TICO)",
        "Compressometer",
        "Concrete Permeability Apparatus",
        "Flow Table",
        "Air Entrainment Meter",
        "Length Comparator",
        "L Box, U Box, V Funnel, Fallibility Box",
        "Environmental Chamber for Plastic Shrinkage Test",
        "U V Visible Spectro Photometer",
        "Universal Testing Machine (40T)",
        "Electronic Universal Testing Machine (100T)",
        "Compression Testing Machine (50T)",
        "Plate bearing test apparatus",
        "SPT test apparatus",
        "Swell Pressure Test",
        "Loading Frame Motorized",
        "Waterproof Cyber Scan Ion Analyser",
        "Auto Shrink Set (According to ASTM C 1698-09)"
      ]
    },
    
    "rnd": {
      "academic": "https://rnd.kongu.edu/academic/civil.php",
      "activities":"https://rnd.kongu.edu/activities/civil/index.php"
    },    
  "dept_images": [
      "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
  ]
}