{
  "image": "../../../assets/images/Department Banner/eee.jpg",
  "about": "Electrical and Electronics Engineering (EEE) is a branch of engineering that focuses on the study, design, development, and application of electrical and electronic systems. It encompasses various domains, including power generation, transmission, and distribution, as well as embedded systems, control systems, signal processing, and telecommunications. EEE engineers work on diverse technologies such as renewable energy, electric vehicles, smart grids, automation, and IoT-based systems. With rapid advancements in electronics and sustainable energy solutions, the field is evolving to meet the growing demand for energy efficiency and intelligent systems. As the world moves towards digitalization and green energy, Electrical and Electronics Engineering continues to drive innovation, enhancing efficiency, connectivity, and sustainability across industries.",
  "dept-name": "Electrical and Electronics Engineering",
  "hod_name": "Dr.M.Karthik",
  "intake": 120,
  "phd": "-",
  "vision": "To be a centre of excellence for providing quality education in the frontier areas of Electrical and Electronics Engineering to benefit the society for the nation and beyond.",
  "mission": [
      "Develop innovative, competent, ethical and quality engineers to contribute for technical advancements to meet societal needs.",
      "Provide state-of-the-art facilities for continual improvement in teaching-learning process and research activities.",
      "Enrich the knowledge and skill of the students to cater to the industrial needs and motivate them to become entrepreneurs."
  ],
  "objective": "To equip students with the necessary technical and managerial skills.",
  "peo": [
      "Succeed in professional career by utilizing fundamental knowledge of basic sciences and engineering.",
      "Design, simulate, analyze and develop Electrical and Electronics Engineering based products which are reliable, cost effective and safe.",
      "Demonstrate communication skills, team work, ethics, codes of professional practice as well as an aptitude for continuous learning."
  ],
  "po": [
    "Engineering knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems.",
    "Problem analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences.",
    "Design/development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations.",
    "Conduct investigations of complex problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions.",
    "Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.",
    "The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.",
    "Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.",
    "Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.",
    "Individual and team work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings.",
    "Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions.",
    "Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments.",
    "Life-long learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change."
  ],
  "pso": [
      "Comprehend and analyse electro dynamic systems using the nuances of electrical and electronics engineering to meet the industrial demands.",
      "Able to apply computational tools for the design, analysis and control of power systems integrated with renewable energy sources and electric vehicle to provide solutions to the real time."
  ],

  "highlights": {
    "R&D Fund Sanctioned": "Rs.101.3 lakhs for the last three years",
    "Seminars/Workshops": ["43 sponsored and self-supporting courses, seminars & workshops organized"],
    "Publications by faculty": ["208 Publications in International/National Journals and Conferences in the last three years"],
    "Energy Auditors & Managers": [
      "Energy Auditors: 4",
      "Energy Manager: 1"
    ],
    "Patents Filed": 30,
    "Awards & Recognitions": [
      "Students won 1st prize in Energy Ambassador Programme for 3 consecutive academic years (2020-2021, 2021-2022, 2022-2023) conducted by IAEMP Chapter",
      "Faculty awards: IEEE Best Researcher Award (2020), IET Innovative Researcher Award (2020), Best Innovator Award - Ulzavan 2020 Awards, Outstanding Scientist (AIRF Awards, 2019), IET CLN & YP Men Engineer Award, Teaching Innovator Award (MHRD, GoI), Best Researcher Awards"
    ],
    "Faculty International Conferences": [
      "2 faculty members mentored IEEE YESIST12 grand finale, 2-3 Sept 2023, Arab Academy for Science, Technology and Maritime Transport, Egypt"
    ],
    "Fellowships": [
      "Raman Research Fellowship - Post Doctoral Research at North Eastern University, Boston, USA",
      "SERB-SIRE Fellowship - Research at Ostfold University, Norway (6 months, Rs. 17.34 Lakhs)",
      "SERB-SIRE Fellowship - Research at Florida State University, USA (6 months, Rs. 17.34 Lakhs)"
    ],
    "International Seminars": [
      "Seminar on Electrical Power Quality Issues by Prof. Angelo Baggini, University of Bergamo, Italy (sponsored by APQI)"
    ],
    "International Collaboration": [
      "Visit by Dr. Joga Dharma Setiawan and Dr. Trias Andromeda from Diponegoro University, Indonesia for India-ASEAN sponsored research"
    ],
    "MoU": [
      "INNOTEC Consultants (IC)",
      "Wise Management Systems",
      "Cranes Software International Limited, Bangalore",
      "ENZEN Global Solutions Private Ltd, Bangalore",
      "Revoltaxe India Pvt Ltd",
      "Botswana International University of Science and Technology",
      "Schneider Electric India Pvt. Ltd."
    ],
    "Consultancy / training activities carried out": "45 activities in the last three years, generating Rs.19 lakhs revenue",
    "Consultancy Activities": [
      "Neyveli Lignite Corporation",
      "Mahindra Water Utilities",
      "Sakthi Auto Components Private Ltd.",
      "BPL India Ltd.",
      "NIMI (National Instructional Media Institute)"
    ],
    "Notable Student Achievements": [
      "Mr. S. Karthik Raj (2010-2011): Attended NASA Conference, USA",
      "Mr. S. Karthikraja (2011 batch): Cleared Civil Services, Assistant Commissioner (IRS), GOI",
      "N. Yogaprasanth (III year): Represented TNP&A NCC Directorate in All India Republic Day Camp 2020"
    ],
    "Student Internships": ["ABB", "BOSCH", "Lucas TVS", "Solitron"],
    "Student Paper Presentations": 383,
    "Student Funded Projects": "17 projects worth Rs. 1,39,000",
    "Sponsored student’s projects": ["11 (funded by TNSCST, IEI, ICTACT)"]
  },
    "milestones": [
      {
        "year": 2025,
        "event": [
            "One of our faculty members received as NPTEL Discipline star & he was felicitated with award at IIT, Madras.",
            "One of our faculty members has been awarded a Travel grant from DST to participate in leadership training program.",
            "One Faculty from Universiti Tenaga Nasional, Malaysia is visiting to pursue Post-doctoral Fellowship funded by DST."
        ]
      },
      {
        "year": 2024,
        "event": [
            "5 Patents were granted and 1 Patent published.",
            "Two Faculty members have completed their Ph.D.",
            "2 Books have been published by our Faculty members.",
            "Received Best Performing Department in Research & Development.",
            "Received a research grant of Rs. 8.83 lakh from ICSSR.",
            "One of our faculty members received DG Commendation Award from Ministry of Defence, New Delhi and it is third time in a row 2016, 2020 and 2024 consecutively.",
            "Received the Best B.Tech. Project awarded from ISTE.",
            "One of our faculty member received Best Engineer - Academics Award from Institutions of Engineers India (IEI).",
            "Received a seminar grant of Rs. 1.00 lakh from ICSSR."
        ]
      },
      {
        "year": 2023,
        "event": [
          "Received a research grant of Rs.6 lakhs funded by ICSSR.",
          "Established an Electrical Foundation laboratory.",
          "Four Faculty members have completed their Ph.D.",
          "One of our faculty members received SERB-SIRE fellowship to undertake his research in Florida State University, USA.",
          "2 of our faculty members have participated as mentors of IEEE YESIST12 grand finale held at Egypt.",
          "2 of our faculty members have been certified as Energy auditors by Bureau of Energy Efficiency.",
          "Received a collaborative research grant of Rs.6.00 lakh from ICSSR.",
          "Re-Accredited for 3 years by NBA."
        ]
      },
      {
        "year": 2022,
        "event": [
          "Received a grant of Rs 1.75 lakh funded by CSIR, SERB, ICSSR and PCRA for organizing seminars / workshops.",
          "MoU’s Signed with 3 leading industries.",
          "One of our faculty members received SERB - International Research Experience (SIRE) fellowship to undertake his research in Ostfold University, Fredrikstad, Norway.",
          "Received Rs 1.25 lakhs funded by NHRC and DAE-BRNS to conduct sponsored seminars.",
          "KEC Best Performing Dept.in MoU Signed."
        ]
      },
      {
        "year": 2021,
        "event": [
          "Received Rs 28.65 lakhs fund by DST for R&D project.",
          "3 of our Faculty members have completed Ph.D.",
          "2 Books have been published.",
          " MoU’s Signed with 7 leading industries.",
          "Received a grant of Rs 70,000 from DRDO, IEEE and NAAC for organizing sponsored seminars.",
          "Established Centre of Excellence in collaboration with Schneider Electric Pvt. Ltd.",
          "Established Centre of Excellence (COE) with Schneider Electric India Pvt.Ltd and signed MOU with major organizations like Thai-Nichi Institute of Technology( Bangkok- Thailand), Botswana International University of Science and Technology (Botswana ). KEC Best Performing Dept.in MoU Signed."
        ]
      },
      {
        "year": 2020,
        "event": [
          "One student participated in TNP&A NCC Directorate in All India Republic Day Camp 2020.",
          "One of our students got selected and represented TNPBA NCC Directorate in All India Republic day Camp 2020 held at New Delhi.",
          "2 Professors Dr.Joga Dharma Setiawan and Dr.Trias Andromeda, Diponegoro University, Indonesia visited the department towards India ASEAN sponsored research.",
          "Two faculty members received SERB - TARE project worth 36.6 lakhs in collaboration with IIT Madras and NIT Trichy.",
          "Received a research grant of Rs.6.79 lakhs funded by DST under TDT project scheme.",
          "Established Industry sponsored lab through Revolt India.",
          "Received a research grant of Rs 18.6 lakhs funded by AICTE for R&D project under RPS scheme.",
          " One of our faculty members received DG NCC Commendation award from Ministry of Defence, New Delhi."
        ]
      },
      {
        "year": 2019,
        "events": [
          "Received DST-SERB ASEAN-India Collaborative Research Project worth of Rs 9 lakhs.",
          "13 patents filed.",
          "MoU signed with ALFA Switchgear and CoreEL Technologies India Pvt. Ltd.",
          "Established Industry sponsored lab through Thick India Technologies.",
          "Received 9.03 lakhs from SERB for ASEAN - India collaborative research project."
        ]
      },
      {
        "year": 2018,
        "event": [
          "2 new laboratories (Advanced Power Electronics Laboratory, Research Laboratory) were established with Rs 13.71 lakhs and KEC Best Department Award.",
          "Received Rs.5.56 lakhs for student projects from TNSCST & IIT-Madras.",
          "MoU signed with two companies - Innovative Invaders and Thick India Technologies.",
          "Two new laboratories (Advanced Power Electronics Laboratory, Research Laboratory)were established worth of Rs 13.71 lakhs.",
          "Received Rs.2.93 lakhs for organizing seminars funded by ICMR, DAE-BRNS, IEEE,DST (SERB) and CSIR.",
          "Received Rs 62.78 lakhs funded by DST under FIST scheme.",
          "Received best performing department award at college level."
        ]
      },
      {
        "year": 2017,
        "event": [
          "Received Rs 1 crore from DST-FIST for renewable Energy.",
          "Received Rs.2.25 lakhs for organizing seminars funded by CSIR, MHRD and AICTE.",
          "Organized One Day National Conference on - Power Control and Energy Monitoring sponsored by IET-YPS.",
          "10 faculty members have received awards from various National/international societies.",
          "One of the faculty members completed his Post-Doctoral Fellowship."
        ]
      },
      {
        "year": 2016,
        "event": [
          "IET KEC student chapter established.",
          "Received Best Department in Industry linked activities.",
          "MoU signed with two companies- KST Wind Engineering India and DMW Electric Industries Private Limited.",
          " One of our faculty members received RAMAN RESEARCH FELLOWSHIP from University Grants Commission to pursue Post Doctoral Research in North Eastern University, Boston, Massachusetts, USA."
        ]
      },
      {
        "year": 2015,
        "event": [
          "Received Best IIPC Award at college level.",
          "DBT sanctioned Rs.50,000/- for organizing a National Seminar."
        ]
      },
      {
        "year": 2014,
        "event": [
          "MHRD sanctioned Rs 1.43 lakhs for organizing two weeks workshop on Control System.",
          "Received a TNSCST sponsored student project."
        ]
      },
      {
        "year": 2013,
        "event": [
          "Awarded the best Industry-linked Institute for Electrical stream by AICTE and CII in association with MHRD.",
          "Received Rs 1.46 lakhs for organizing seminars funded by MNRE, FICCI & APQI.",
          "Prof.Angelo Baggini, Aggregate Professor of Industrial Engineering, University of Bergamo, Italy visited the department for seminar on Electrical Power Quality,sponsored by APQI."
        ]
      },
      {
        "year": 2011,
        "event": "M.E[PED] program started with an intake of 18."
      },
      {
        "year": 2009,
        "event": " New 5 laboratories established (Devices and Circuits lab, Control system lab, DSP lab, Simulation lab, Power electronics lab)."
      },
      {
        "year": 2008,
        "event": " Received Best Department award."
      },
      {
        "year": 2007,
        "event": "Students got first prize (Cash of Rs.1 Lakh) in project competition Tech Top Conducted by IEEE, Trivandrum section."
      },
      {
        "year": 2005,
        "event": "Intake increased to 120."
      },
      {
        "year": 2002,
        "event": [
          "Accredited by Institute of Engineers (India).",
          "M.E (AE) Programme was started with an intake of 25."
        ]
      },
      {
        "year": 2001,
        "event": " Accredited for 3 years thrice by NBA.(2001-2006-2012-2016)"
      },
      {
        "year": 1999,
        "event": "5 Ranks including gold medal were obtained from Bharathiar University."
      },
      {
        "year": 1996,
        "event": "Intake increased to 60."
      },
      {
        "year": 1994,
        "event": "B.E (EEE) program started with an intake of 40."
      }
    ],

    "labs": [
      {
        "topic": "MICHAEL FARADAY ELECTRICAL MACHINES LABORATORY",
        "detail": [
          "Imparts the knowledge about characteristics and behavior of the DC and AC Machines.",
          "Well established with all kinds of motors, generators and latest Drives.",
          "This is the core lab for the Electrical Engineering branch and the ancillary for EIE, Chemical, Mechanical and Mechatronics branches.",
          "* SOFTWARE:",
          "- ANSYS software"
        ],
        "image": "/assets/images/Laboratories/Eee/michael_lab.jpg"

      },
      {
        "topic": "JACK KILBY INTEGRATED CIRCUITS AND CONTROL LABORATORY",
        "detail": [
          "An Integrated Circuits (IC) Laboratory in the field of Electrical and Electronics Engineering (EEE) typically focuses on teaching students and conducting projects related to the design, analysis, and testing of the following:",
          "* ANALOG AND DIGITAL ICs:",
          "- Operational amplifiers (Op-Amps)",
          "- Voltage regulators",
          "- Microcontrollers",
          "- Memory ICs",
          "- Logic gates",
          "* SIMULATION AND ANALYSIS:",
          "- SPICE (Simulation Program with Integrated Circuit Emphasis) for designing and analyzing IC circuits.",
          "* PROJECT WORK:",
          "- Hands-on projects such as audio amplifiers, data acquisition systems, or sensor interfaces.",
          "* MAJOR EQUIPMENTS:",
          "- 100 MHz DSO",
          "- Auto Compute Digital LCR Q Meter",
          "- Analog & Digital IC Tester",
          "- Hall Effect Sensor kit",
          "- Universal Programmer kit",
          "- PIC Microcontroller Programmer kit",
          "- Water Load Rheostat (10A)",
          "- Digital Lab Trainer Kit",
          "- 2/4 MHz Function Generator",
          "* TOTAL COST OF THE LABORATORY: 15,17,692.75"
        ],
        "image": "/assets/images/Laboratories/Eee/jack_lab.jpg"

      },
      {
        "topic": "SCHOTTKY POWER ELECTRONICS AND DRIVES LABORATORY",
        "detail": [
          "The power electronics and electric drives (PED) laboratory provides a platform for undergraduate, postgraduate, and researchers to conduct studies, experiments, and research on:",
          "- Energy efficiency",
          "- Renewable energy",
          "- Electric vehicles",
          "- Industrial automation",
          "- Medical devices",
          "The PED laboratory is equipped with the latest software:",
          "* SOFTWARE:",
          "- MATLAB",
          "- PSIM",
          "* HARDWARE:",
          "- Power electronic converters",
          "- DSP and FPGA-based DC and AC Drives",
          "- Special Drives with Digital Integrated power modulators"
        ],
        "image": "/assets/images/Laboratories/Eee/scottky_lab.jpg"

      },
      {
        "topic": "Heinrich Rudolf Hertz Digital Signal Processing Laboratory",
        "detail": [
          "Digital Signal Processing Laboratory helps to gain knowledge on the DSP processors by implementing real-time applications using FIR and IIR filters.",
          "Equipped with 36 systems, advanced DSP kits like TMS320C5X series & associated software like MATLAB to perform digital signal processing and its applications."
        ],
        "image": "/assets/images/Laboratories/Eee/heinrich_lab.jpg"

      },
      {
        "topic": "William Shockley Devices and Circuits Laboratory",
        "detail": [
          "A Devices and Circuits Lab is an essential part of many electrical engineering and electronics programs. In this lab, students gain hands-on experience with various electronic components and circuits.",
          "* Basic Component Testing:",
          "- Students learn how to use basic electronic components like resistors, capacitors, and diodes.",
          "- Measurement of component values using multimeters and oscilloscopes.",
          "* Circuit Analysis:",
          "- Hands-on practice with Ohm's Law, Kirchhoff's Laws, and circuit analysis techniques.",
          "- Building and analyzing circuits to understand voltage, current, and resistance relationships.",
          "* Project-Based Learning:",
          "- Mini-projects involving BJTs, FETs, amplifiers, oscillators, timers, and digital devices.",
          "* Simulation Software:",
          "- Integration of SPICE software for circuit modeling before physical implementation."
        ],
        "image": "/assets/images/Laboratories/Eee/william_lab.jpg"

      },
      {
        "topic": "Shiva Ayyadurai Modeling and Simulation Laboratory",
        "detail": [
          "The lab facility caters to the needs of Electrical and Electronics Engineering students by offering access to 84 computers with internet connectivity.",
          "* Software Tools:",
          "- MATLAB for mathematical modeling and simulation in electrical engineering.",
          "- Mi Power and Au Power software for power system analysis and design.",
          "- Xilinx Vivado software and FPGA processors (Basys 3, Zynq, and Pynq boards) for digital system design and real-time simulation."
        ],
        "image": "/assets/images/Laboratories/Eee/shiva_lab.jpg"

      },
      {
        "topic": "Thomas Alva Edison Power System Laboratory",
        "detail": [
          "Power system lab helps to update the knowledge of protective relays, electrical power system operation, control, protection, and automation, plant monitoring, and planning.",
          "* Major Equipment:",
          "- 100 KV Transformer Oil Breakdown Test Kit for testing breakdown voltage of various oils.",
          "- Scaled-down model of a transmission line (300KM, 400V, 5 KVA per phase) for performance analysis.",
          "- Relays including Differential relay, Overcurrent relay, Overvoltage relay, and Negative sequence relay for testing relay characteristics."
        ],
        "image": "/assets/images/Laboratories/Eee/thomas_lab.jpg"

      },
      {
        "topic": "G D Naidu Research Laboratory",
        "detail": [
          "Research laboratory focuses on experimental tasks which may aim for new discoveries and advances in Electrical engineering. This laboratory plays a key role in imparting advanced knowledge with recent technologies.",
          "The laboratory has ongoing funded projects worth Rs. 110.34 lakhs, including funding from various agencies like AICTE, DST, SERB, and UGC.",
          "* Major Equipment:",
          "- METREL - MI3108 ST: Electrical and Photovoltaic Tester",
          "- Wind Energy System",
          "- Fuel Cell Test Station",
          "- ACE_MLBX_1302T - DSPACE",
          "- SEMIKRON IGBT Power Module 5kW",
          "- Micro Grid",
          "- Dielectric constant, Tan Delta & Resistivity Test Set",
          "- TEKTRONIX-KEITHLEY 2281S - Battery Simulator",
          "- TEKTRONIX-KEITHLEY 2380 - Programmable DC Electronic Load",
          "- Current Probe - AC/DC Current Sensor BNC Type",
          "- No of computers: 10"
        ],
        "image": "/assets/images/Laboratories/Eee/naidu_lab.jpg"

      },
      {
        "topic": "Schneider Smart Electrical Laboratory",
        "detail": [
          "The Centre of Excellence focuses on recent industrial trends in Home and Industrial Automation.",
          "* Module 4B: Home and Building Installation:",
          "- Basic Automation Safety and Security with smoke detectors, emergency lighting, lightning arrestors.",
          "- Wiring standards, measuring instruments, tools, circuits, design estimation, and planning.",
          "* Module 4A: Industrial Control and Drives:",
          "- Motors/engines, Integrated starter, Electronic Starter, Drives to analyze the functions of an LV switchboard.",
          "- Carry out commissioning and maintenance operations on LV switchboards.",
          "- Configure parameters for communication networks and install PLCs.",
          "- Operation and maintenance on LV Panels."
        ],
        "image": "/assets/images/Laboratories/Eee/schneider_lab.jpg"

      }
    ],
    
    "library": {
      "name": "Electrical and Electronics Engineering Department Library",
      "description": "The Electrical and Electronics Engineering department has a separate department library to cater to the specific needs of the EEE students. The following is the consolidated data related to the department library.",
      "details": {
        "total_area": "1032 sq.m",
        "number_of_volumes": "702",
        "number_of_titles": "686",
        "number_of_project_report_cd": "325",
        "value_of_books_in_rs": "5.26Lakh",
        "number_of_journals_and_magazines": "16/1",
        "value_of_journals_in_rs": "1.05Lakh",
        "C-journals": "55 [33UG + 11(PE) + 11(AE)]",
        "number_of_National/International_Journals_subscribed": "6/6",
        "number_of_newspapers_subscribed": "3(Hindu, Dhina Mani and Indian Express)",
        "project_report": "BE and ME project reports",
        "Others": "Newsletters,Magazines/Articles",
        "Audio / Video_Cassettes": "48",
        "working_hours": "8:40 AM to 4.30 PM"
      }
    },

      "patents":{"details": [
        {
          "Title": "Self Tracking Solar Panel",
          "Students": ["N.Jagadeesh", "R.Rajesh Kumar", "H.Uma Shankar"],
          "Guide": "Ms.A.Durgadevi",
          "Year": 2007,
          "Patent No": "212165"
        },
        {
          "Title": "Automatic Seed Planter",
          "Students": ["N.Kuralarasan", "M.Naveen", "B.Suganya", "R.Gururaja"],
          "Guide": "Ms.S.Gomathy",
          "Year": 2015,
          "Patent No": "357886"
        },
        {
          "Title": "Fast and Efficient Fertilizing Unit",
          "Students": ["R.Gowtham", "J.Ezhilkumaran", "M.Nandhakumar"],
          "Guide": "Dr.N.Senthilnathan",
          "Year": 2016,
          "Patent No": "513211"
        },
        {
          "Title": "Submersible Line Start Reluctance Motor",
          "Students": [],
          "Guide": ["Dr.N.Senthilnathan", "Mr.P.Sethupathi"],
          "Year": 2018,
          "Patent No": "201841040694"
        },
        {
          "Title": "Mobile, Small Size & Renewable Energy Based Power Generating System Useful for Remote Areas",
          "Students": [],
          "Guide": "M.Suresh",
          "Year": 2019,
          "Patent No": "201911022986A"
        },
        {
          "Title": "Fuzzy neural network based PID control system and method thereof for Industrial Process control",
          "Students": [],
          "Guide": "Dr.A.Sheela",
          "Year": 2019,
          "Patent No": "201941024479"
        },
        {
          "Title": "Method for data compression and encryption for Digital Communication based on symbols in information source",
          "Students": [],
          "Guide": "M.Suresh",
          "Year": 2019,
          "Patent No": "201911028221A"
        },
        {
          "Title": "Intelligent Firefighting Mobile Machine",
          "Students": [],
          "Guide": ["Major Dr P S Raghavendran", "M.Suresh", "Dr.T.Logeswaran", "P.Tamilarasu", "D.Sarathkumar", "P.Karthikeyan"],
          "Year": 2019,
          "Patent No": "201911033160A"
        },
        {
          "Title": "Smart System for Cooking Gas Production Using Electromagnetic Generator",
          "Students": [],
          "Guide": "M.Suresh",
          "Year": 2019,
          "Patent No": "201911043172"
        },
        {
          "Title": "System and Method for Real Time Status Notification of Group Chat Without Using Internet",
          "Students": [],
          "Guide": "M.Suresh",
          "Year": 2019,
          "Patent No": "201911044119"
        },
        {
          "Title": "Secure and Real Time Status Notification Based Dynamic Messaging Method using In-Built Message Tool Without Using Internet",
          "Students": [],
          "Guide": "M.Suresh",
          "Year": 2019,
          "Patent No": "201911045703"
        },
        {
          "Title": "Computer Implemented Method for Generating Notification During Call Without Using Internet in Wireless Communication",
          "Students": [],
          "Guide": "M.Suresh",
          "Year": 2019,
          "Patent No": "201911047977"
        },
        {
          "Title": "System Of Agriculture Robot For Automatic Spraying, Seeding, Harvesting And Monitoring Crop",
          "Students": [],
          "Guide": "M.Suresh",
          "Year": 2019,
          "Patent No": "201911052742"
        },
        {
          "Title": "Refrigeration System Of Clay Cool Chamber Using Solar Energy",
          "Students": [],
          "Guide": "M.Suresh",
          "Year": 2019,
          "Patent No": "201911053846"
        },
        {
          "Title": "Multifunctional Cart for Health Monitoring and Movement of Patient",
          "Students": [],
          "Guide": "Dr.M.Karthik",
          "Year": 2020,
          "Patent No": "202011004563A"
        },
        {
          "Title": "Detection of rotor faults on asynchronous motor using motor current signature analysis and instantaneous power analysis method",
          "Students": [],
          "Guide": "Dr.M.Srinivasan",
          "Year": 2020,
          "Patent No": "202011043068"
        },
        {
          "Title": "A System of fault detection and monitoring of solar PV panels using Internet of things",
          "Students": "-",
          "Guide": "Dr.R.Meenakumari",
          "Year": "November 2020",
          "Patent No": "202041047411"
        },
        {
          "Title": "Artificial Intelligence and voice based patients monitoring system",
          "Students": "-",
          "Guide": "M.Sabarimuthu",
          "Year": "November 2020",
          "Patent No": "202041048080"
        },
        {
          "Title": "A reduced switch modular multilevel inverter with fault tolerant capability",
          "Students": "-",
          "Guide": "Dr.S.Albert Alexander",
          "Year": "November 2020",
          "Patent No": "202041047725"
        },
        {
          "Title": "Artificial Intelligence based multifunctional voice activated pen",
          "Students": "-",
          "Guide": "S.Gomathy",
          "Year": "January 2021",
          "Patent No": "202041055911"
        },
        {
          "Title": "A touchless flushing method in corona isolation ward",
          "Students": "-",
          "Guide": "Dr.N.Priyadharshini",
          "Year": "January 2021",
          "Patent No": "202141000386 A"
        },
        {
          "Title": "Fabrication of Novel Cylindrical Thermosyphon for Effective Heat Transfer and its Performance Analysis Using Machine Learning Approach",
          "Students": "-",
          "Guide": "Dr.M.Sivachitra",
          "Year": "March 2021",
          "Patent No": "2020103771"
        },
        {
          "Title": "Unmanned aerial vehicle-based system and method for determining vegetation indices",
          "Students": "-",
          "Guide": "Dr.S.Maheswari",
          "Year": "March 2021",
          "Patent No": "390206"
        },
        {
          "Title": "A Method of Mitigation of Power Quality Events by Conditioning System in Integration of Two Renewable Energy Sources",
          "Students": "-",
          "Guide": "Dr.T.Logeswaran",
          "Year": "March 2021",
          "Patent No": "202141014823"
        },
        {
          "Title": "IOT and cloud based low cost smart irrigation system",
          "Students": "-",
          "Guide": "Dr.T.Logeswaran",
          "Year": "February 2021",
          "Patent No": "202141006738 A"
        },
        {
          "Title": "Designing an electric circuit by using a neural network with bayesian inference to select sub-routes for connecting elements",
          "Students": "-",
          "Guide": "P.Tamilarasu",
          "Year": "July 2021",
          "Patent No": "202141027526"
        },
        {
          "Title": "Deep Learning Based Irrigation Model From The Plant Leaves Pictures To Enhance Crop Production",
          "Students": "-",
          "Guide": "M.Sabarimuthu",
          "Year": "July 2021",
          "Patent No": "202141031730"
        },
        {
          "Title": "Method And System For Detecting Growth And Disease Conditions Based On Vegetation Indices Of Plants",
          "Students": "-",
          "Guide": "Dr.S.Maheswari",
          "Year": "July 2021",
          "Patent No": "415162"
        },
        {
          "Title": "An internet of things based civil engineering water pump with embedded solar system",
          "Students": "-",
          "Guide": "T.Logeswaran",
          "Year": "August 2021",
          "Patent No": "2021103839"
        },
        {
          "Title": "System and method for managing and Sowing seeds using an unmanned aerial vehicle",
          "Students": "-",
          "Guide": "Dr.S.Maheswari",
          "Year": "March 2024",
          "Patent No": "529442"
        },
        {
          "Title": "Fast and Efficient Fertilizing Unit",
          "Students": "R.Gowtham, J.Ezhilkumaran, M.Nandhakumar",
          "Guide": "Dr.N.Senthilnathan",
          "Year": "2016",
          "Patent No": "513211"
        },
        {
          "Title": "Smart Climate Forecasting Robot",
          "Students": "-",
          "Guide": "Dr.M.Suresh",
          "Year": "2024",
          "Patent No": "428180-001"
        },
        {
          "Title": "Artificial Intelligence Based Speech Recognition Device",
          "Students": "-",
          "Guide": "Dr.M.Suresh",
          "Year": "2024",
          "Patent No": "435091-001"
        },
        {
          "Title": "Autonomous Speed Control system for Electric Vehicles",
          "Students": "C.Abimanyu, K.T.Charan, R.Karthi, M.Manikandan",
          "Guide": "Dr.M.Sabarimuthu",
          "Year": "November 2024",
          "Patent No": "202441092005"
        },
        {
          "Title": "Reversable Fuel Cell Device",
          "Students": "-",
          "Guide": "Dr.M.Sabarimuthu",
          "Year": "November 2024",
          "Patent No": "437672-001"
        }
       
      ]
    },    

    "testing":{
      "category": "TESTING/CONSULTANCY",
      "description": "Consultancy works are carried out in the following diversified fields",
      "fields": [
        "Testing",
        "Energy audit",
        "Power Audit",
        "Harmonic analysis",
        "Measurement of various Electrical Parameters"
      ],
      "mac": [
        "Mahindra Water Utilities",
        "Neyveli Lignite Corporation",
        "Sakthi Auto Components Pvt.Ltd",
        "TEKIC – Tirupur",
        "SKM Egg Products Pvt.Ltd",
        "Seshasayee Paper and Boards.Ltd",
        "Mallow International,Karur"
      ],
      "caa":[
       " Dr.N.Senthilnathan - Energy Auditor",
        "Dr.T.Logeswaran - Energy Auditor",
        "Mr.M.Suresh - Energy Auditor",
        "Mr.P.Tamilarasu - Energy Auditor"
      ]
    },
    

    "rnd": {
      "academic": "https://rnd.kongu.edu/academic/eee.php",
      "activities":"https://rnd.kongu.edu/activities/eee/index.php"
    },    
  "dept_images": [
      "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
  ]
}